Que. 1 A boat can cover 36 km downstream and 16 km upstream in 10 hours. It can cover 3 km downstream and
I .2 km upstream in 48 minutes. »vmat is the speed (in km,'hr of the boat when gomg upstream?
1.	2
2.	2.5
3.	3.5
4.	4
Que. 2 A boat goes a distance of 3 km upstream and 42 km downstream in 45 minutes, while it goes 3.6 Ian
upstream and 2.4 Ian downstream in 39 minutes. The speed (in km/h) of the boat when going downstream
Is:
1.	12
2.	9
3.	16
4.	10
 
	2.	25 km/h
 
2.	48
3.	50
4.	45
 
Que. 6 The time taken by a boat to travel 13 km downstream is the same as time taken by it to travel 7 km upstream. If the speed of the stream is 3 km/h, then how much time (in hours) will it take to travel a distance of 44.8 Ian in still water?
1. 42
25
5
5
4. 42
25
 
Que. 7 A boat can go 3 km upstream and 5 km downstream in 55 minutes. It can also go 4 Ian upstream and 9 km downstream in 1 hour 25 minutes. In how much time (in hours) will it go 43.2 km downstream?
1.	4.4
2.	4.8
3.	3.6
4.	5.4
 
Que. 8 In one hour, a man rows his canoe against the stream at Il km,'h and along the stream at 23 km/h. What is   the speed (in km/h) of stream?
1.	6
2.	5
3.	17
4.	16.5
 
Que. 9 The speed of a boat in still water is 15 km/h. The speed of the current is 3 km/h. In how much time (in hours) will the boat travel a distance of 54 km upstream and the same distance downstream?
	1.	 
2
2.	7
3.	6
	4	 
2
 
Que. 10 A boat goes a distance of 4 km upstream in 2 hours and the same distance downstream in 20 minutes. How long will it take to go 102 km in still water?
1.	48 minutes
2.	I hour
 	I -l hours
4
 	I hours
2
Que. 11 A boat can travel 10 Ian upstream and 20 km downstream in 7 hours. It can travel 20 Ian upstream and 10 km downstream in I I hours. What is the speed of the boat in still water?
1.	8 km/h
2.	6 km/h
4 km/h
2 km/h
Que. 12 A boat can travel 60 in 3 hours while going downstream, it can travel 90 km in 5 hours while going upstream. What is the ratio of the speed of boat in still water to the speed of the stream?
1.	10 : 9 2. 
3. 
	4.	19 : 1
 
Que. 13 A man can row a boat in still water at a speed of 5 m/s. He covers a stretch of 200 min a river downstream during high and low tides in 10 s and 25 s respectively. What is the ratio of the speed (in nw/s) of the water flowing in the river during high and low tides?
1.  2. 
3. 
4. 
 
Que. 14 The downstream speed of a boat is 14 kmm. The upstream speed of the boat is 10 km/h. In how much time can it cover 72 km in still water?
1.	12 hours
2.	6 hours
3.	4 hours
4.	8 hours
 
Que. 15 The speed of a boat in still water is 8 km/h. If the speed of the stream is 2 km/h, then how much distance can be boat travel in two hours gomg upstream?
1.	16 krn
2.	14 Ian
3.	20 Ian
4.	12 Ian
 
Que. 16 If the speed of steam is 20% of the speed of boat in still water and it coves 120 km upstream in 150   minutes, then what is the downstream speed of the boat?
1.	75 km/hour
2.	64 km/hour
3.	72 km/hour
4.	80 km/hour
Que. 17 A boat covers 64 km upstream in 8 hours and 120 Ian downstream in 12 hours. What is the speed (in nw/s) of the boat in still water?
1.	3.5
2.	2
3.	2.5
4.	3
 
Que. 18 The speed of a boat in still water is 6 km/h. Time taken by the boat to cover a certain distance upstream is 3 hours more than the time taken to cover the same distance downstream. If the speed of the stream is 2 km/h, then what is the total distance (upstream and downstream) covered by the boat?
1.	24 Ian
2.	18  
3.	36 Ian
4.	48 Ian
Que. 19 The speed of a boat in still water is 30 km/h. If the boat covers 60 	downstream in I hour 30 minutes, then what is the time taken by the boat to cover 60 Ian upstream?
1.	5 hours
2.	3 hours
3.	I hours
4.	4 hours
 
Que. 20 A boat takes 80 minutes to row 12 Ian upstream and 60 minutes to row 15 km downstream. How long will   it take to row a distance of 36 Ian in still water?
1.	4 hours
2.	2.5 hours
3.	3 hours
4.	2 hours
Que. 21 A boat takes 4 hours to travel from a place X to Y downstream and back from Y to X upstream. If the   distance from X to Y is 10.5 km, and the speed of the cunent is 9 km/h, then the speed of the boat in still water, in km/h, is:
1.	102
2
2.	15
3.	12
4 12 1
2
Que. 22 A person rows a distance of 32 km upstream in 	hours anda distance of 13 km downstream in 2 hours. How much time (in hours) wilt the person take to row a distance of 90 Ian in still water?
1.	20
2.	18
24
15
 
Que. 23 The distance between two places A and B is 14 km. A boat travels from A to B downstream and then retums from B to A upstream and takes a total of 3 hours 44 minutes for the entire journey. If the speed of the current is 2 km/h, then what is the speed of the boat, in km/h, in still water?
	1.	7
2
 
2
	4.	8
 
Que. 24 A man can row a distance of 900 metres against the stream in 12 minutes and retums to the starting point in 9 minutes. What is the speed (in km/h) of the man in still water?
	1.	 
4
2.	4 1
2
3.	6
4.	5
 
Que. 25 The speed of a boat in still water is 18 km,'h and the speed of the cunent is 6 km/h. In how much time (in hours) will the boat travel a distance of 90 km upstream and the same distance downstream?
	1.	12
2 11 1
4
3.	10 4.	 
2
 
Que. 26 Abhi rows upstream a distance of 28 Ian in 4 h and rows downstream a distance of 50 km in 2 h to row a distance of 44.8 Ian in still water, he will take:
1.	2.2 h
2.	3.2 h
3.	2.8 h
4.	2.4 h
 
Que. 27 The speed of a boat in still water is 6 km/h. If it takes four times as much time as going upstream as going   same distance downstream, the speed of the stream is:
1.	5 km/h
2.	4.2 km/h
3.	3.6 km/h
4.	2.5 km/h
 
  testbook.com
Que. 28 A boat can go 10 km downstream and 8 Ian upstream in 49 minutes. Also, it can go 12 km downstream and 4 Ian upstream in 42 minutes. What is the speed of stream m km/h?
1.	2
2.	1
3.	1.5
4.	2.5
 
Que. 29 A boat can go 20 km downstream and 30 Ian upstream in 2 hours 20 minutes. Also, it can go 10 km   downstream and 8 km upstream in 49 minutes. What is the speed of boat downstream m km/h?
1.	18
2.	20
3.	16
4.	24
Que. 30 A boat can go 30 km downstream and 24 Ian upstream in 2 hours 27 minutes. Also, it can go 10 km   downstream and 4 km upstream in 37 minutes. What is the speed of the boat upstream (in km/h)?
1.	22
2.	18
3.	20
4.	24
 
Que. 31 A boat can go 30 Ian downstream and 24 Ian upstream in 2 hours 27 minutes. Also, it can go 20 km downstream and 8 km upstream 74 minutes. What is the speed of the boat in still water in km/h?
1.	18
2.	20
3.	24
4.	22
 
Que. 32 A Person can row a distance of 4 Ian upstream in one hour 20 minutes and can row back to the starting   point in just 24 minutes. How much time (in hours) will he take to row 13 km in still water?
	1.	3
2 2 1
2
3.	3 1
2
4.	2
 
Que. 33 A boat can cover a distance of 7.2 Ian downstream and 3.2 km upstream in 2 hours. It can also cover 1.5 km downstream and 0.6 Ian upstream in 24 minutes. What is the speed of the boat when going downstream
(in km/h)?
1.	5
2.	72
2
4 1
2
6
 
Que. 34 If a boat goes upstream at a speed of 24 km/hr and comes back the same distance at 40 km,'hr. What is the average speed (in km,'hr) for the total joumey?
1.	32
2.	30
	3.	31
	4.	33
 
Que. 35 If a boat goes upstream at a speed of 21 km/h and comes back the same distance at 28 km/h. What is the   average speed (in km,'hr) for the total joumey?
1.	24.5
2.	24
3.	25
4.	25.4
Que. 36 Speed of a boat is 10 km/hr in still water and the speed of the stream is 5 km,'hr. If the boat takes 12 hours to go to a place and come back, then what is the distance (in km) of the place?
1.	36
2.	45
3.	60
4.	90
 
 
Que. 37 The downstream speed of a boat is 65 km/hr and the speed of current is 5 km/hr. What is the total time (in hours) taken by the boat to cover 220 km upstream and 130 km downstream?
1.	5
2.	6
3.	8
4.	10
Que. 38 The speed of a stream is 3 km/hr. A boat goes 60 and comes back to the starting point in 15 hours.   1%at is the speed (in km/hr) of the boat in still water?
1	8
2	9
3	10
4	12

Que. 39 The downstream speed of a boat is 85 km/hr and the speed of cunent is 10 km/hr. What is the total time (in hours) taken by the boat to cover 130 km upstream and 170 km downstream?
1.	2
2.	4
3.	6
4.	8
 
Que. 40 The speed of a boat is 3 km,'hr in still water and the speed of the stream is I km/hr. If the boat takes 9 hours   to go to a place and come back, then what is the distance (in km) of the place?
1.	12
2.	16
3.	18
4.	9
Que. 41 A boat travels 16 Ian downstream in 4 hours and 12 km upstream in 6 hours. What is the speed (in km/hr) of boat in still water?
1.	1
2.	2
3.	3
4.	4
 
Que. 42 If speed of boat in still water is 10 km/'hr and the speed of stream is 2 km,'hr, then what is the upstream and downstream speeds (in kmmr) of the boat?
1.	12, 16
2.	6, 12
3.	8, 12
4.	, 14
 
Que. 43 Speed of a boat along the cunent and against the cunent is 16 km/hr and 10 km/hr respectively. What is   the speed of the cun•ent?
1.	2 km/hr
2.	3 km/hr
3.	4 km/hr
4.	I km/hr
Que. 44 The speed of a boat along the current and against the cunent are 10 km,'hr and 8 km,'hr respectively. What is 	of boat 	in still water?
1.	2
2.	9
3.	4.5
4.	6
 
Que. 45 Speed of a boat is 6 km/hr is still water and the speed of the stream is I km/hr. If the boat takes 12 hours to   go to a place and come back, then what is the distance (in km) of the place?
1.	21
2.	28
3.	35
4.	70
Que. 46 The speed of a boat in still water is 9km,'hr. It covers a distance of 42 km upstream in 6 hours. What is the speed (in km/hr) of the stream?
1.	1.2
2.	1.5
3.	1.6
4.	2
 
Que. 47 The speed of a boat in still water is 38 km,'hr. It covers a distance of 56 km upstream in 2 hours. What is the speed (in km/hr) of the stream?
1.	15
2.	8
3.	11
4.	10
 
Que. 48 Speeds of a boat along the current and against the current are 16 km/hr and 12 km,'hr respectively. What is the speed (in km/hr) of the cun•ent?
1.	1
2.	2
3.	3
4.	4
Que. 49 Speed of a boat is 4 per hour in still water and the speed of the stream is 2 km per hour. If the boat takes 8 hours to go to a place and come back, then what is the distance of the place?
1.	12
2.	9
3.	15
4.	18
 
Que. 50 A boat cover row 12 km upstream in 4 hours and can cover the same distance downstream in 3 hours. 1%at is the speed 	of the boat in still water?
1.	3.5
2.	3
3.	2.5
4.	2
Que. 51 A man can row 8 km/hr in still water. If the speed of the current is 4 km,'hr, he takes 8 hours more in upstream than in the downstream. What is the distance (in km)?
1.	24
2.	48
3.	36
4.	72
Que. 52 The speed of a stream is 3 km/hr. A boat goes 24 and comes back to the starting point in 6 hours. What is the speed (in km/hr) of the boat in still water?
1.	4
2.	9
3.	8
4.	12
 
 
Que. 53 The speed of a boat in still water is 35 km,'hr. It covers a distance of 135 km downstream in 3 hours. What   is the speed (in km/hr) of the stream?
1.	8
2.	10
3.	12
4.	15
 
Que. 54 Speeds of a boat along the current and against the current are 12 km,'hr and 6 km,'hr respectively. What is   the speed (in km/hr) of the cun•ent?
1.	2
2.	3
3.	4
4.	9
 
Que. 55 A boat covers 63 km upstream in 9 hours and covers the same distance downstream in 7 hours. What is the speed (in km/hr) of the boat in still water?
1.	8.7
2.	8.5
3.	7
4.	8
 
Que. 56 Speed of a boat along the cunent and against the cunent are 16 km/hr and 10 km/hr respectively. What is  	of boat 	in still water?
1.	11
2.	13
3.	7.5
4.	15
Que. 
1.
2. 3.
4.	57 
5
4 2
3	A boat goes 8 Ian upstream and 12 km downstream in 7 hours. It goes 9 Ian upstream and 18 km downstream in 9 hours. What is the speed (in km/h) of the boat in still water?
Que. 
1.
2.
3.
4.	58 
36
42
48
60	Speed of a boat is 10 km/hr in still water and the speed of the stream is 2 km,'hr. If the boat takes 10 hours to go to a place and come back, then what is the distance (in km) of the place?
Que. 
1. 2.
3.
4.	59 
20
25
45
30	The speed of a boat in still water is 50 km,'hr. It covers a distance of 500 km upstream in 20 hours. What is the speed (m km/hr) of the stream?
Que. 
1. 2.
3.
4.	60 
1
2
3
15	Speed of a boat along the cunent and against the cunent are 16 km/hr and 14 km/hr respectively. What is the speed (in km/hr. of the cun•ent?
Que. 
1.
2. 3.
4.	61
3
4 5
6	The downstream speed of a boat is 42 km/hr and the speed of cunent is 3 km/hr. What is the total time (in hours) taken by the boat to cover 72 km upstream and 84 km downstream?
Que. 62 Speed of a boat is 8 km/hr in still water and the speed of the stream is 2 km,'hr. If the boat takes 8 hours to go to a place and come back, then what is the distance (in km) of the place?
 
1.	24
2.	30
3.	45
4.	42
Que. 
1.
2.
3.
4.	63 
6 13
10 12	The downstream speed of a boat is 20 km/hr and the speed of cunent is 5 km/hr. What is the total time (in hours) taken by the boat to cover 80 km upstream and 100 km downstream?
Que. 
1.
2.
3.
4.	64 
3
4
5
6	The speed of a streamis I km/hr. A boat goes 36 and comes back to the starting point in 15 hours. 1%at is the speed (in km/hr) of the boat in still water?
Que. 65 If the speed of a boat in still water is 35 km,'hr and the speed of the current is 15 km/hr, then how much time (in hours) will be taken by the boat to travel a distance of 190 km downstream?
1.	4
2.	3.8
3.	5.5
4.	6.25
 
Que. 66 Speed of a boat is 3 km/hr in still water and the speed of the stream is I km,'hr. If the boat takes 9 hours to   go to a place and come back, then what is the distance (in km) of the place?
1.	12
2.	16
3.	18
4.	9
Que. 67 The speed of a stream is 3 km/hr. A boat goes 24 Ian and comes back to the starting point in 6 hours. What   is 	(in km/hr) of the boat in still water?
1.	4
2.	9
3.	8
4.	12
Que. 68	10 8   (in km/hr) of the cun•ent?
1.	1
2.	2
3.	3
4.	9
 
 
Que. 69 A boat travels 32 Ian downstream in 4 hours and 24 km upstream in 6 hours. What is the speed (in km/hr) of boat in still water?
1.	2
2.	4
3.	6
4.	8
 
Que. 70 A man can row 10 km/hr in still water. If the speed of the cunent is 2 km,'hr, he takes 3 hours more in upstream than in the downstream. What is the distance (in km)?
1.	36
2.	72
3.	48
4.	24
 
 
Que. 71 A man can row 12 km/hr in still water. If the speed of the cunent is 3 km,'hr, he takes 4 hours more in upstream than in the downstream. What is the distance (in km)?
1.	30
2.	45
3.	60
4.	90
 
Que. 72 The speed of a stream is 9 km/hr. A boat goes 21 Ian and comes back to the starting point in 8 hours. What   is the speed (in km/hr) of the boat in still water?
1.	10
2.	12
3.	8
4.	15
 
Que. 73 The downstream speed of a boat is 20 km/hr and the speed of the cunent is 5 km/hr. What is the total time (in hours) taken by the boat to cover 40 Ian upstream and 60 km downstream?
1.	6
2.	7
3.	8
4.	9
 
Que. 74 The speed of a stream is 2 km/hr. A boat goes 32 Ian and comes back to the starting point in 12 hours. 1%at is the speed (in km/hr) of the boat in still water?
1.	5
2.	6
3.	8
4.	10
Que. 75 The speed of a stream is 3 km/hr. A boat goes 55 and comes back to the starting point in 16 hours. 1%at is the speed (in km/hr) of the boat in still water?
1.	16
2.	8
3.	10
4.	9
 
Que. 76 The speed of a stream is 3 km/hr. A boat goes 36 Ian and comes back to the starting point in 9 hours. What   is the speed (in km/hr) of the boat in still water?
1.	8
2.	9
3.	10
4.	7
 
Que. 77 If a boat goes upstream at a speed of 18 km/hr and comes back the same distance at 30 km,'hr. What is the average speed (in km,'hr) for the total joumey?
1.	22.5
2.	24
3.	20.5
4.	25
 
Que. 78 A boat covers 143 km upstream in 13 hours and the same distance downstream in Il hours. What is the speed (in km/hr) of the boat in still water?
1.	10
2.	12
3.	14
4.	8
 
Que. 79 A boat covers a distance of 14 Ian upstream and 16 km downstream in 9 hours. It covers a distance of 12
  km upstream and 40 km downstream in I I hours. What is the speed (in km,'hr) of the boat in still water?
1.	5
2.	2
3.	3
4.	4
 
Que. 80 	14 	7 
of boat (in km,'hr) in still water?
1.	3.5
2.	7.5
3.	10.5
4.	9.5
Que. 81 	the speed of the stream is 5 km/hr, the upstream speed of the boat is 12 km/hr. Find the speed of the   boat in still water.
1.	7 km/hr
2.	I I km/hr
3.	17 km/hr
4.	22 km/hr
Que. 82 A boat travels 60 kilometers downstream and 20 kilometers upstream in 4 hours. The same boat travels 40 kilometers downstream and 40 kilometers upstream in 6 hours. Nvivmat is the speed (in km'hr) of the stream?
1.	24
2.	16
3.	18
4.	20
 
Que. 83 A boat goes 2 Ian upstream and 3 km downstream in 20 minutes. Later it goes 7 Ian upstream and 2 km downstream in 53 minutes. What is speed (in km/h) of the boat in still water?
1.	75/7
2.	120/7
3.	135/7
4.	150/7
 
Que. 84 Two boats are travelling with speed of 36 km/hr and 54 Ian/hr respectively towards each other. What is the   distance (in metres) between the two boats one second before they collide?
1.	10
2.	15
3.	25
4.	5
Que. 85 A boat can row 35 km upstream in 7 hours and the same distance downstream in 5 hours. What is the speed (in km/hr) of the boat in still water?
1.	5
2.	7
3.	9
4.	6
 
Que. 86 A boat can cover 15 km upstream and 22 Ian downstream in 5 hours. It can cover 20 km upstream and 55/2   km downstream in 13/2 hours. What is the speed (in km/hr) of the stream?
1.	3
2.	5
3.	8
4.	11
 
Que. 87 A boat goes 4 Ian upstream and 4 km downstream in I hour. The same boat goes 5 Ian downstream and 3 km upstream in 55 minutes. »vmat is the speed (in km,'hr) of boat in still water?
1.	6.5
2.	7.75
3.	9
4.	10.5
 
Que. 88 Speed of a boat along the current and against the cunent is Il km/hr and 6 km/hr respectively. What is the speed of boat (in km/hr) in still water?
1.	2.5
2.	7.5
3.	6.5
4.	8.5
 
Que. 89 Speed of a boat along with the current and against the current is 14 km,'hr and 7 km,'hr respectively. What   is the speed of the cun•ent?
1.	3.5 km/hr
2.	1.5 km/hr
3.	2.5 km/hr
4.	3 km/hr
Que. 90 Speed of a boat along the cunent and against the cunent are 16 km/hr and 12 km/hr respectively. What is the speed of boat (in km,'hr) in still water?
1.	2 km/hr
2.	7 km/hr
3.	14 km/hr
4.	12 km/hr
5.	16 km/hr
 
Que. 91 	16 10 of the cun•ent?
1.	2 km/hr
2.	3 km/hr
3.	4 km/hr
4.	I km/hr
 
Que. 92 Speed of a boat along the cunent and against the cunent are 12 km/hr and 6 km/hr respectively. What is the speed of boat (in km,'hr) in still water?
1.	3
2.	6
3.	9
4.	12
 
Que. 93 The speed of a boat in still water is 8 km,'hr. It covers a distance of 52 km upstream in 8 hours. What is the speed (in km/hr) of the stream?
1.	1.5
2.	2
3.	3
4.	2.5	 
 
Que. 94 A Boat goes 15 Ian upstream and km downstream in 3 hours 15 minute. It goes 12 km upstream and 14 km downstream in 3 hours. What is the speed of the boat in still water?
1.	4
2.	6
3.	10
4.	14
Que. 95 Speed of a boat is 6 km/hr in still water and the speed of the stream is 3 km,'hr. If the boat takes 8 hours to go to a place and come back, then what is the distance (in km) of the place?
1.	12
2.	18
3.	24
4.	15
