
Que. 1 The compound interest on􀁈 4,000 after 3 year is 􀁈 630.50. Then the rate of interest compounded yearly is:
I. 7%
2. 8%
3. 6%
4. 5%
Que. 2 The compound interest on a sum of􀁈 24500 at 10% p.a for 21 years interest compounded yearly is:
I. 􀁈 6338.40
2. 􀁈 6342
3. 􀁈 6330.80
4. 􀁈 6340
Que. 3 The compound interest on a ce1iain sum at a ce1iain rate percent per annum for the second year and the third
year are 􀁈 3300 and 􀁈 3630, respectively. The sum is:
I. 􀁈 32000
2. 􀁈 28400
3. 􀁈 30000
4. 􀁈 25000
Que. 4 What is the present value of the amount of Rs 14739 payable in the 3 years at the rate of 6.25% compound
annual interest?
I. Rs. 12184
2. Rs. 12288
3. Rs. 12473
4. Rs. 12148
Que. 5 The compound interest on a sum for 4th year is􀁈 6000 and compound interest for s
th year is􀁈 6750(interest
is compounded annually). What is the rate of interest?
I. 25%
2. 20%
3. 12.5%
4. 15%
Que. 6 A sum becomes 6 times of itself in 4 years at compound interest (interest is compounded annually). In how
many years will the sum becomes 216 times of itself?
I. 12
2. 20
3. 16
4. 8
Que. 7 At what rate of compound interest (in %) per annum will a sum of Rs. 72,000 become Rs. 95,220 in 2
I. 14
2. 13
3. 12
4. 15
years?
Que. 8 Compound interest received on a certain amount for the 3rd year is Rs. 9,600. What will be the compound
interest (in Rs) for the 4th year on the same amount at 12% rate of interest?
I. 10752
2. 11752
3. 10252
4. 11252
Que. 9 If the rate of interest is 20% per annum, compounded yearly and the interest on a certain sum in the second
year is Rs. 250, then what will be the interest on the same sum in the fifth year?
I. Rs. 360
2. Rs. 432
3. Rs. 518
4. Rs. 400
Que. 10 What will be the compound interest on a sum of Rs. 31250, at 12% compound interest (interest
compounded yearly) in 21 years?
I. Rs. 11096
2. Rs. 11086
3. Rs. 11068
4. Rs. 11048
Que. 11 A certain sum amounts to Rs. 280900 in 2 years at 6% per annum, interest compounded annually. The sum
1s:
I. Rs. 550000
2. Rs. 200000
3. Rs. 250000
4. Rs. 350000
Que. 12 A principal amount increases by 50% in five years at simple interest. At the same rate of interest, what will
be the compound interest on Rs. 20000 for three years?
I. Rs. 2880
2. Rs. 5760
3. Rs. 6620
4. Rs.3310
Que. 13 The simple interest on a sum of Rs. 50,000 at the end of two years is Rs. 4,000. What would be the
compound interest on the same sum at the same rate for the same period?
I. Rs. 4,008
2. Rs. 4,080
3. Rs. 8,000
4. Rs. 4,040
Que. 14 Amir bo1Towed a sum of Rs. 25,000 on simple interest. Bhola bo1Towed the same amount on compound
interest (interest compounded yearly). At the end of2 years, Bhola had to pay Rs. 160 more interest than
Amir. The rate of interest charged per annum is:
I. 8%
2. 31% 8
3. 16/25%
4. 8/25%
Que. 15 A man invested a sum of money at compound interest. It amounted to Rs. 2420 in 2 years and to Rs. 2662
in 3 years. Find the sum
I. Rs. 1000
2. Rs. 2000
3. Rs. 5082
4. Rs. 3000
Que.16
I.
2. 2
3. 4
4. 5
The compound interest on Rs. 30,000 at 7% per annum for n years is Rs. 4347. The value of n is
3
Que. 17 A sum of money is invested at 20% compound interest ( compounded annually). It would fetch Rs. 723
more in two years if interest is compounded half-yearly. The sum is
I. Rs. 15,000
2. Rs. 30,000
3. Rs. 20,000
4. Rs. 7,500
Que. 18 If the difference of the compound interest and the simple interest on a sum of money for 3 years is Rs. 186.
Find the sum of money, if the rate of interest in both cases be 10%
I. Rs. 5500
2. Rs. 7200
3. Rs. 6500
4. Rs. 6000
Que.19
I.
The compound interest on Rs. 4000 for 4 years at 10% per annum will be
Rs. 1856.40
2. Rs. 1600
3. Rs. 1856
4. Rs. 1756.60
Que. 20 What will be the difference in compound interest on a sum of Rs. 7,800 at 8% for 1 year, when the interest
is paid yearly and half-yearly?
I. Rs. 29.18
2. Rs. 19.46
3. Rs. 12.48
4. Rs. 24.72
Que. 21 Rs 260200 is divided between Ram and Shyam so that the amount that Ram receives in 3 years is the same
as that Shyam receives in 6 years. If the interest is compounded annually at the rate of 4% per annum then
Ram's share (approx) is
I. 125000
2. 137745
3. 152000
4. 108200
Que. 22 A man bo1Towed some money and agreed to pay-off by paying Rs 3150 at the end of the 1st year and Rs
4410 at the end of the 2nd year. If the rate of compound interest is 5% per annum, then the sum is
I. Rs 5000
2. Rs 6500
3. Rs 7000
4. Rs 9200
Que. 23
I.
2. 8
In 3 years Rs 3000 amounts to Rs 3993 at x% compound interest, compounded annually. The value ofx is
10
3. 5
4. 3.l
3
Que. 24
I.
The sum for 2 years gives a compound interest of Rs 3225 at 15% rate. Then sum is
10000
2. 20000
3. 15000
4. 32250
Que. 25 A certain amount of money at compound interest grown to Rs. 66,550 in 3 years and Rs. 73,205 in 4 years.
I. 5%
The rate per cent per annum is:
2. 11%
3. 9%
4. 10%
Que. 26 A and B together bo1Towed a sum of Rs. 51,750 at an interest rate of 7% p.a. compound interest in such a
way that to settle the loan, A paid as much amount after three years as paid by B after 4 years from the day
ofbo1Towing. The sum (in Rs.) bo1Towed by A was:
I. 26,750
2. 24,860
3. 25,000
4. 25,650
Que. 27 A sum of Rs. 8,000 invested at 10% p.a. amounts to Rs. 9,261 in a certain time, interest compounded halfyearly.
What will be the compound interest (in Rs) on the same sum for the same time at double the earlier
rate of interest, when interest is compounded annually?
I. Rs. 2,500
2. Rs. 2,480
3. Rs. 2,560
4. Rs. 2,520
Que. 28 What is the compound interest on a sum of Rs. 12,000 for 21 years at 8% p.a. when the interest is
compounded annually (nearest to a mpee )?
I. Rs. 2,654
2. Rs. 2,642
3. Rs. 2,712
4. Rs. 2,697
Que. 29 .l
The compound interest on a ce1iain sum at 10% p.a. for 2 3
years is Rs. 1,201.60, interest compounded
yearly. The sum is
I. Rs. 4,500
2. Rs. 4,200
3. Rs. 5,400
4. Rs. 4,800
Que. 30 What is the effective annual rate of interest coITesponding to a rate of 10% per annum compounded halfyearly?
I. 10.75%
2. 10.5%
3. 10%
4. 10.25%
Que. 31 What is the compound interest on a sum Rs. 10000 for 21 years at a rate of 12% p.a the interest is
compounded annually? (nearest to integer)
4
I. Rs. 4049
2. Rs. 3637
3. Rs. 3673
4. Rs. 3649
Que. 32 A ce1iain sum invested at compound interest amounts to Rs. 19965 at 10% p.a. in 3 years. The same sum
will amount to Rs.x at the same rate in 21 years. If the interest is compounded yearly in both the cases,
what is the value of x?
I. 18867
2. 18768
3. 18876
4. 18855
Que. 33 What is the difference between the compound interest on Rs. 10000 for two years at 20% per annum when
the interests are compounded half-yearly and yearly respectively?
I. Rs. 240
2. Rs. 440
3. Rs. 441
4. Rs. 241
Que. 34
I.
Find the C.I. on Rs. 15,625 for 2 years at 12% per annum compounded after eve1y 8 months?
3075
2. 4058
3. 3675
4. 4088
Que. 35 If the compound interest in the third year at 8% p.a on a certain sum is Rs. 3600, then what is the
difference between the compound interest in the 4 th and 5 th year? (nearest to an
I. Rs.311
2. Rs. 335
3. Rs. 304
4. Rs. 288
Que. 36 !11e compound interest on a ce1iain sum at 15% p.a compounded yearly for 21 years is Rs. 9327 . The sum
I. Rs. 24000
2. Rs. 25000
3. Rs. 20000
4. Rs. 27000
Que. 37 Rs 3600 becomes Rs. 4900 in 2 years when kept at compound interest (compounded annually). What is the
rate of interest per annum?
I. 161% 3
2. 17.1% 3
3. 18.1% 3
4. 151% 3
Que. 38 What will be the compound interest on a sum of Rs. 1200 for 2 years at the rate of 20% per annum when
the interest is compounded yearly?
I. Rs. 624
2. Rs. 504
3. Rs. 576
4. Rs. 528
Que. 39 A sum of Rs. 2000 is invested at compound interest ( compounding annually). If the rate of interest is 10%
per annum, then what will be the amount after 30 months?
I. Rs. 2532
2. Rs. 2524
3. Rs. 2541
4. Rs. 2538
Que. 40 What is the compound interest on Rs. 5000 in 2 years at the rate of 20% per annum? (interest compounded
half yearly)
I. Rs. 2275.50
2. Rs. 2290.50
3. Rs. 2320.50
4. Rs. 2340.50
Que. 41 A sum of money becomes 3 times in 10 years at the rate of compound interest (compounded annually). In
how many years will it become 81 times?
I. 40 years
2. 30 years
3. 35 years
4. 50 years
Que. 42 A sum of Rs. 2400 becomes Rs. 3600 in 6 years at a certain rate of compound interest ( compounded
annually). What will be the amount after 12 years at the same rate of interest?
I. Rs. 4800
2. Rs. 4500
3. Rs. 5400
4. Rs. 6000
Que. 43 IfRs. 12000 is invested for two years at compound interest (compounded annually) at the rate of 20% per
annum, then what is the interest?
I. Rs. 5280
2. Rs. 5640
3. Rs. 4280
4. Rs. 4800
Que. 44 How much will a principal of Rs. 5000 invested on compound interest (compounded annually) amount to
in three years at a rate of 50% per annum?
I. Rs. 17,275
2. Rs. 16,875
3. Rs. 16,375
4. Rs. 11,250
Que. 45 A sum of Rs. 3000 is invested on compound interest ( compounded annually) at the rate of interest is 20%
per annum. What is the compound interest for 2 years?
I. Rs. 1440
2. Rs. 1320
3. Rs. 1200
4. Rs. 1360
Que. 46 A sum of money is invested at compound interest, which is compounded annually. The sum grows to Rs.
1000 after three years, and Rs. 1100 after four years. What is rate of interest per annum?
I. 10%
2. 15%
3. 12.5%
4. 20%
Que. 47 If after two years a sum becomes Rs. 4000 and after four years it becomes Rs. 6000 at the same rate of
compound interest (compounded annually), then what is the sum?
I. Rs. 2866.66
2. Rs. 2666.66
3. Rs. 2777.77
4. Rs. 2888.88
Que. 48 Find the compound interest on an amount of Rs. 5120 at the rate of 12.5% (compounded annually) for 3
years.
I. Rs. 2280
2. Rs. 1960
3. Rs. 2170
4. Rs. 2120
Que. 49 At what percent per annum will Rs. 6000 amounts to Rs. 7986 in 3 years, if the interest is compounded
annually?
I. 11%
2. 12.5%
3. 8%
4. 10%
Que. 50 The compound interest for two years at 12% per annum is Rs. 477. What is the amount of Principal (in
Rs.) invested?
I. 2000
2. 1875
3. 1650
4. 1500
Que. 51 A certain sum invested on compound interest (compounded annually) grows to Rs. 5040 in three years. If
the rate of interest is 20% for the first year, 40% for the second and 50% for the third year, then what is the
sum?
I. Rs. 1800
2. Rs. 2000
3. Rs. 2566
4. Rs. 1210
Que. 52 A sum of Rs. 900 is invested at compound interest (compounded annually) for 2 years. If the rate of
interest is 10% per annum, then what will be the amount?
I. Rs. 1289
2. Rs. 1121
3. Rs. 1089
4. Rs. 1071
Que. 53 A sum of Rs. 1200 is invested at compound interest ( compounded half yearly). If the rate of interest is 10%
per annum, then what will be the amount after 18 months?
I. Rs. 1295.35
2. Rs. 1563 .25
3. Rs. 1185.45
4. Rs. 1389.15
Que. 54 A sum of Rs. 1000 is invested on compound interest (compounding annually) for three years. If the rate of
interest is 10% per annum for the first two years and 50% per annum for the third year, then what will be
the interest?
I. Rs. 756
2. Rs. 655
3. Rs. 612
4. Rs. 815
Que. 55 The compound interest (compounded annually) on a sum of money invested for two years is Rs. 10125. If
the rate of interest is 25% per annum, then what is the amount after these two years?
I. Rs. 32275
2. Rs. 30625
3. Rs. 28125
4. Rs. 26275
Que. 56 A sum doubles in 4 years at a certain rate of compound interest. In how many years does it amount to 8
I. 12
2. 15
3. 6
4. 9
times itself at the same rate?
Que. 57 A sum of Rs. X amounts to Rs. 12,777.60 in 2 years at 15% p.a., when the interest is compounded eightmonthly.
The value ofx is __ _
I. Rs. 9800
2. Rs. 10400
3. Rs. 10200
4. Rs. 9600
Que. 58 The compound interest on a ce1iain sum invested for 2 years at 10% per annum is Rs. 1,522.50, the interest
being compounded yearly. The sum is:
I. Rs. 7,250
2. Rs. 7,200
3. Rs. 7,500
4. Rs. 7,000
Que. 59 A sum of Rs. 5,000 amounts to Rs. 7,200 in 8 years at a ce1iain rate per cent p.a interest compounded
yearly. What will be the compound interest on a sum of Rs. 6,550 in 4 years at the same rate of interest?
I. Rs. 1,290
2. Rs. 1,285
3. Rs. 1,415
4. Rs. 1,310
Que. 60 The compound interest amounts on a ce1iain sum at a ce1iain rate percentage p.a. for the second year and
third year are Rs. 3,300 and Rs. 3,630, respectively. What is the amount on the same sum at the same rate
in 2 ½ years, interest compounded yearly?
I. Rs. 36,300
2. Rs. 36,000
3. Rs. 37,215
4. Rs. 38,115
Que. 61 What is the compound interest on a sum of Rs. 37,500 for 11 years at a rate of 12% p.a if the interest is
compounded 8 - monthly?
I. Rs. 6,440
2. Rs. 6,240
3. Rs. 6,448
4. Rs. 6,420
Que. 62 A sum of money becomes Rs. 35,680 after 3 years and Rs. 53, 520 after 6 years at a ce1iain rate percentage
p.a. interest compounded yearly. What is the compound interest on the same sum in the first case? (Y om
answer should be nearest to integer)
I. Rs. 10,842
2. Rs.11,938
3. Rs. 11,983
4. Rs. 11,893
Que. 63
I. 2
2. 4
3. 7.5
4. 5
At what percentage rate, compound interest compounded annually for a sum of Rs. 40,000, will amount to
Rs. 44,100 in two years?
Que. 64 A certain sum amounts to Rs. 4,205.55 at 15% p.a in 21 years, interest compounded yearly. The sum is:
I. Rs. 3,500
2. Rs. 3,200
3. Rs. 2,700
4. Rs. 3,000
Que. 65 What is the compound interest on a sum Rs. 7200 for 21 years at 20% p.a interest compounded yearly
(nearest to an integer)?
I. Rs. 3,960
2. Rs. 4,290
3. Rs. 3,997
4. Rs. 4,205
Que. 66 What will be the compound interest on a sum of Rs. 31,250 for 2 years at 12% p.a, if the interest is
compounded 8-month?
I. Rs. 8,016
2. Rs. 8,15
3. Rs. 8,116
4. Rs. 8,106
Que. 67 A sum of Rs. 18,000 is lent at 10% p.a compound interest, compounded annually, what is the difference
between the compound interest for 3rd year and 4th year?
I. Rs. 217.80
2. Rs. 220.60
3. Rs. 215.40
4. Rs. 221.80
Que. 68 A certain amount invested at a certain rate, compounded annually, grows to an amount in three years,
which is a factor of 1.19016 of principal. What is the rate percentage?
J. 8
2. 5
3. 4
4. 6
Que. 69 A sum invested at 8% p.a. amounts to Rs. 20280 at the end of one year, when the interest is compounded
half yearly. What will be simple interest on the same sum for 41 years at double the earlier rate of interest?
I. Rs. 14500
2. Rs. 13500
3. Rs. 14200
4. Rs. 13800
Que. 70 The compound interest on a ce1iain sum of money at 21% for 2 years is Rs. 9,282. Its simple interest (in 2)
at the same rate and for the same period is:
I. 8,750
2. 8,500
3. 8,000
4. 8,400
Que. 71 A ce1iain sum invested on compound interest grows to Rs. 8,000 and Rs. 27,000 in three and six years,
respectively when the interest is compounded annually, what is the percentage rate of interest?
I. 10%
2. 0.5%
3. 50%
4. 25%
Que. 72 A ce1iain amount invested at a ce1iain rate, compounded annually, grows to an amount in five years, which
I. 9.2
2. 9
3. 8.1
4. 8
is a factor of 1.1881 more than to what it would have grown in three years. What is the rate percentage?
Que. 73 Rs. 60000 invested at a ce1iain rate for a ce1iain even number of years, compounded annually, grows to Rs.
63,654. To how much amount would it grow if it is invested on compound inte1Testt at the same rate for
half the period?
I. Rs. 61800
2. Rs. 61809
3. Rs. 61675
4. Rs. 61827
Que. 74 A sum of Rs. 10000 amounts to Rs. 11664 in 2 years, at a certain rate percent per annum, when the interest
is compounded annually. What will be the simple interest on the same sum for 27/5 years at the same rate?
I. Rs. 4040
2. Rs. 3840
3. Rs. 4320
4. Rs. 4160
Que. 75 What is the compound interest on a sum of Rs. 4, 096 at 15% p.a. for 2.! years, if the interest is compound
2
10 - monthly?
I. Rs. 1, 726
2. Rs. 1, 636
3. Rs. 1, 763
4. Rs. 1, 736
Que. 76 If a sum becomes Rs. 1,460 in two years and Rs. 1,606 in three years due to the compound interest, then
annual rate of interest is:
I. 10%
2. 9%
3. 8%
4. 11%
Que. 77 The interest on Rs. 24, 000 in 2 years compounded annually when the rates are 8% p.a. and 10% p.a. for
two successive years is:
I. Rs. 3, 994
2. Rs. 4, 512
3. Rs. 5, 040
4. Rs. 5, 866
Que. 78 If the compound interest @ 10% p.a. compounded half-yearly for 1.! year is Rs. 2,522, principle amount
. 2
1s:
I. Rs. 16,000
2. Rs. 15,400
3. Rs. 18,500
4. Rs. 20,000
Que. 79 The compound interest calculated yearly on a certain sum of money for the second year is Rs. 1,320 and
for the third year is Rs. 1,452. The principal amount at the staii of the first year is:
I. Rs. 13,200
2. Rs. 12,970
3. Rs. 12,650
4. Rs  12,000
Que. 80 Rs. 2,40,000 is taken as loan for three years compounded annually at 12.5% p.a. At the end of first year,
the interest is revised to 12% p.a. The total amount to be repaid at the end of third year is:
I. Rs. 3,26,400
2. Rs. 3,34,800
3. Rs. 3,38,688
4. Rs. 3,42,648
Que. 81
I.
On what sum of money, the interest for one year at 12% p.a compounded half yearly is Rs. 1,545?
Rs. 25,750
2. Rs. 24,300
3. Rs. 12,875
4. Rs. 12,500
Que. 82 A sum of Rs. 10,000 is invested for 17 months at 8% per annum compounded half yearly. What is the
percentage gain at the end of 17 month, nearest to one decimal place?
I. 12.2%
2. 12.0%
3. 11.8%
4. 12.4%
Que. 83 A boITowed Rs. 28,500 at 8% p.a. interest compounded annually. IfRs. 5,780 was paid by him at the end
of the first year, then the outstanding amount at the end of the second year will be:
I. Rs. 27,000.00
2. Rs. 27,462.40
3. Rs. 30,780.00
4. Rs. 33,242.40
Que. 84 A sum of Rs. 18,000 is invested for 16 months at 8% per annum compounded half-yearly. What is the
percentage gain at the end of 16 months, to the nearest whole number?
I. 9%
2. 11%
3. 10%
4. 12%
Que. 85 If a sum amounts to Rs. 2,190 in four years and Rs. 2,409 in five years at compound interest, when the
interest is compounded yearly, then the annual rate of interest is:
I. 11%
2. 9%
3. 8%
4. 10%
Que. 86 A sum of Rs. 12,000 amounts to Rs. 20,736 in 3 years at a certain rate percent per annum, interest
compounded annually. What will amount of the same sum to in 2 years at the same rate on compound
interest?
I. Rs. 17,280
2. Rs. 14,520
3. Rs. 17,820
4. Rs. 15,640
Que. 87 What is the compound interest on a sum of Rs. 8,100 for 1.! years at 8% per annum, if the interest is
4
compounded 5-monthly? (Nearest to Rs.I)
I. Rs. 873
2. Rs. 824
3. Rs. 842
4. Rs. 837.3
Que. 88 A sum amounts to Rs. 18,600 after 3 years and to Rs. 27,900 after 6 years, at a certain rate percent p.a.,
when the interest is compounded annually. The sum is:
I. Rs. 11,800
2. Rs. 12,400
3. Rs. 14,400
4. Rs. 14,600
Que. 89 A person boITowed a ce1iain sum at 10% p.a. for three years, interest being compounded annually. At the
end of two years, he repaid a sum of Rs. 6,634 and at the end of the third year, he cleared off the debt by
paying Rs.13,200. What was the sum boITowed by him?
I. Rs. 16,400
2. Rs. 16,500
3. Rs. 15,400
4. Rs. 15,600
Que. 90 A sum amounts to Rs. 8,028 in 3 years and to Rs. 12,042 in 6 years at a ce1iain rate percent per annum,
when the interest is compounded yearly. Find the sum.
I. Rs. 5,352
2. Rs. 5,253
3. Rs. 5,325
4. Rs. 5,235
Que. 91 If a sum of money on compound interest becomes three times in 4 years, then at the same interest rate, the
sum will become 27 times in:
I. 15 years
2. 12 years
3. 10 years
4. 16 years
Que. 92 A sum of Rs. 15,000 is lent at 16% p.a. compound interest. What is the difference between the compound
interest for the second year and the third year?
I. Rs. 445.44
2. Rs. 548
3. Rs. 454.88
4. Rs. 544
Que. 93 What is the compound interest on a sum of Rs. 10,000 at 14% p.a. for 21 years where the interest is
compounded yearly?
I. Rs. 4,259
2. Rs. 4,439
3. Rs. 4,394
4. Rs. 4,296
Que. 94 What will be the compound interest (nearest to integer) on a sum of Rs. 25,000 for 2 years at 12% p.a., if
the interest is compounded 8 monthly?
I. Rs. 6,394
2. Rs. 6,493
3. Rs. 6,439
4. Rs. 6,349
Que. 95 Koushik deposits an amount of Rs. 25,000 at a bank on 7% rate of interest compounded annually for 2
years. What is the total amount he will receive at the end of2 years?
I. Rs. 28,622.5
2. Rs. 28,600.5
3. Rs. 28,620
4. Rs. 28,000
Que. 96 Find the compound interest (in Rs.) on Rs. 25,000 for 2 years at 6% per annum, the interest being
compounded half yearly.
I. Rs. 3,137.7/-
2. Rs. 3,150/-
3. Rs. 3,128.85/-
4. Rs. 1,298.25/-
Que. 97 Rs. 9,200 is invested at the compound interest rate of 25% per annum for 2 years. What will be the interest
earned after the end of 2 years period?
I. Rs. 17,375
2. Rs. 8,175
3. Rs.5,175
4. Rs. 14,375
Que. 98 The compound interest on a ce1iain sum in 2½ years at 10% p.a., interest compounded yearly, is Rs. 1,623.
The sum is:
I. Rs. 7,200
2. Rs. 5,000
3. Rs. 6,500
4. Rs. 6,000
Que. 99 A sum of Rs 10000 becomes Rs 14641 when invested at compound interest at the yearly interest rate of
J. 1
2. 2
3. 3
4. 4
20% per annum. If the compounding is done half yearly, then for how many years was the sum invested?
Que. 100 What is the difference (in Rs) in Compound interest earned in 1 year on a sum of Rs. 25,000 at 20% per
I. 125
2. 250
3. 500
4. 375
annum compounded semi-annually and annually?
Que. 101 A ce1iain bank offers 8% rate of compound interest on the 1st year and 9% on the 2nd year in a ce1iain
fixed deposit scheme. If Rs. 17,658 is received after investing for 2 years in this scheme, then what was
the amount (in Rs) invested?
I. 16000
2. 15000
3. 15500
4. 16500
Que. 102 If the compound interest for the 3rd and 4th year on a ce1iain principal is Rs. 125 and Rs. 135
respectively, what is the rate of interest (in %)?
I. 9
2. 10
3. 8
4. 12
Que.103
I.
What is the compound interest earned on Rs. 80,000 at 40% per annum in 1 year compounded quarterly?
28317
2. 37128
3. 18732
4. 21387
Que.104
I. 3
2. 2
3. 4
4. 5
In how many years will Rs. 2,000 yield Rs. 662 as compound interest at 10% per annum compounded
annually?
Que. 105 If a principal amount becomes Rs. 1,75,692 in 4 years with a compound interest rate of 10% per annum,
the what is the value of principal amount?
I. Rs. 111000
2. Rs. 110000
3. Rs. 120000
4. Rs. 100000
Que. 106 What is the compound interest for a sum of Rs. 20000 in 2 years, if the rate of interest is 18% per annum?
I. Rs. 7748
2. Rs. 7848
3. Rs. 7648
4. Rs. 7948
Que. 107 A sum of Rs. 12000 is invested at a scheme of compound interest. The interest rate is 10%. If the interest
I. 1230
2. 1000
3. 1200
4. 1375
is compounded half yearly, then what will be the interest (in Rs.) after 1 year?
Que. 108 What is the compound interest (in Rs) on a sum of Rs. 10000 for 2 years at the rate of 5% per annum
compounded annually?
I. 1000
2. 1025
3. 1500
4. 1250
Que. 109 What is the sum (in Rs) of money which will become Rs 201840 at the rate of 16% per annum at
compound interest in two years?
I. 160000
2. 150000
3. 180000
4. 200000
Que. 110
I. 18
2. 24
3. 12
4. 30
In how many months will Rs. 8,000 yield Rs. 2,648 as compound interest at 20% per annum compounded
semi-annually?
Que. 111 The amount (in Rs) received at 10% per annum compound interest after 3 yrs is Rs. 119790. What was
the principal?
I. 90000
2. 100000
3. 80000
4. 75000
Que. 112 If the amount on a ce1iain principal in 3 years at 12% rate of interest compounded annually is Rs. 12,000,
what will be the amount (in Rs.) after the 4th year?
I. 14330
2. 15440
3. 13440
4. 14550
Que. 113 A ce1iain sum becomes k times in 5 years at compound interest. In 30 years it will become how many
times?
I. 5 k
2. 6k
3.
K6
4. Ks
Que. 114 What is the compound interest (in Rs) on a sum of Rs.12000 for 2 years at the rate of 5% per annum
I. 1250
2. 1200
3. 1230
4. 1300
compounded annually?
Que. 115 A sum of Rs. 5000 is invested at a scheme of compound interest. The interest rate is 20% per annum. If
I. 1000
2. 2200
3. 1500
4. 1050
Que.116
I. 2
2. 4
3. 3
4. 5
the interest is compounded half yearly, then what is interest (in Rs.) after 1 year?
In how many years will Rs. 25,000 yield Rs. 8,275 as compound interest at 10% per annum compounded
annually?
Que. 117 The amount received at 10% per annum compound interest after 3 yrs is Rs. 10,648. What was the
I. 8000
2. 9000
3. 8500
4. 7500
principal (in Rs.)?
Que. 118 If the compound interest received on a certain amount in the 3rd year is Rs. 12,100, what will be the
compound interest (in Rs.) for the 4th year on the same amount, if rate of interest is 9%?
I. 17080
2. 15669
3. 13189
4. 14376
Que. 119 Rs. 2200 are invested in a scheme of compound interest. If the rate of interest is 10% per annum, then
I. 462
2. 628
3. 576
what is the interest earned (in Rs.) in 2 years?
4. 682
Que.120
I. 3
2. 4
3. 2
4. 1
Que.121
I. 243
2. 324
3. 81
4. 162
A sum becomes 4 times in 2 years at compound interest. In how many years the same sum will become
16 times?
Rs. 10000 is kept at compound interest rate of 18% per annum (compounding annually). If the
compounding of interest is done half yearly, then how much more interest (in Rs) will be obtained?
Que. 122 What is the compound interest (in Rs.) on a sum of Rs. 13000 for 2 years at the rate of 10% per annum
I. 2730
2. 2400
3. 2620
4. 2340
compounded annually?
Que. 123 A certain principal invested in a scheme of compound interest. The amount obtained after 1 year is Rs.
3900 and the amount obtained after 2 years is Rs. 5070. What is the rate of interest (in percentage)?
I. 25
2. 30
3. 35
4. 37.5
Que. 124 A sum of Rs. 2500 becomes Rs. 8100 in 2 years at a certain rate of compound interest. What will be the
sum (in Rs.) after 4 years?
I. 29824
2. 36284
3. 41624
4. 26244
Que. 125 A sum becomes 1.69 times of itself in 2 years when invested at compound interest. What is the per annum
rate of interest (in percentage)?
I. 38
2. 34.5
3. 13
4. 30
Que. 126 A sum becomes two times in 7 years at compound interest. In how many years the same sum will become
I. 21
2. 28
3. 35
4. 19
16 times?
Que. 127 A certain principal invested in a scheme of compound interest. The amount obtained after 2 year is Rs.
I. 10
2. 12
3. 18
4. 15
3630 and the amount obtained after 3 years is Rs. 3993. What is the rate of interest (in percentage)?
Que. 128 The amount received at 8% compounded per annum after 2 years is Rs. 72,900. What was the principal
(in Rs.)?
I. 65000
2. 67500
3. 60000
4. 62500
Que. 129 What is the difference (in Rs.) between the compound interests on Rs. 12,500 for 1 year at 8% per annum
I. 16
2. 25
3. 20
4. 40
compounded yearly and half-yearly?
Que. 130 If compound interest received on a ce1iain amount in the 2nd year is Rs. 250. What will be the compound
I. 250
2. 300
3. 280
4. 270
interest (in Rs.) for the 3rd year on the same amount at 12% rate of interest?
Que. 131 If the interest is compounded half-yearly, then what will be the compound interest (in Rs.) on a sum of
I. 1250
2. 525
3. 1000
4. 1025
Rs. 10000 for 1 year at the rate of 10% per annum?
Que. 132 A sum becomes 3 times in 5 years at compound interest. In how many years the same sum will become 9
I. 5
2. 10
3. 15
4. 20
times?
Que. 133 What is the sum (in Rs.) of money which will become Rs. 26620 at the rate of 10% per annum at
compound interest in three years?
I. 20000
2. 22000
3. 25000
4. 26000
Que. 134 Rs. 5000 are invested in a scheme of compound interest. If the rate of interest is 12% per annum, then
I. 1450
2. 1272
3. 1520
4. 3450
what is the interest earned (in Rs) in 2 years?
Que. 135 A sum of Rs. 8000 becomes Rs 12500 in 2 years at a certain rate of compound interest. What will be the
sum (in Rs.) after 3 years?
I. 13175
2. 14225
3. 12575
4. 15625
Que. 136 A sum of Rs. 2000 becomes Rs. 3645 in 2 years at a certain rate of compound interest. What will be the
sum (in Rs.) after 4 years?
I. 5942.125
2. 6643.0125
3. 7243.0125
4. 7498.125
Que. 137 Rs 5000 are invested in a scheme of compound interest. If the rate of interest is 12% per annum, then
I. 1450
2. 1272
3. 1520
4. 3450
what is the interest earned (in Rs) in 2 years?
Que. 138 A sum becomes two times in 7 years at compound interest. In how many years the same sum will become
I. 21
2. 28
3. 35
4. 19
16 times?
Que. 139 What is the sum (in Rs.) of money which will become Rs. 26620 at the rate of 10% per annum at
compound interest in three years?
I. 20000
2. 22000
3. 25000
4. 26000
Que.140
I. 4k
2. k4
3. k3
4. 3k
A certain sum becomes 'k' times in 6 years at compound interest. In 24 years it will become how many
times?
Que. 141 The population of a town increases by 5% in the first year, by 6% in the second year and by 8% in third
year. The present population of town is 120204. What was the population of the town 3 years ago?
I. 102000
2. 100000
3. 98000
4. 101204
Que. 142 What is the difference (in Rs) between the compound interests on Rs. 1000 for 1 year at 10% per annum
compounded yearly and half-yearly?
I. 1.5
2. 0.5
3. 2.5
4. 3.5
Que. 143 A sum amounts to Rs. 1210 in 2 years when invested at compound interest. If principal is Rs. 1000, then
I. 10
2. 20
3. 15
4. 12
what is the rate of interest (in %)?
Que. 144 What is the compound interest (in Rs) on a sum of Rs. 15000 for 2 years at the rate of 10% per annum
I. 3050
2. 3150
3. 3000
4. 7500
compounded annually?
Que. 145 A sum becomes 5 times in 4 years at compound interest. In how many years the same sum will become
I. 20
2. 100
3. 80
4. 8
25 times?
Que. 146 What is the sum (in Rs) of money which will become Rs 29160 at the rate of 8% per annum at compound
interest in two years?
I. 25000
2. 26000
3. 28000
4. 20000
Que. 147 What is the difference (in Rs) between compound interest earned in 1 year on a sum of Rs. 10,000 at 40%
I. 461
2. 346
3. 463
4. 641
per annum compounded quarterly and annually?
Que. 148 If the amount received at the end of 2nd and 3rd year at compound Interest on a certain Principal is Rs.
9,600 and Rs. 10,272 respectively, what is the rate of interest (in %)?
I. 7
2. 8
3. 6
4. 5
Que. 149 A sum of Rs. 8000 is bonowed at a compound interest at the rate of 7% per annum. What will be the
amount (in Rs.) after 2 years?
I. 1154.4
2. 13600
3. 9159.2
4. 9428.6
Que. 150 A sum of Rs. 15000 is lent at compound interest (compounded annually) at an interest rate of20% per
annum. If the interest is compounded half-yearly, then how much more interest (in Rs) will be obtained in
one year?
I. 225
2. 150
3. 75
4. 300
Que. 151 A sum of Rs. 6000 is bonowed at compound interest at the rate of 8% per annum. What will be the
amount (in Rs) after 2 years?
I. 6998.4
2. 6960
3. 6784.4
4. 6869.4
Que. 152 The value of a car depreciates at the rate of 15% per annum. If its present value is Rs. 433500, then what
was the value (in Rs) of the car before 2 years?
I. 594200
2. 620000
3. 563550
4. 600000
Que. 153 The compound interest earned in two years at 12% per annum is Rs 10176. What is the sum (in Rs)
invested?
I. 50000
2. 60000
3. 40000
4. 80000
Que. 154 A certain principal is invested in a scheme of compound interest. The amount obtained after 1 year is Rs.
I. 20
2. 15
3. 25
4. 10
2400 and the amount obtained after 2 years is Rs. 2880. What is the rate of interest (in percentage)?
Que. 155 If interest being compound annually then what sum will amount to Rs. 2508.8 in 2 years at the rate of
I. 2000
2. 2200
3. 1800
4. 2500
12% per annum at compound interest?
Que. 156 If interest being compound half yearly then what sum (in Rs) will amount to Rs 38416 in 2 years at the
rate of 80% per annum at compound interest?
I. 14000
2. 15000
3. 10000
4. 12000
Que. 157 What is the compound interest (in Rs) on a principle sum of Rs 2800 for 2 years at the rate of 12% per
annum?
I. 687.18
2. 634.46
3. 712.32
4. 568.68
Que. 158 What will be the amount on Rs. 12500 at the rate of 20% per annum compounded yearly for 3 years?
I. Rs. 21080
2. Rs. 21560
3. Rs. 20600
4. Rs. 21600
Que. 159 If the amount received at 10% per annum Compound interest after 3 yrs is Rs. 19965, then what will have
been the principal (in Rs) amount?
I. 16000
2. 15000
3. 17000
4. 18000
Que. 160 At what rate of compound interest (in%) per annum will a sum of Rs. 15,000 become Rs. 18,150 in 2
J. 11
2. 10
3. 9
4. 12
years?
Que. 161 The compound interest earned in two years at 15% per annum is Rs. 20640 . What is the sum invested (in
Rs.)?
I. 64000
2. 60000
3. 56000
4. 52000
Que. 162 What is the compound interest (in Rs.) for 1 year on a sum of Rs. 20000 at the rate of 40% per annum
I. 8000
2. 8650
3. 8750
4. 8800
compounding half yearly?
Que. 163 The amount received at 10% per annum Compound interest after 3 yrs is Rs. 5324 . What was the
I. 4100
2. 4200
3. 4000
4. 4300
Que.164
I. 7
2. 8
3. 9
4. 10
principal (in Rs.)?
If the amount received at the end of 2 nd and 3rd year as Compound Interest on a certain Principal is Rs.
2100, and Rs. 2268 respectively, what is the rate (in%) of interest?
Que. 165 If the amount received at the end of 2 nd and 3rd year at Compound Interest on a ce1tain Principal is Rs
1,800, and Rs 1,926 respectively, what is the rate of interest?
I. 7.5%
2. 7%
3. 6%
4. 6.5%
Que. 166 An amount was lent for two years at the rate of20% per annum compounding annually. Had the
compounding been done half yearly, the interest would have increased by 241. What was the amount (in
Rs) lent?
I. 10,000
2. 12,000
3. 20,000
4. 24,000
Que. 167 What is the compound interest (in Rs) on Rs 12500 at the rate of 12% per annum compounded yearly for
I. 3000
2. 2980
3. 3050
4. 3180
2 years?
Que. 168 An amount was lent for one year at the rate of 18% per annum compounding annually. Had the
compounding been done half yearly, the interest would have increased by 324. What was the amount (in
Rs) lent?
I. 32000
2. 36000
3. 40000
4. 72000
Que.169
I. 14
2. 21
3. 28
4. 35
If a certain sum becomes 2 times in 7 years at compound interest, then in how many years, it will become
8 times?
Que. 170 If a ce1tain sum becomes 3 times in 6 years at compound interest, then in how many years, it will become
I. 81
2. 162
3. 27
4. 24
81 times?
Que. 171 Rajeev invested Rs. 4500 for 2 years at compound interest in a company which paid him interest of Rs.
I. 10
2. 15
3. 20
4. 18
1980. What will be the rate of interest (in percent) at which Rajeev invested his money?
Que. 172 If a ce1tain sum becomes 2 times in 5 years at compound interest, then in how many years, it will become
I. 10
2. 20
3. 15
4. 30
8 times?
Que. 173 If a certain sum becomes 4 times in 4 years at compound interest, then in how many years, it will become
I. 5
2. 12
3. 16
4. 24
Que.174
I.
64 times?
What will be the amount on Rs 24000 at the rate of 35% per annum compounded yearly for 2 years?
43740
2. 49870
3. 51785
4. 40890
Que. 175 A ce1tain principal is invested in a scheme of compound interest. The amount obtained after 2 years is Rs.
I. 5
2. 10
3. 15
4. 20
1210 and the amount obtained after 3 years is Rs. 1331. What is the rate of interest?
Que. 176 The compound interest earned in two years at 8% per annum is Rs. 4160. What is the sum (in Rs.)
invested?
I. 24000
2. 25000
3. 30000
4. 20000
Que. 177 If compound interest received on a ce1iain amount in the 3rd year is Rs. 1,240, what will be the
compound interest (in Rs) for the 4th year on the same amount at 9% rate of interest?
I. 1245.6
2. 1521.6
3. 1351.6
4. 1220.6
Que. 178 A sum amounts to Rs. 2420 in 2 years when invested at compound interest. If principal is Rs. 2000, then
I. 15
2. 10
3. 8
4. 12
what is the rate of interest (in %)?
Que. 179 What is the difference (in Rs.) between the compound interests on Rs. 4000 for 1 year at 12% per annum
I. 14.4
2. 12.4
3. 10.4
4. 16.4
compounded yearly and half - yearly?
Que. 180 The compound interest earned in two years at 12% per annum is Rs 10176. What is the sum (in Rs)
invested?
I. 50000
2. 60000
3. 40000
4. 80000
Que. 181 A sum amounts to Rs 7727.104 at the rate of 12% per annum compounded annually after three years.
What is the value of principal (in Rs)?
I. 5000
2. 5200
3. 5350
4. 5500
Que. 182 An amount of Rs. 35000 is invested in a scheme of compound interest. If rate of interest is 20% per
annum, then what will be the amount (in Rs.) obtained after 2 years?
I. 56200
2. 50400
3. 48600
4. 42500
Que. 183 For an amount, simple interest at the rate of interest of 12% per annum for 6 years is Rs. 25920. What
will be the compound interest (in Rs) on same amount at the rate of interest of 8% per annum
compounding annually for 2 years?
I. 4326.3
2. 5563.4
3. 5888.6
4. 5990.4
Que.184 The simple interest on a sum of money for 10 years is Rs. 3130. If the principal becomes 5 times after 5
I. 6260
2. 1565
3. 9390
4. 7825
years, then what will be the total interest (in Rs.) obtained after 10 years?
Que. 185 The number of trees in a town is 17640. If the numbers of trees increases annually at the rate of 5%, then
how many trees will be there after 2 years?
I. 14000
2. 15000
3. 16000
4. 19450
Que.186
I. 7
2. 9
3. 11
4. 13
IfRs. 2500 becomes to Rs. 2970.25 in 2 years at compound interest compounded annually, then what is
the yearly rate of interest (in % )?
Que. 187 A bank offers 40% compound interest compounded half yearly. A customer deposits Rs 7600 each on 1st
Janmuy and 1st July of a year. At the end of the year, the amount he would have gained from interest is
I. Rs 9727
2. Rs 2432
3. Rs 4864
4. Rs 1216
Que. 188 A bank offers 15% compound interest per half year. A customer deposits Rs 2400 each on 1st Januaiy
and 1st July of a year. At the end of the year, the amount he would have gained by way of interest is
I. Rs. 597.812
2. Rs.553.5
3. Rs. 557.812
4. Rs. 567.212
Que. 189 If the amount received at the end of 2nd and 3rd year at Compound Interest on a certain Principal is Rs.
25088, and Rs. 28098.56 respectively, what is the rate of interest?
I. 6 percent
2. 24 percent
3. 12 percent
4. 19 percent
Que. 190 A bank offers 10% interest compounded yearly. A customer deposits Rs. 3600 each on 1st Januaiy and
1st July of a year. At the end of the yeai·, the interest earned is.
I. Rs 549
2. Rs 2232
3. Rs 558
4. Rs 279
Que. 191 A bank offers 5% compound interest per half year. A customer deposits Rs. 6400 each on 1st Janua1y and
1st July of a year. At the end of the yeai·, the amount he would have gained by way of interest is:
I. Rs. 652
2. Rs. 388
3. Rs. 484
4. Rs. 544
Que. 192 A bank offers 15% compound interest yearly. A customer deposits Rs. 8800 each on 1st Janua1y and 1st
July of a year. At the end of the yeai·, the amount he would have gained by way of interest is __ .
I. Rs.8315
2. Rs.2029.5
3. Rs.4158
4. Rs.1039

Question. 1
Ashish borrows a sum of Rupees 5,000 at a simple rate of 10% per annum for 6 years. Find the amount to be paid at the end of 6 years.
1. Rs. 8,000
2. Rs. 6,000
3. Rs. 12,000
4. Rs. 10,000
Question. 2
Compound interest of 2nd year is Rs. 90 more than that of first year. Find the second year com-pound interest, if rate of interest is 10% p.a.
1. Rs. 900
2. Rs. 990
3. Rs. 1800
4. Rs. 1200
Question. 3
A sum of ₹ 4200 becomes ₹ 5082 in 3 years at a simple interest. What is the rate of interest per an-num?
1. 8%
2. 9%
3. 5%
4. 7%
Question. 4
What will be compound interest (in Rs.) on a sum of Rs.6000 for 2 years at the rate of 10% per an-num?
1. 1260
2. 1200
3. 1380
4. 1140
Question. 5
A certain amount of money earns Rs. 540 as simple Interest in 3 years. If it earns a compound inter-est of Rs. 376.20 at the same rate of interest in 2 years, find the amount (in Rupees).
1. 1800
2. 2100
3. 2000
4. 1600
Question. 6
Kirthi borrows a sum of Rupees 10,000 at a simple rate of 12% per annum for 7 years. Find the amount to be paid at the end of 7 years.
1. Rs. 18,400
2. Rs. 19,600
3. Rs. 20,000
4. Rs. 17,200
Question. 7
A sum of money invested at a compound interest amounts to 800 in 2 year and 840 in 3 year. The rate of interest is:
1. 5%
2. 7%
3. 6%
4. 4%
Question. 8
If a person repaid 22500 after 10 years of borrowing a loan, at 10% per annum simple Interest then find out what amount did he take as a loan?
1. Rs. 11,225
2. Rs. 11,250
3. Rs. 10,000
4. Rs. 7,500
Question. 9
Simple interest is 36% less than the sum. What is the rate of interest if time and rate of interest is equal?
1. 5%
2. 8%
3. 4%
4. 10%
Question. 10
Find the amount received after 2 years when a sum is lent at 20% per annum compounded annu-ally, which gives a total simple interest for two years at same rate as INR 120.
1. INR 560
2. INR 463
3. INR 432
4. INR 500
Question. 11
Saral invested Rs. 160000 on compound interest at a certain rate of interest per annum for 2 years. She received an amount of Rs. 176400 after 2 years. Determine the rate of interest.
1. 8%
2. 12%
3. 5%
4. 24%
Question. 12
If the simple interest on a sum of money for 2 years at a rate of 20% per annum is Rs. 600, what will be the compound interest on the same sum at the same rate for the same time?
1. Rs. 710
2. Rs. 680
3. Rs. 690
4. Rs. 660
Question. 13
A certain amount of principal fetched a total simple interest of Rs. 4800 at the rate of 12% per year, in 5 years. What is the principal amount?
1. Rs. 20,000
2. Rs. 18,000
3. Rs. 8,000
4. Rs. 15,000
Question. 14
If the simple interest on a certain sum for 1.5 years at 8% p.a. is Rs. 360. Find the compound inter-est on the same sum for the same rate of interest but double the time?
1. Rs. 778
2. Rs. 778.13
3. Rs. 779
4. Rs. 779.13
Question. 15
A Person borrowed Rs. 32,000 at a yearly 9% simple interest and deposited the same amount in a bank at a yearly compound interest of 10%. What is the gain in rupees at the end of 3 years?
1. Rs. 926
2. Rs. 1,940
3. Rs. 2,904
4. Rs. 1,952
Question. 16
Find the compound interest on Rs. 50,000 in 3 years if rate of interest is 5% p.a. for the first year, 4% p.a. for the second year and 2% p.a. for the third year?
1. Rs. 5520
2. Rs. 6420
3. Rs. 5692
4. Rs. 5830
Question. 17
Due to lockdown Sumit took a loan from a Mahanjan at the rate of 6% simple interest per annum and he gave the same amount to Amit as a loan at the rate of 10% per annum on simple interest. If at the end of 13 years, he made a profit of Rs. 520 in the deal, then what was the original amount took as a loan?
1. Rs. 10000
2. Rs. 1500
3. Rs. 1200
4. Rs. 1000
Question. 18
A person took a loan of amount Rs. 8000 from bank and bank offers 10% annual CI for first 2 years and r% annual CI for 3rd last year. If person has to return Rs. 12100 to the bank, then find the value of ‘r’?
1. 15%
2. 35%
3. 25%
4. 20%
Question. 19
A certain sum amounts to ₹9243.20 in 112 years at 4% p.a. simple interest. What will be the simple interest on the same sum for 712 years at 8% per annum?
1. ₹5580
2. ₹5223
3. ₹5232
4. ₹5508
Question. 20
The sum invested and simple interest earned on that sum are Rs. 75000 and Rs. 87750. Find the time for which the sum is invested if the rate was 15% for first some years and 18% for remaining 4 years.
1. 7 years
2. 6 years
3. 8 years
4. 9 years
Question. 21
A man borrowed Rs. 8000 at compound interest at the rate of 10% per annum. If the interest is compounded half yearly, then what will be the amount(n Rs.) to be paid after 1.5 year?
1. 9413
2. 9261
3. 8286
4. 8142
Question. 22
Compound interest received on a certain amount for the 3rd year is Rs. 9,600. What will be the com-pound interest (in Rs) for the 4th year on the same amount at 12% rate of interest?
1. 10752
2. 11752
3. 10252
4. 11252
Question. 23
A certain principal invested at compound interest becomes 1.21 times of itself in 2 years. If thrice this principal were lent at simple interest, in how many years would it double itself?
1. 5 years
2. 10 years
3. 15 years
4. 20 years
Question. 24
A sum of money doubles itself in 3 years at a certain rate of interest compounded annually. In how many years will the sum amount to 32 times itself at the same rate of interest?
1. 10
2. 12
3. 16
4. 15
Question. 25
Find the interest that Rs. 8030 will incur from 20th Feb to 10th April [both days inclusive] in a non-leap year at the rate of 8% per annum?
1. Rs. 80
2. Rs. 800
3. Rs. 88
4. Rs. 880
Question. 26
A certain sum was put on simple interest at certain rate of interest for 3 years. If the sum was put at 1% higher rate of interest it would have fetched Rs. 990 more. What is the sum initially invested?
1. Rs. 99000
2. Rs. 33000
3. Rs. 30000
4. Rs. 50000
Question. 27
If the compound interest received on a certain amount in the first year is Rs. 1,440. What will be the compound interest for the second year on the same principal at a 10% rate of interest?
1. Rs. 1,540
2. Rs. 1,584
3. Rs. 1,554
4. Rs. 1,512
Question. 28
A sum of Rs. 6400 invested under simple interest at rate of 8% p.a. If the amount after 5 years is withdrawn and half of the total amount is invested in Share market. Find the remaining amount. (in Rs.)
1. Rs. 4740
2. Rs. 4840
3. Rs. 4480
4. Rs. 4640
Question. 29
The compound interest on a certain sum of money for 3 years at the rate of 10% per annum is Rs. 993.00. The simple interest on the same sum at the rate of 8% per annum for 4 years would be equal to which of the following?
1. Rs. 900.00
2. Rs. 930.00
3. Rs. 960.00
4. Rs. 990.00
Question. 30
The amount of 6800 rupees is given at an annual rate of 8% on ordinary interest. If after 5 years the amount was withdrawn and half of the total amount was invested in the stock market. So tell the remaining amount? (In rupees)
1. 4,560
2. 4,460
3. 4,760
4. 4,660

Q1) The Simple interest on a certain sum for 2 years at 10% per annum is Rs. 90. The
corresponding compound interest is:
A. 97
B. 90
C. 94.50
D. 100
Correct Answer: “C”
Q2) The SI on a certain sum of money for 3 year at 8% pa is half the CI on Rs. 8000 for
2 year at 10% pa. Find the sum placed on simple interest?
A. Rs 3500
B. Rs 3800
C. Rs 4000
D. Rs 4500
Correct Answer: “A”
Q3) Dheeraj had ₹ 23,000. He invested some amount in scheme A at SI at 20% and the
remaining amount in scheme B at CI at 10%. If Sanjay got the same amount from both
of them at the end of one year, how much (in ₹) did he invest in scheme B?
A. 15000
B. 12000
C. 11500
D. 13000
Correct Answer: “B”
Q4) What sum invested for 2 years at 12% compounded annually will grow to Rs.
4390.40?
A. 4000
B. 3875
C. 3800
D. 3500
Correct Answer: “D”
Compound Interest Practice Questions Free e-book
Q5) Divide Rs. 3903 between A and B, so that A’s Share at the end of 7 years may
equal to B’s share at the end of 9 years, compound interest being at 4 percent.
A. 2018 and 1885
B. 2028 and 1875
C. 2008 and 1895
D. 2038 and 1865
Correct Answer: “B”
Q6) What will be the compound interest on a sum of ₹ 9000 at compound interest
compounded annually at 8% per annum in two years?
A. Rs 1497.6
B. Rs 1479.6
C. Rs 1498
D. None of these
Correct Answer: “A”
Q7) ₹ 6100 was partly invested in Scheme A at 10% pa compound interest (compounded
annually) for 2 years and partly in Scheme B at 10% pa simple interest for 4 years. Both
the schemes earn equal interests. How much was invested in Scheme A?
A. Rs 4000
B. Rs 4500
C. Rs 5000
D. Rs 3250
Correct Answer: “A”
Q8) What annual payment will discharge a debt of 1025 due in 2 years at the rate of
5% compound interest?
A. 550
B. 551.25
C. 560
D. 560.35
Correct Answer: “B”
Compound Interest Practice Questions Free e-book
Q9) If the difference between the CI and SI on a sum of money at 5% per annum for 2
years is Rs.16. Find the Simple Interest?
A. 180
B. 460
C. 520
D. 640
Correct Answer: “D”
Q10) Rahul borrowed Rs. 1200 at 12% PA. He repaid Rs. 500 at the end of 1 year. What
is the amount required to pay at the end of 2nd year to discharge his loan which was
calculated in CI
A. 945.28
B. 1106.00
C. 1107.55
D. 1100.65
Correct Answer: “A”
Q11) Shivam has some amount of money and he invested the money in two schemes
A and B in the ratio of 2 : 5 for 2 years, scheme A offers 30% pa compound interest
and scheme B offers 15% pa Simple interest. Difference between the interest earned
from both the schemes is Rs.1080. How much was invested in scheme B?
A. Rs 45000
B. Rs 46000
C. Rs 40000
D. Rs 45000
Correct Answer: “A”
Q12) A sum of Rs.8584 is to be paid back in 3 equal annual installments. How much is
each installment if the interest is compounded annually at 14% per annum?
A. Rs 3700
B. Rs 4500
C. Rs 5500
D. Rs 5400
Correct Answer: “A”
Compound Interest Practice Questions Free e-book
Q13) Anjali lent Rs. 7000 to Suman for 3 years and Rs. 5000 to Sumit for 5 years on
simple interest at the same rate of interest and she received Rs. 5520 from both of
them as interest. Find the rate of interest.
A. 12 %
B. 13 %
C. 14 %
D. None of these
Correct Answer: “A”
Q14) The compound interest on Rs 7500 in 2 years when the successive rate of
interest on successive years is 8% and 10% respectively:
A. Rs 1410
B. Rs 7510
C. Rs 1497
D. Rs None of these
Correct Answer: “A”
Q15) The CI on a certain sum at 10% pa for 2yrs is Rs.6548. What is SI on the sum of
money at 7% pa for 4 years (approx)?
A. 8700
B. 8731
C. 8370
D. 8470
Correct Answer: “B”
Q16) If 40% increase in an amount in 4 years at SI. What will be the CI of Rs.10,000
after 2 yrs at the same rate?
A. 1000
B. 1100
C. 2000
D. 2100
Correct Answer: “D”
Compound Interest Practice Questions Free e-book
Q17) A sum of money doubles itself at CI in 10yrs. In how many yrs will it become 4
times?
A. 10yrs
B. 20yrs
C. 15yrs
D. 22yrs
Correct Answer: “B”
Q18) The difference between the total simple interest and the total compound interest
compounded annually at the same rate of interest on a sum of money at the end of
two years is Rs. 350. What is definitely the rate of interest per cent per annum?
A. 9,300
B. 7600
C. 12000
D. Data inadequate
Correct Answer: “D”
Q19) Rs.5200 was partly invested in Scheme A at 10% pa CI for 2 years and Partly
invested in Scheme B at 10% pa SI for 4 years. Both the schemes earn equal interests.
How much was invested in Scheme A?
A. Rs.1790
B. Rs.2200
C. Rs.3410
D. Rs.2670
Correct Answer: “C”
Q20) Mr. Binod wins Rs. 120000 on KBC. He has to pay 25% as gift tax to the
government. He places remaining money in fixed deposit @ 10% compounded
annually. However, he has to pay 20% tax on the interest. How much money does Mr.
Binod has after 4 years?
A. Rs 122444
B. Rs 112880
C. Rs 118860
D. None of these
Correct Answer: “A”
Compound Interest Practice Questions Free e-book
Q21) A lent an amount of Rs. 1100 to B. This is to be paid back to A in two
instalments. If the rate of interest, which A charges to B, be 20% compounded
annually, then what is the value of each installment?
A. Rs 730
B. Rs 720
C. Rs 710
D. Rs 780
Correct Answer: “B”
Q22) The simple interest accrued on an amount of Rs. 18,500 at the end of three years
is Rs. 7770. What would be the compound interest accrued on the same amount at the
same rate in the same period?
A. Rs 8908.56
B. Rs 8218.27
C. Rs 7754.57
D. None of these
Correct Answer: “A”
Q23) A man borrows Rs 4000 at 8% compound interest for 3 years. At the end of each
year he paid Rs 500. How much amount should he pay at the end of 3rd year to clear
the debt?
A. Rs 4254.5
B. Rs 3465.2
C. Rs 3485.2
D. Rs 3915.6
Correct Answer: “D”
Q24) The difference between compound interest earned after 3 years at 5% p.a. and
simple interest earned after 4 years at 4% p.a. is Rs 76. Find the principal amount.
A. Rs 32,000
B. Rs 28,000
C. Rs 31,500
D. Rs 32,500
Correct Answer: “A”
Compound Interest Practice Questions Free e-book
Q25) A certain amount of money is lent out at compound interest at the rate of 20%
per annum for two years, compounded annually. It would give Rs. 482 more if the
amount is compounded half yearly. Find the principle.
A. Rs 20000
B. Rs 30000
C. Rs 15000
D. Rs 25000
Correct Answer: “A”
Q26) A sum of Rs. 9960 was borrowed at 15/2% per annum compound interest and
paid back in two years in two equal annual installments. What was the amount of each
installment?
A. Rs 5345
B. Rs 5547
C. Rs 5847
D. None of these
Correct Answer: “B”
Q27) A sum of rupees 4420 is to be divided between Rakesh and Prakash in such a
way that after 5 years and 7 years respectively the amount they get is equal. The rate
of interest is 10 percent. Find the share of Rakesh and Prakash
A. 2000, 2420
B. 2420, 2000
C. 2480, 2420
D. 2210, 2210
Correct Answer: “B”
Q28) A sum of rupees 3200 is compounded annually at the rate of 25 paise per rupee
per annum. Find the compound interest payable after 2 years.
A. 1200
B. 1600
C. 1800
D. 2000
Correct Answer: “C”
Compound Interest Practice Questions Free e-book
Q29) A man lent Rs. 4500 at 30% compound interest per annum for 3 years. What is
the difference between the interest earned by the man in the 2nd year only and the
interest earned by the man in the 3rd year only?
A. Rs 526.5
B. Rs 502
C. Rs 529
D. None of these
Correct Answer: “A”
Q30) Shubham deposited Rs. 80000 in a bank which pays 10% compound interest for
2 years. Then after 2 years, he started a business with amount (sum + interest) along
with Ramesh, with capital of Rs. 60,000. Shubham invested for 6 months and left.
Ramesh invested for the whole year. What will be the ratio of their profits at the end of
the year?
A. 121:150
B. 150:221
C. 130:121
D. 155:101
Correct Answer: “A”
Q31) A man borrows 10000 rupees at 20 % compound interest for 3 years. If every
year he pays 2000 rupees as repayment. How much amount is still left to be paid by
the man?
A. 5000
B. 7000
C. 9000
D. 10000
Correct Answer: “D”
Q32) A man borrows 2000 rupees at 10% compound interest. At the end every year he
pays rupees 1000 back. How much amount should he pay at the end of the third Year
to clear all his debt?
A. 252
B. 352
C. 452
D. 552
Correct Answer: “B”
Compound Interest Practice Questions Free e-book
Q33) A sum of rupees 4420 is to be divided between Raju and Pawan in such a way
that after 5 years and 7 years respectively the amount they get is equal. The rate of
interest is 10 percent. Find the share of Raju & Pawan.
A. 2000, 2420
B. 2420, 2000
C. 2480, 2420
D. 2210, 2210
Correct Answer: “B”
Q34) There is 50% increase in an amount in 5 years at simple interest. What will be the
compound interest of Rs. 12,000 after 3 years at the same rate?
A. Rs. 2255
B. Rs. 2792
C. Rs. 3580
D. Rs. 3972
Correct Answer: “D”
Q35) A man borrows 3000 rupees at 10% compound interest. At the end every year he
pays rupees 1000 back. How much amount should he pay at the end of the fourth Year
to clear all his debt?
A. Rs. 680.5
B. Rs. 651.3
C. Rs. 751.3
D. Rs. 790.3
Correct Answer: “C”
Q36) The CI on Rs.6000 for 3 years at 8% for first year, 7% for second year, 6% for the
third year will be
A. Rs.1430
B. Rs.1530
C. Rs.1250
D. Rs.1350
Correct Answer: “D”
Compound Interest Practice Questions Free e-book
Q37) The compound interest on a certain sum for 2 years is Rs. 786 and S.I. is Rs. 750.
If the sum is invested such that the S.I. is Rs. 1296 and the number of years is equal to
the rate per cent per annum, Find the rate of interest?
A. 4%
B. 5%
C. 6%
D. 8%
Correct Answer: “C”
Q38) Akhil invests Rs. x in insurance which gives her returns at 21% annually and Rs.
y in mutual funds which gives her returns of 10% compounded half yearly. If Akhil
gets the same returns from both the investments after 1 year, then what is the square
root of the ratio of x to y?
A. 1:2
B. 11:21
C. 21:22
D. 21:25
Correct Answer: “C”
Q39) If Rs. 7200 amounts to Rs.10368 at compound interest in a certain time, then Rs.
7200 amounts to what in half of the time?
A. 8640
B. 8600
C. 8800
D. 8520
Correct Answer: “A”
Q40) What is be the compound interest (in Rs.) accrued on an amount of Rs. 15000 at
the rate of 20 per cent annum in two years, if the interest is compounded half-yearly?
A. 6196.5
B. 6916.5
C. 6961.5
D. None of these
Correct Answer: “C”