
Que. 1 LiABC is right angled at B. BD is an altitude. IfDC = 5 cm and AD= 40 cm, what is the value of BC (in
I. 12
2. 18
3. 15
4. 16
cm)?
Que. 2 What is the equation of a line which has 4 as x-intercept and -6 as y-intercept?
I. 3x- 2y= 12
2. 3x - 2y=-12
3. 2x - 3y= 12
4. 2x- 3y=-12
Que. 3 What is the distance between the points (3, -6) and (-3, 2)?
I. 13
2. 12
3. 11
4. 10
Que. 4 What is the reflection oft he point (2, -4) in the line y= 1?
I. (2, 6)
2. (0, -4)
3. (-2, 6)
4. (0, 4)
Que. 5 LiABC is similar to .6.PQR. If ratio of perimeters of LiABC: .6.PQR is 3 : 5 and if PQ = 15 cm, then what is
I. 9
2. 10
3. 12
4. 8
the length (in cm) of AB?
Que. 6 What is the slope of the line pe1pendicular to the line passing through the points (2, - 5) and (4, 0)?
I. - 5 12
2. 2 I 5
3. - 215
(2)
4. 5 /2
Que. 7 Point P is the midpoint of segment AB. Co - ordinates of P is (- 5, - 2) and A is (- 2, 0). What are the co -
ordinates of point B?
I. (- 8,- 4)
2. (- 8, 4)
3. (8, - 4)
4. (8, 4)
Que. 8
I.
What is the reflection of the point (- 2, 5) in the line x = 1?
(4, - 5)
2. (4, 5)
3.
4.
(- 4, - 5)
(- 4, 5)
Que. 9 !1XYZ is similar to !1PQR and XY : PQ = 4 : 1. If Area of !1PQR is 4 sq cm, what is the area (in sq cm) of
I. 16
2. 32
3. 64
4. 28
!1XYZ?
Que. 10 What is the slope of the line 5x + 4y = 10?
I. 5 I 4
2. -4 I 5
3. -5 I 4
4. 4/ 5
Que. 11 In what ratio is the segment joining point (3, -3) and point (-5, 2) divided by the y-axis?
I. 5: 3
2. 3: 2
3. 3: 5
4. 2: 3
Que. 12 What is the reflection of the point (-2, 6) in the line x = -1?
I. (-2, -8)
2. (2, 6)
3. (0, 6)
4. (-2, 8)
(3)
Que. 13 PAQ is a tangent to a circle with centi·e 0, at a point A on it. AB is a chord such that LBAQ = x0 (x < 90°).
C is a point on the major arc AB such that LACB = y0
• If LABO = 32°, then the value ofx + y is:
I. 112°
2. 98°
3. 116°
4. 110°
Que.14 In the u-iangle, if AB = AC and LABC = 72°, then LBAC is:
I. 54°
18° 2.
3. 30°
4. 36°
Que. 15 From an external point P, a tangent PQ is drawn to a circle, with the centi·e 0, touching the circle at Q. if
the distance of P from the centi·e is 13 cm and length of the tangent PQ is 12 cm, then the radius of the
circle is:
I. 5 cm
2. 12.5 cm
3. 10 cm
4. 3 cm
Que. 16 In a circle, AB is the diameter and CD is a chord. AB and CD produced meet at a point P, outside the
circle. If PD= 15.3 cm, CD= 11.9 cm and AP= 30.6 cm, then the radius of the circle is:
I. 7.5 cm
2. 9 cm
3. 8.5 cm
4. 8 cm
Que. 17 In a circle, chords PQ and TS are produced to meet at R. ifRQ = 14.4 cm, PQ = 11.2 cm, and SR = 12.8
cm, then the length of chord TS is:
I. 18 cm
2. 16 cm
3. 14.2 cm
4. 112.4 cm
Que. 18 In the figure, PA is a tangent from an external point P to the circle with cenu-e 0. If LPOB = 110°, then the
measure of LAPO is:
(4)
p
B
I. 40°
2. 20°
3. 25°
4. 30°
Que. 19 In the given figure 􀁁ABC, if 0 = goo , the measure of each of the other two angles will be:
A
C B
I. 50°
2. goo
3. 40°
4. 60°
Que. 20 B 1 is a point on the side AC of MBC and B1B is joined. A line is drawn through A parallel to B1B
meeting BC at A 1 and another line is drawn through C parallel to B 1B meeting AB produced at C1. Then
J. __ 1 __1_ = _1
CC1 AA1 BB1
2. _1 + _1_ = _1
CC1 AA1 BB1
3. _1 - _1 = _2
BB1 AA1 CC1
4. _1 - _1_ = _2_
AA1 CC1 BB1
Que. 21 0 is the circumcenter of the isosceles 􀁂C. Given that AB = AC = 5 cm and BC = 6 cm. The radius of
the circle is
I. 3.015 cm
2. 3.205 cm
3. 3.025 cm
4. 3.125 cm
Que. 22 If D and E are the midpoints of AB and AC respectively of 􀁂C, then the ratio of the areas of ADE and
BCED is:
J. 1: 2
2. 1: 4
(5)
3. 2: 3
4. 1 : 3
Que. 23 ABC is an isosceles triangle where AB= AC which is circumscribed about a circle. If P is the point where
the circle touches the side BC, then which of the following is tiue?
I. BP=PC
2. BP> PC
3. BP<PC
4. BP= PC/2
Que. 24 ABC is an isosceles triangle inscribed in a circle. If AB = AC = 12✓5 and BC = 24 cm then radius of circle
lS
I. 10 cm
2. 15 cm
3. 12 cm
4. 14 cm
Que. 25 A and Bare the centi·es of two circles with radii 11 cm and 6 cm respectively. A common tangent touches
these circles at P &Q respectively. If AB = 13 cm, then the length of PQ is
I. 13 cm
2. 17 cm
3. 8.5 cm
4. 12 cm
Que. 26 Let G be the centi·oid of the equilateral ti·iangle ABC of perimeter 24 cm. Then the length of AG is I. 2✓3 cm
2. 8/✓3 cm
3. 8✓3 cm
4. 4✓3 cm
Que. 27 Let two chords AB and AC of the larger circle touch the smaller circle having the same centi·e at X and
Y,thenXY=?
I. BC
2. BC/2
3. BC/3
4. BC/4
Que. 28 In quadrilateral PQRS, RM .l Qs, PN .l QS and QS = 6 cm. IfRM = 3 cm and PN = 2 cm, then the area of
PQRS is
I. 15 cm2
(6)
2. 13 cm2
3. 11 cm2
4. 14 cm2
Que. 29 A chord of a circle is equal to its radius. The angle subtended by this chord at a point on the circumference
I. 80°
2. 60°
3. 30°
4. 90°
lS
Que. 30 LiABC is similar to LiDEF. If the area of LiABC is 9 sq. cm, and area of LiDEF is 16 sq.cm, and BC = 2.1
cm. then the length of EF will be
I. 5.6 cm
2. 2.8 cm
3. 3.7 cm
4. 1.4 cm
Que. 31 AB a diameter of a circle with centre 0. The tangent at a point C on the circle meets AB produced at Q. If
I. 5°
2. 7°
3. 17°
4. 6°
LCAB = 42°, then what is the measure of LCQA?
Que. 32 LiABC, Dis a point on BC such that AD is the bisector of LA, AB = 11.7 cm, AC = 7.8 cm and BC = 13
I. 7.8
2. 5.6
3. 6.5
4. 5.2
cm. what is the length (in cm) of DC?
Que. 33 In the given figure, a circle inscribed in .6.PQR touches its sides PQ, QR and RP at points S, T and U,
respectively. If PQ = 15 cm, QR= 10 cm, and RP= 12 cm, then find the lengths of PS, QT and RU?
(7)
R
s
I. PS= 6.5 cm, QT= 8.5 cm and RU= 3.5 cm
2. PS= 3.5 cm, QT= 6.5 cm and RU= 8.5 cm
3. PS= 8.5 cm, QT= 6.5 cm and RU= 3.5 cm
4. PS= 8.5 cm, QT= 3.5 cm and RU= 6.5 cm
Que. 34 In the given figure, MP is tangent to a circle with centi·e A and NQ is a tangent to a circle with centi·e B. If
MP= 15 cm. NQ = 8 cm. PA= 17 cm and BQ = 10 cm, then AB is:
I. 23 cm
2. 13.5 cm
3. 28 cm
4. 14 cm
Que. 35 In the given figure, the measure of LBAC is:
A
B
I. 56°
2. 58°
3. 62°
4. 48°
Que. 36 In the figure, if LA = l 00° then LC = ?
(8)
I. 100°
2. 80°
3. 50°
4. 90°
D
Que. 37 Two chords AB and CD of a circle with centre O intersect at P. If LAPC = 40° ,then the value of LAOC +
I. 50°
2. 60°
3. 80°
LBOD is:
4. 120°
Que. 38 In a circle with centi·e 0, AB is diameter and CD is a chord which is equal to the radius OC. AC and BD
are extended in such a way that they intersect each other at a point P, exterior to the circle. The measure of
LAPB is:
I. 30°
2. 45°
3. 60°
4. 90°
Que. 39 LiABC is isosceles having AB = AC and LA = 40°. Bisectors PO and OQ of the exterior angles LABD and
LACE fo1med by producing BC on both sides, meet at 0. The value of LBOC is:
I. 70°
2. 110°
3. 80°
4. 55°
Que. 40 ABC is a triangle, PQ is line segment intersecting AB in P and AC in Q and PQ II BC. The ratio of AP :
BP = 3 : 5 and length of PQ is 18 cm. The length of BC is:
I. 28 cm
2. 48 cm
3. 84 cm
4. 42 cm
(9)
Que. 41 In a circle, a diameter AB and a chord PQ (which is not a diameter) intersect each other at X
perpendicularly. If AX : BX = 3 : 2 and the radius of the circle is 5 cm, then the length of chord PQ is
I. 2✓13 cm
2. 5✓3 cm
3. 4✓6 cm
4. 6✓5 cm
Que. 42
I. goo
2. 40°
3. 90°
4. 50°
In 􀁉ABC, AC = BC and LABC = 50°, the side BC is produced to D so that BC = CD then the value of
LBAD is:
Que. 43 PQ is a tangent to the circle at T. IfTR = TS where, Rand Sare points on the circle and LRST = 65° , the
LPTS =?
I. 45°
2. 130°
3. 115°
4. 55°
Que. 44 Two regular polygons are such that the ratio between their number of sides is 1 : 2 and the ratio of
measmes of their interior angles is 3 : 4. Then the number of sides of each polygon is:
I. 10, 20
2. 4,8
3. 3, 6
4. 5, 10
Que. 45
I.
The lengths of the diagonals of a rhombus are 16 cm and 12 cm. Its area is:
69 cm2
2. 48 cm2
3. 28 cm2
4. 96 cm2
Que. 46 In the given figme, if LAPO = 35°, then which of the following options is conect?
(10)
A
I. LBPO = 35
2. LBPO = 55°
3. LAPB = goo
4. LAPB = 60°
Que. 47 In the given figure, if AB = 10 cm, CD = 7 cm, SD = 4 cm and AS = 5 cm, then BC = ?
I. 9cm
2. g cm
DOR C
s Q
A p B
3. 7.5 cm
4. 6 cm
Que. 48 In the given figure, if AB = g cm, AC= 10 cm, LABD = 90° and AD = 17 cm, then the measure of CD is:
A
B D
I. 10 cm
2. gcm
3. 9cm
4. 11 cm
Que. 49 A, B, and C are three points on a circle such that the angles subtended by the chords AB and AC at the
centre Oare goo and 120°, respectively. The value of LBAC is:
I. g5o
2. 75°
3. goo
(11)
4. 70°
Que. 50 In a 􀁏ABC, DE is parallel to BC, AD= a, DB= a+ 4, AE = 2a + 3, EC= 7a. what is the value of 'a' if a>
O?
I. 4
2. 6
3. 5
4. 3
Que. 51 Two tangents PA and PB are drawn to a circle with centre O from an external point P. if LOAB = 30°,
I. 15°
2. 30°
then LAPB is:
3. 120°
4. 60°
Que. 52 ABC is an equilateral triangle. P, Q and R are the midpoints of sides AB, BC and CA, respectively. If the
length of the side of the triangle ABC is 8 cm, then the area 􀁏PQR is:
I. 4✓3 cm2
2. 8✓3 cm2
3. ✓313 cm2
4. ✓314 cm2
Que. 53 In the given figure if DE IIBC, AD= 2.5 cm, DB= 3.5 cm and EC= 4.2 cm, then the measure of AC is:
A
B C
I. 3 cm
2. 3.2 cm
3. 7.2 cm
4. 7.4 cm
Que. 54 In the figure, two circles with centres P and Q touch externally at R. Tangents AT and BT meet the
common tangent TR at T. If AP= 6 cm and PT= 10 cm, then BT=?
(12)
I. 6cm
2. 10 cm
3. 8cm
4. 12 cm
Que. 55 If angles of a ti·iangle are in the ration of 2 : 3 : 4, then the measure of the smallest angle is:
I. 30°
2. 50°
3. 40°
4. 20°
Que. 56 In the given figure, if LKLN = 58°, then LKMN =?
L􀀄---
N
I. 58°
2. 32°
3. 26°
4. 42°
Que. 57 PQ and RS are common tangents to two circles intersecting at A and B. AB, when produced both sides,
meet the tangents PQ and RS at X and Y, respectively. If AB= 3 cm, XY = 5 cm, then PQ (in cm) will be
I. 3 cm
2. 4 cm
3. 5 cm
4. 2 cm
Que. 58 If O is the orthocenti·e of D.ABC and LBOC = 100°, the measure of LBAC is
I. 100°
2. 180°
(13)
3. 80°
4. 200°
Que. 59 D and E are points on the sides AB and AC respectively of LiABC such that DE is parallel to BC and AD :
DB = 4: 5, CD and BE intersect each other at F. Then the ratio of the areas of LiDEF and LiCBF
1. 16: 25
2. 16: 81
3. 81 : 1
4. 4: 9
Que. 60 LiABC is an isosceles right - angled triangle having LC = 90° . If D is any point on AB, then AD2 + BD2 is
equal to
1. cn2
2. 2CD2
3. 3CD2
4. 4CD2
Que. 61 In a triangle ABC, LA= 70°, LB= 80° and O is the incentre of LiABC. LACB = 2x0 and LBOC = y0
• The
values of x and y, respectively are
1. 15, 130
2. 15, 125
3. 35,40
4. 30, 150
Que. 62 ABCD is a cyclic quadrilateral of which AB is the diameter. Diagonals AC and BD intersect at E. If
1. 35°
2. 45°
3. 55°
4. 90°
LDBC = 35°, then LAED measmes
Que. 63 Diameter AB of a circle with centre O is produced to a point P such that PO = 16.8 cm. PQR is a secant
that intersects the circle at Q and R such that PQ = 12 cm and PR = 19.2 cm. The length of AB (in cm) is:
1. 14.4
2. 15.2
3. 14.2
4. 15.8
Que. 64 In .6.PQR, PQ = 24 cm and LQ = 58° . Sand T are the points on side PQ and PR, respectively, such that
(14)
LSTR = 122°.lf PS= 14 cm and P T= 12 cm, then the length of RT is:
I. 14.8 cm
2. 16.4 cm
3. 15 cm
4. 16 cm
Que. 65 ABCD is a cyclic quadrilateral in which sides AD and BC are produced to meet at P, and sides DC and AB
I. 30°
2. 36°
3. 24°
4. 40°
meet at Q when produced. If LA = 60° and LABC = 72°, then LDPC-LBQC =?
Que. 66 Two chords AB and CD of a circle with centre O intersect each other at P. fi L APC = 95° and L AOD =
I. 60°
2. 70°
3. 55°
4. 65°
110°.LBOC is:
Que. 67 Sides AB and DC of a cyclic quadrilateral ABCD are produced to meet at E, and sides AD and BC are
I. 21°
2. 31°
3. 22°
4. 23°
produced to meet at F. LADC = 75° , and LBEC = 52°, then the difference between LBAD and LAFB is:
Que. 68 D is the midpoint of side BC of D-ABC. Point E lies on AC such that CE = AC/3. BE and AD intersect at
G. What is AG/GD?
I. 3 : 1
2. 4: 1
3. 5: 2
4. 8: 3
Que. 69 PRT is a tangent to a circle with centi·e 0, at the point Ron it. Diameter SQ of the circle is produced to
I. 62°
2. 32°
3. 29°
4. 34°
meet the tangent at P and QR is jointed. If LQRP = 28° , then the measme of LSPR is:
(15)
Que. 70 In 􀁇ABC, D and E are the points on sides AC and BC, respectively such that DE II AB .Fis a point on CE
such that DF II AE. If CE= 6c m, and CF= 2.5 cm, then BC is equal to:
I. 12 cm
2. 15.6 cm
3. 14cm
4. 14.4 cm
Que. 71 Two chord AB and CD of a circle are produced to intersect each other at a point P outside the circle . If AB
= 7 cm, BP = 4.2 cm and PD = 2.8 cm, then the length of CD is:
I. 15.8 cm
2. 12 cm
3. 14 cm
4. 14.6 cm
Que. 72 In 􀁇PQR, LQ = 85° and LR = 65° . Points Sand Tare on the sides PQ and PR, respectively such that
LSTR = 95° and the ratio of the QR and ST is 9: 5. If PQ = 21.6 cm, then the length of P T is:
I. 12 cm
2. 10.5 cm
3. 9cm
4. 9.6 cm
Que. 73 In 􀁈C, LB = 72° and LC = 44°, Side BC is produced to D . The bisectors of LB and LACD meet at E.
I. 36°
2. 32°
3. 46°
4. 58°
what is the measure of LBEC?
Que. 74 The chords AB and CD of a c ircle intersect at E. if AE = 12 cm, BE= 20.25 cm and CE= 3 DE, then the
I. 27
2. 18
length (in cm) of CE is:
3. 25.5
4. 28.5
Que. 75 In 􀁈C, AC= 8.4 cm and BC= 14 cm, P is a point on AB such that CP = 11.2 cm and LACP =LB. what
I. 3.6
is the length ( in cm) of BP?
2. 3.78
3. 4.12
(16)
4. 2.8
Que. 76 The area of a field in the shape of a regular hexagon is 2400✓3 m2. The cost of fencing the field at Rs.
16.80/metre is:
I. Rs. 4,032
2. Rs. 3,024
3. Rs. 3,528
4. Rs. 4,536
Que. 77 Two circles of radii 7 cm and 5 cm intersect each other at P and Q, and the distance between their centres
is 10 cm. The length (in cm) of the common chord PQ is:
I. 4✓66
5
2. 3 ✓ 74
5
3. 3 ✓ 66
5
4. 2✓74
5
Que. 78 MBC, AB= AC. A circle drawn through B touches AC at D and intersects AB at P. IfD is the midpoint
of AC and AP= 2.5 cm, then AB is equal to:
I. 12.5 cm
2. 10 cm
3. 9 cm
4. 7.5 cm
Que. 79 MBC, LA = 90°, M is the midpoint of BC and D is a point on BC such that AD .1 BC. If AB = 7 cm and
AC = 24 cm, then AD : AM is equal to:
I. 168: 275
2. 336: 625
3. 24: 25
4. 32: 43
Que. 80 In MBC, LB= 68° and LC= 32°. Sides AB and AC are produced to points D and E respectively. The
I. 65°
2. 50°
3. 55°
4. 39°
bisectors of LDBC and LBCE meet at F. what is the measure of LBFC?
Que. 81 ABCD is a cyclic quadrilateral in which AB= 16.5 cm, BC= x cm, CD= 11 cm, AD= 19.8 cm, BD is
(17)
bisected by AC at 0. What is the value ofx?
I. 13.8 cm
2. 12.4 cm
3. 12.8 cm
4. 13.2 cm
Que. 82 In a circle with radius 5 cm, a chord is at a distance of 3 cm from the centre. The length of the chord is:
J. 8 cm
2. 3 cm
3. 7 cm
4. 4 cm
Que. 83 In the given figme, AP bisects LBAC. If AB = 4 cm, AC = 6 cm and BP = 3 cm, then the length of CP is:
B􀀃C p
I. 4.5 cm
2. 3 cm
3. 5 cm
4. 7 cm
Que. 84 In the given figme, AP and BP are tangents to a circle with centre 0. If LAPB = 62° then the measme of
LAQB is:
I. 59°
2. 28°
3. 118°
4. 31°
p
Que. 85 In D-ABC, AB = AC and AL is perpendicular to BC at L. In D-DEF, DE= DF and DM is perpendicular to
EF at M. If (area of D.ABC) : (are of D-DEF) = 9 : 25 and LBAC = LEDF, then DM + AL
is equal to:
DM-AL
I. 3
2. 5
3. 6
(18)
4. 4
Que. 86
I. 24
2. 21
3. 28
4. 18
Que. 87
I. 44
2. 22
3. 11
4. 5.5
PQRS is a cyclic quadrilateral in which PQ = x cm, QR= 16.8cm, RS= 14 cm, PS= 25.2 cm, and PR
bisects QS. What is the value of x?
The area of .6.ABC is 44 cm2
. If D is the midpoint of BC and E is the midpoint of AB, then the area (in
cm2 ) of LiBDE is:
Que. 88 In .6.ABC, MNIIBC, the area of quadrilateral MBCN = 130 cm2
. If AN: NC= 4: 5, then the area of
LiMAN is:
I. 45 cm2
2. 65 cm2
3. 40 cm2
4. 32 cm2
Que. 89 A, B and C are three points on a circle such that the angles subtended by the chord AB and AC at the
I. 75°
2. 70°
3. 60°
4. 65°
centre Oare 110° and 130°, respectively. The value of LBAC is:
Que. 90 It is given that LiABC ~ LiEDF and Area LiABC : Area LiEDF = 64 : 25. If AB= 16 cm, BC= 18 cm, CA=
I. 15
20 cm. What is the value of EF (in cm)?
2. 12.5
3. 11.25
4. 10
Que. 91 In Li ABC, LC= 70°. The bisectors of LA and< B meet BC and AC in points D and E, respectively. AD
and BE intersect each other at P. What is the measme of LDPB?
(19)
I. 55°
2. 65°
3. 35°
4. 45°
Que. 92 In trnpezium ABCD, ABII DC. The sides AD and BC are produced to meet at E. AB = 15 cm, CD = 10 cm,
AD = 4 cm and BC = 5 cm, then DE = ?
I. 9 cm
2. 10cm
3. 6 cm
4. 8 cm
Que. 93 The side of a hexagon is 4 cm. The side of a square is 4✓2 cm. What is the ratio of their areas?
I. 3✓3: 2
2. 3✓3: 4
3. ✓312: 1
4. 2✓3: 1
Que. 94
I.
The diagonal of a square is 24 cm. What is its perimeter?
46✓2 cm
2. 28 cm
3. 48✓2 cm
4. 36✓2 cm
Que. 95 What is the ratio of the imadius and circumradius of a square?
J. 1 : 3
2. 1: ✓2
3. 1: 2
4. ✓2: 3
Que. 96
I.
If the lengths of the diagonals of a rhombus are 24 cm and 18 cm, then what is the area of the rhombus?
188 cm2
2. 196 cm2
3. 216 cm2
4. 204 cm2
Que. 97 The area of a square is 144 cm2
. What is the perimeter of the square fonned with the diagonal of the
original square as its side?
(20)
I. 48✓ 2cm
2. 24✓ 2cm
3. 48 cm
4. 24 cm
Que. 98 It is given that D-ABC ~ D. YZX and Ar D.ABC : Ar D.XYZ = 256 : 25. If AB = 12 cm, BC = 10 cm, CA =
15 cm, then what is the value of YZ (in cm)?
I. 10/3
2. 75/16
3. 25/8
4. 15/4
Que. 99 I is the incentre of D.ABC of LA= 46°, then LBIC =?
I. 113°
2. 124°
3. 134°
4. 93°
Que. 100 In D-ABC, AB = AC and D is a point on side AC such that BD = BC. If AB = 12.5 cm and BC = 5 cm,
then what is the measure of DC?
I. 2.5 cm
2. 3 cm
3. 1.8 cm
4. 2 cm
Que.101
I. 14°
2. 22°
3. 16°
4. 26°
ABCD is a cyclic quadrilateral. The tangents to the circle at the points A and C on it, intersect at P. If
LABC = 98° , then what is the measure of LAPC?
Que. 102 AB is a chord in a circle with centre 0. AB is produced to C such that BC is equal to the radius of the
circle. C is joined to O and produced to meet the circle at D. If LACD = 32°, then the measure of LAOD
IS
I. 48°
2. 108°
3. goo
4. 96°
(21)
Que. 103 In D.ABC, LC= 90°. Mand N are the mid-points of sides AB and AC, respectively. CM and BN intersect
each other at D and LBDC = 90° . IfBC = 8 cm, then the length ofBN is;
I. 6✓3 cm
2. 6✓6 cm
3. 4✓6 cm
4. 8✓3 cm
Que. 104 In the figure, in D.PQR, PT .l QR at T and PS is the bisector of LQPR. If LPQR = 78°, and LTPS = 24°,
then the measure of LPRQ is:
Q􀀅R
I. 42°
2. 39°
3. 30°
4. 40°
T S
Que. 105 Two chords AB and CD of a circle intersect each other at P internally. If AP= 3.5 cm. PC= 5 cm, and
DP= 7 cm, then what is the measure of PB?
I. 8 cm
2. 12 cm
3. 10 cm
4. 10.5 cm
Que. 106 ABCD is a cyclic quadrilateral in which AB= 15 cm, BC= 12 cm and CD= 10 cm. If AC bisects BD,
then what is the measure of AD?
I. 15 cm
2. 13.5 cm
3. 18 cm
4. 20 cm
Que. 107 From a point P which is at a distance of 10 cm from the centre O of a circle of radius 6 cm, a pair of
tangents PQ and PR to the circle at point Q and R, respectively, are drawn. The area of the quadrilateral
PQOR is equal to
I. 30 sq.cm
2. 40 sq.cm
3. 24 sq.cm
4. 48 sq.cm
(22)
Que. 108 The tangent at a point A on a circle with centre O intersects the diameter PQ of the circle, when extended,
at point B. If LBAQ = 105°, then LAPQ is equal to:
B
I. 55°
2. 60°
3. 65°
4. 75°
Que. 109 The length of parallel sides of a trapezium are 51 cm and 21 cm, and that of each of the other two sides is
I. 1206
2. 1296
3. 1152
4. 1260
39 cm. What is the area (in cm2) of the trapezium?
Que. 110 In 􀁒ABC, LC= 90° and D is a point on CB such that AD is the bisector of LA. If AC= 5 cm and BC=
12 cm, then what is the length of AD?
I. 10/3 cm
2. s✓ 13 cm
3. s✓ 13 cm
4. 20/3 cm
Que. 111
I. 65°
2. 75°
3. 70°
4. goo
ABCD is cyclic quadrilateral. Sides AB and DC, when produced, meet at E, and sides BC and AD, when
produced, meet at F. If LBFA = 60° LAED = 30° , then the measure of LABC is:
Que. 112 P is a point outside a circle and is 26 cm away from its centi·e. A secant P AB drawn from P intersects the
I. 12
2. 10
3. 13
4. 8
circle at point A and B such that PB= 32 cm and PA= 18 cm. The radius of the circle (in cm) is:
(23)
Que.113
I.
In 􀁍ABC, AB= c cm, AC= b cm and CB= a cm. If L A= 2LB, then which of the following is tme?
a2 =b2 -bc
2. a2 =b2 -ac
3. a2 = b2 + be
4. a2 = b2 + ac
Que.114
I. 2✓ 14
3
2. 2✓ii
3
3. 4✓13
3
4. 4 ✓ 14
3
Two circles of radii 5 cm and 3 cm intersect each other at A and B, and the distance between their centers
is 6 cm. The length (in cm) of the common chord AB is:
Que. 115 In 􀁍ABC, LA= 90°, AB= 16 cm and AC= 12 cm.D is the midpoint of AC and DE .l CB at E. What is
I. 7.68
2. 6.25
3. 8.64
4. 5.7 6
the area (in cm2) of 􀁍CDE?
Que. 116 The sides AB, BC and AC of a 􀁍ABC are 12 cm, 8 cm and 10 cm respectively. A circle is inscribed in
the triangle touching AB, BC and AC at D, E and F, respectively. The difference between the length of
AD and CE is:
I. 4 cm
2. 5 cm
3. 3 cm
4. 2 cm
Que.117
I.
The sides of 􀁍ABC are 10 cm, 10.5 cm and 14.5 cm. What is the radius of its circumcircle?
7.25 cm
2. 5.25 cm
3. 7.5 cm
4. 5 cm
Que. 118 A line touches a circle of radius 6 cm. Another line is drawn which is tangent to the circle. If the two lines
are parallel, then the distance between them is:
I. 6 cm
(24)
2. 10 cm
3. 8 cm
4. 12 cm
Que. 119 PT is a tangent at the point R on a circle with centre 0. SQ is a diameter, which when produced meets the
I. 58°
2. 30°
3. 32°
4. 29°
tangent PT at P. If LSPT = 32°, then what will be the measure of LQRP?
Que.120 In D-ABC, LC= 90° and CD is pe1pendicular to AB at D. If AD/BD = ✓k, then AC/BC=?
I. ✓k
2. k
3. -ijk
4. 1/✓k
Que. 121 P is a point outside a circle with centre 0, and it is 14 cm away from the centre. A secant PAB drawn
from P intersects the circle at the points A and B such that PA = 10 cm and PB = 16 cm. The diameter of
circle, is:
I. 13 cm
2. 10 cm
3. 12 cm
4. 11 cm
Que. 122 I is the in centre of D.ABC. If BIC = 108°, then LA = ?
J. 81 °
2. 72°
3. 54°
4. 36°
Que. 123 D is a point on the side BC of a D-ABC such that LADC = LBAC. If CA = 10 cm and BC = 16 cm, then
the length of CD is:
I. 6.5 cm
2. 7 cm
3. 6.25 cm
4. 6 cm
Que. 124 A circle touches the side BC of D-ABC at P and also touches AB and AC produced at Q and R,
respectively. If the perimeter of D.ABC = 26.4 cm, then the length of AQ is;
(25)
I. 13.2 cm
2. 17.6 cm
3. 15.4 cm
4. 8.8 cm
Que. 125 In a D.ABC, angle BAC = 90°. If BC = 25 cm, then what is the length of the median AD?
I. 12.5 cm
2. 24 cm
3. 14.5 cm
4. 10cm
Que. 126 PQRS is a rectangle. T is a point on PQ such that RTQ is an isosceles ti·iangles and PT= 5QT. If the area
of D.RTQ is 12✓3 sq.cm, then the area of the rectangle PQRS is:
I. 142 sq.cm
2. 142 ✓3 sq.cm
3. 134 ✓3 sq.cm
4. 144 ✓3 sq.cm
Que.127
I. 28°
2. 32°
3. 64°
4. 56°
D.ABC, BE .l AC, CD .l AB and BE and CD intersect each other at 0. The bisectors of LOBC and
LOCB meet At P. If LBPC = 148°, then what is the measure of LA?
Que. 128 If the measure of each exterior angle of a regular polygon is (51.1) ·, then the ratio of the number of its
7
diagonals to the number of its sides is:
I. 13: 6
2. 3: 1
3. 5 : 2
4. 2: 1
Que.129 If in D.PQR. LP = 120°, PS .l QR at S and PQ + QS = SR, then the measure of LQ is:
I. 30°
2. 40°
3. 20°
4. 50°
Que. 130 In D.ABD, C is the midpoint of BD. If AB= 10 cm, AD= 12 cm and AC= 9 cm, then BD =?
(26)
I. 2✓10 cm
2. ✓10 cm
3. ✓41 cm
4. 2✓41 cm
Que. 131
I. 36°
2. 34°
3. 26°
4. 24°
In a circle with centi·e 0, ABCD is a cyclic quadrilateral and AC is diameter. Chords AB and DC are
produced to meet at E. If LCAE = 34° and LE = 30°, then LCBD is equal to:
Que. 132 S is the incentre of .6.PQR. If LPSR = 125°, then the measme of LPQR is:
I. 75°
2. 55°
3. 80°
4. 70°
Que. 133 The graph of the equations 5x- 2y + 1 = 0 and 4y- 3x + 5 = 0, intersect at the point p(a, p). What is the
value of (2a - 3P)?
I. -3
2. 6
3. -4
4. 4
Que.134 The bisector of LA is LiABC meets BC in D. If AB= 15 cm, AC= 13 cm and BC= 14 cm, then DC=?
I. 6.5 cm
2. 8 cm
3. 7.5 cm
4. 8.5 cm
Que. 135 In a LiABC. D is point on BC. AB is produce to E and AC is produce to F. A circle is passes through
DEF, where AB= 10 cm, AC= 8.6 cm and BC= 6.4, then BE=?
I. 3.5 cm
2. 3.2 cm
3. 2.5 cm
4. 2.2 cm
Que. 136 Two parallel chords on the same side of the centi·e of a circle are 12 cm and 20 cm long and the radius of
the circle is 5✓13 cm. What is the distance (in cm) between the chords?
(27)
I. 2
2. 3
3. 2.5
4. 1.5
Que. 137 In quadrilateral ABCD, LC = 72° and LD = 28°. The bisectors of LA and LB meet in 0. What is the
I. 50°
2. 36°
3. 48°
4. 54°
Que.138
I. 3
2. 6
3. 4
4. 2
measure of LAOB?
What is the area (in square units) of the triangular region enclosed by the graphs of the equations x + y =
3, 2x + 5y = 12 and the x - axis?
Que. 139 The sides of a ti·iangle are 12 cm, 35 cm and 37 cm. What is the circumradius of the ti·iangle?
I. 19 cm
2. 17.5 cm
3. 17 cm
4. 18.5 cm
Que. 140 In D.PQR, LQ > LR, PS is the bisector of LP and PT .l QR. If LSPT = 28° and LR = 23° , then the
I. 89°
2. 82°
3. 79°
4. 74°
Que.141
I. 56°
2. 48°
3. 54°
4. 68°
measure of L Q is
In D.ABC, D and E are the points on AB and AC respectively such that AD x AC = AB x AE. If LADE =
LACB + 30° and LABC = 78°, then LA = ?
(28)
Que. 142 If in LiABC, D and E are the points on AB and BC respectively such that DEIIAC, and AD : AB= 3 : 8,
then (area of LiBDE) : (area of quadrilateral DECA) =?
I. 9: 64
2. 9: 55
3. 8: 13
4. 25: 39
Que. 143 The graphs of the equations 2x + 3y = 11 and x - 2y + 12 = 0 intersects at P(xi, y1) and the graph of the
I. 13
2. -11
3. 15
4. -9
equation x-2y + 12 = 0 intersects the x-axis at Q(x2, y2). What is the value of (x 1 -x2 + y1 + y2)?
Que. 144 The sides of a ti·iangle are 56 cm, 90 cm and 106 cm. The circlllllference of its circlllllcircle is:
I. 1121t
2. 108 1t
3. 1061t
4. 1091t
Que. 145 The point of intersection of the graphs of the equation 3x- 5y = 19 and 3y- 7x + 1 = 0 is P(a, p). What is
I. -1
2. -2
3. 0
4. 1
the value of (3a - P)?
Que. 146 LiABC and LiDBC are on the same base BC but on opposite sides of it. AD and BC intersect each other
perpendicularly at 0. If AO= a cm, DO= b cm and the area of LiABC = x cm2, then what is the area (in
cm2) of LiDBC?
J. bx
2.
3.
4.
a
l.x
b
ab
x
2
a+b
X
2
Que. 147 In a quadrilateral ABCD, the bisectors of LC and LD meet at E. If LCED = 56° and LA = 49°, then the
measure of LB is:
I. 54°
2. 67°
(29)
3. 71°
4. 63°
Que.148 In D-ABC, AB= AC and D is a point on BC. IfBD = 5 cm, AB= 12 cm and AD= 8 cm, then the length
of CD is:
I. 16 cm
2. 16.2 cm
3. 14.8 cm
4. 14 cm
Que.149 In a circle, AB and DC are two chords. When AB and DC are produced, they meet at P. If PC= 5.6 cm,
PB= 6.3 cm and AB= 7.7 cm, then the length of CD is:
I. 9 cm
2. 9.25 cm
3. 8.35 cm
4. 10.15 cm
Que. 150 In D.PQR, I is the in-centre of the triangle. If LQIR = 107°, then what is the measure of LP?
I. 73°
2. 43°
3. 34°
4. 37°
Que. 151 The bisector of LB in D.ABC meets AC at D. If AB= 10 cm, BC= 11 cm and AC= 14 cm, then the
I. 7 cm
length of AD is:
2. 22/3 cm
3. 20/3 cm
4. 6 cm
Que. 152 In a circle with centi·e 0, AC and BD are two chords. AC and BD meet at E when produced. If AB is the
diameter and LAEB = 68°, then the measure of LDOC is:
I. 22°
2. 30°
3. 44°
4. 32°
Que. 153 The perimeters of two similar triangles ABC and PQR 78 cm and 46.8 cm. respectively. If PQ = 11. 7 then
the length of AB is:
I. 24 cm
(30)
2. 19.5 cm
3. 23.4 cm
4. 20 cm
Que. 154 The Slllll of the interior angles of a regular polygon is 1260°. What is the difference between an exterior
I. 100°
2. 120°
3. 105°
4. 90°
angle and an interior angle of the polygon?
Que. 155 In D-ABC, the pe1pendiculars are drawn from A, B and C to meet the opposite sides at D, E and F,
respectively AD, BE and CF intersect at point p. If LEPD = 116° and the bisectors of LA and LB meet at
Q, then the measure of LAQB is:
I. 96°
2. 64°
3. 124°
4. 122°
Que.156
I. 22°
2. 49°
3. 23°
4. 41°
The sides PQ and PR of D.PQR are produced to point S and T, respectively. The bisectors of LSQR and
LTRQ meet at U. If LQUR = 79° then the measure of LP is:
Que. 157 In D-ABC, the medians AD, BE and CF meet at 0. What is the ratio of the area of D-ABD to the area of
I. 2: 1
2. 3: 2
3. 5: 2
4. 3: 1
D.AOE?
Que. 158 A circle is inscribed in quadrilateral ABCD touching AB, BC, CD and AD at the points P, Q, R and S,
respectively, and LB= 90°. If AD= 24 cm, AB= 27 cm and DR= 6 cm, then what is the circumference
of the circle?
J. l81t
2. 201t
3. 151t
4. 121t
(31)
Que.159
I. 4
2. -5
3. 5
4. 3
The graphs of the equations 3x + y- 5 = 0 and 2x -y- 5 = 0 intersect at the point P(a, 􀁙). What is the
value of (3a + 􀁙)?
Que.160 In D-ABC, AB= 6 cm, AC= 8 cm, and BC= 9 cm. The length of the median AD is:
I. ✓ 317 cm 2
2.
3.
4.
✓119cm 2
✓uscm 2
✓313cm 2
Que.161
I.
2. 148°
3. 136°
4. 116°
Que.162
I.
2. 112°
3. 109°
4. 123°
In quadrilateral ABCD, the bisectors of LA and LB meet at O and LAOB = 64°. LC+ LD is equal to:
128°
In D.ABC, LA= 58°. Ifl is the in-centi·e of the ti·iangle, then the measure of LBIC is:
119°
Que. 163 Chord AB of a circle is produced to a point P, and C is a point on that circle such that PC is a tangent to
the circle. If PC= 18 cm, and BP= 15 cm, then AB is equal to:
I. 8.5 cm
2. 6.2 cm
3. 5.8 cm
4. 6.6 cm
Que. 164 The sides of a ti·iangle are 11 cm, 60 and 61 cm. What is the radius of the circle circumscribing the
u-iangle?
I. 31 cm
2. 30 cm
3. 30.5 cm
4. 31.5 cm
(32)
Que. 165 A circle is inscribed in .6.ABC, touching AB, BC and AC at the points P, Q and R respectively. If AB -
BC= 4 cm, AB - AC= 2 cm and the perimeter of .6.ABC = 32 cm, then PB+ AR is equal to:
1. 12 cm
2. 13 cm
3. 33/5 cm
4. 38/3 cm
Que. 166 The graph of the equation x- 7y = -42 intersects the y-axis at P(a, 􀁝) and the graph of 6x + y- 15 = 0,
1. 6
2. 17/2
3. 9/2
4. 5
Que.167
1. 34°
2. 33°
3. 32°
4. 38°
intersects the x-axis at Q(y, o) what is the value of a+􀁝+ y + o?
The sides AB and AC of .6.ABC are produced to P and Q respectively. The bisectors of L CBP and LBCQ
meet at R. If the measure of LA = 44° , the find the measure of LBRC/2.
Que. 168 In a trapezium ABCD, DC II AB, AB= 12 cm and DC= 7.2cm. What is the length of the line segment
joining the mid-points of its diagonals?
1. 4.8 cm
2. 2.4 cm
3. 3.6 cm
4. 2.6 cm
Que.169
1s:
1. 138°
2. 132°
3. 154°
4. 124°
In .6.ABC, LA= 52° and O is the orthocentre of the triangle (BO and CO meet AC and AB at E and F
respectively when produced). If the bisectors of LOBC and LOCB meet at P, then the measure of L BPC
Que. 170 In .6.ABC, D is a point on side BC such that LADC = LBAC. If CA = 12 cm, CD = 8 cm, then CB is
equal to:
1. 18 cm
(33)
2. 12 cm
3. 16 cm
4. 15 cm
Que. 171 In D.ABC, D and E are the points on sides AB and BC respectively such that DEii AC. If AD: DB= 5 : 3,
J. 1 : 6
then what is the ration of the area of D.BDE to that of the trnpezium ACED?
2. 4: 25
3. 9: 55
4. 9: 64
Que. l 72 If each interior angle of a regular polygon is (128..i) 0
, then what is the sum of the number of its diagonals
and the number of its sides?
7
J. 17
2. 19
3. 21
4. 15
Que.173
be:
I. 15.6
2. 15.2
3. 14.2
4. 14.8
The base of the right prism is a trnpezium whose parallel sides are 11 cm and 15 cm and the distance
between them is 9 cm. If the volume of the prism is 1731.6 cm3 , then the height (in cm) of the prism will
Que. 174 PQRS is a cyclic quadrilateral in which PQ = 14.4 cm, QR= 12.8 cm and SR= 9.6 cm. If PR bisects QS,
what is the length of PS?
I. 16.4 cm
2. 13.6 cm
3. 19.2 cm
4. 15.8 cm
Que. 175 In D.ABC, AB = 7, BC = 10 cm, and AC = 8 cm. If AD is the angle bisector of LBAC, where D is a point
on BC, then BD is equal to:
I. 16/3 cm
2. 17/4 cm
3. 15/4 cm
4. 14/3 cm
(34)
Que. 176 In 􀁒ABC, LA= 52°. Its side AB and AC are produced to the points D and E respectively. If the bisectors
I. 106°
2. 64°
3. 16°
4. 32°
Que.177
I. 72°
2. 36°
3. 18°
4. 24°
of the LCBD and LBCE meet at point 0, then LBOC is equal to:
ABCD is a cyclic quadrilateral such that AB is a diameter of the circle circumscribing it and angle ADC
= 126°. LBAC is equal to:
Que. 178 A regular hexagon is inscribed in a circle. Find the ratio of area of circle to the area of that po1tion which
is not covered by the hexagon?
I. 21t/(21t - 3✓3)
2. 1t!(1t - 3✓3)
3. 21tl✓3
4. 1t!✓3
Que. 179 In a 􀁒ABC, AD is pe1pendicular to BC from A. if LBAC = 90°, then AB2
: AC2 is equal to:
I. BD2
: CD2
2. CD :BD
3. cD2
: BD2
4. BD : CD
Que. 180 Two circles of diameters 4.8 cm and 8 cm are such that the distance between their centres is 6.5 cm. What
is the length of a common tangent to the circles that does not intersect the line joining the centres?
I. 6.3 cm
2. 6.1 cm
3. 6.2 cm
4. 6.0 cm
Que. 181 The point A of a triangle ABC moves parallel to the straight-line BC. Which one among the following
also moves along a straight line parallel to BC?
(a) The circumcenter (b) the centroid (c) the incentre (d) the 01thocenter.
I. (d)
2. (b)
3. (c)
(35)
4. (a)
Que. 182 The chord of the contact of tangents drawn from a point on the circle x2 + y2 = a2 to the circle x2 + y2
=
b2 touches the circle x2 + y2
= c2 such that bP = amen, where m, n, p E: N, and m, n, p are prime to each
other, then the value of m + n + p + 3 is:
I. 2
2. 6
3. 5
4. 7
Que. 183 In ti·iangle ABC, the length of BC is less than twice length of AB by 3 cm. The length of AC exceeds the
length of AB by 9 cm. The perimeter of ti·iangle is 34 cm. The length (in cm) of the smallest side of the
ti·iangle is:
I. 9
2. 7
3. 10
4. 8
Que.184
I. 84°
2. 156°
3. 66°
4. 132°
In a 􀁚ABC, the bisectors of LB and LC meet at point O within the ti·iangle. 0 is the incenti·e of 􀁚ABC. If
LA = 132° , then the measure of LBOC is:
Que. 185 The ratio of the areas of two ti·iangles ABC and PQR is 4 : 5 and the ratio of their heights is 5 : 3. The
ratio of the bases of u-iangle ABC to that of ti·iangle PQR is:
I. 15 : 11
2. 11 : 15
3. 12: 25
4. 25 : 12
Que. 186 A circle is inscribed in a ti·iangle ABC. It touches sides AB, BC and AC at the points P, Q and R
I. 36
2. 37.6
3. 37
respectively. IfBP = 5.4 cm, CQ = 7.3 cm and AR= 6.1 cm, then the perimeter (in cm) of the MBC is:
4. 37.25
Que. 187 In a circle with center 0, AB is a diameter. Points C, D and E are on the circle on one side of AB such
(36)
I. 240°
2. 270°
3. 180°
4. 225°
Que.188
that ABEDC is a pentagon. The sum of angles ACD and BED is.
A
In MBC, Dis a point on BC such that, LBAC = 87° and LC = 42°. What is the measure of LABD?
I. 94°
2. 68°
3. 51 °
4. 102°
Que. 189 ABCD is a cyclic quadrilateral such that its sides AD and BC produced meet at P and sides AB and DC
I. 32°
2. 38°
3. 44°
4. 23°
produced meet at 0. If LA = 62° and LABC = 74°, then the difference between LP and LO is:
Que. 190 Let .6.ABC ~ .6.QPR and ar(MBC)/ar(.6.PQR) = 4/25. If AB= 12 cm, BC= 8 cm and AC= 10 cm, then
I. 30
2. 20
3. 18
4. 15
QP is equal to:
Que. 191 The distance between the centers of two circles of radius 6 cm each is 13 cm. the length (in cm) of a
I. 10
2. 5
3. 6
4. 12
transverse common tangent is:
(37)
Que.192
I. 32°
2. 16°
3. 54°
4. 106°
Que.193
I. 18°
2. 24°
3. 72°
4. 56°
In 􀁏ABC, LA= 72°. Its sides AB and AC are produced to the points D and E respectively. If the
bisectors of the L CBD and LBCE meet at point 0, then LBOC is equal to:
ABCD is a cyclic quadrilateral such that AB is a diameter of the circle circumscribing it and angle ADC
= 146°. LBAC is equal to:
Que. 194 􀁏ABC is ti·iangle, where LB is obtuse angle. AD is perpendicular on CB produced at D. If AB= 8 cm,
BC= 7 cm and BD = 4 cm, then AC is equal to:
I. 15 cm
2. 13 cm
3. 14 cm
4. 12 cm
Que.195
I. 40°
2. 38°
3. 50°
4. 68°
ABCD is a cycle quadrilateral such that AB is a diameter of the circle circumscribing it and LADC =
158° . Then LBAC is equal to:
Que. 196 Two circles of radii 7 cm and 9 cm intersect at the point A and B. If AB = 10 cm and the distance
between the centers of the circles is x cm, then the value of xis:
I. 2(✓6 + ✓7)
2. (✓6 + ✓7)
3. (✓6 + ✓14)
4. 2(✓6 + ✓14)
Que. 197 What is the area of a rhombus (in cm2) whose side is 20 cm and one of the diagonals is 24 cm?
I. 350
2. 396
3. 392
4. 384
(38)
Que. 198 The vertices A, B, C and D of a quadrilateral ABCD lie on a circle. LA is thrice LC and LD is twice LB.
I. 18°
2. 15°
3. 20°
4. 28°
Que.199
I. 20
2. 15
3. 17.5
4. 18
Que. 200
I. 18°
2. 72°
3. 24°
4. 36°
Que. 201
I. 106°
2. 84°
3. 32°
4. 16°
What is the difference between the measmes of LB and LC?
Let 􀁕ABC ~ 􀁕 PQR and ar(􀁖C)/ar(􀁕PQR) =4/25. If AB = 12 cm, BC = 8 cm and AC = 9 cm, then
QR is equal to:
PA and PB are the tangents to a circle with center O, from a point P outside the circle. A and B are the
points on the circle. If LAPB = 72°, then LOAB is equal to:
In 􀁕ABC, the bisectors of LB and LC meet at 0, inside the ti·iangle. If LBOC = 106°, then the measme
of LA is:
Que. 202 AB and CD are two chords of a circle which intersect at a point O inside the circle. It is given that, AB =
10 cm, CO= 1.5 cm and DO= 12.5 cm. What is the ratio between the larger and smaller among AO and
BO?
I. 7 : 3
2. 4: 1
3. 3 : 1
4. 3 : 2
Que. 203 The distance between the centers of two circles of radius 3 cm and 2 cm is 13 cm. The length (in cm) of a
h'ansverse common tangent is:
I. 10
2. 8
(39)
3. 12
4. 6
Que. 204 LiABC ~ LiDEF and their perimeters are 64 cm and 48 cm respectively. What is the length AB, if DE is
equal to 9 cm?
I. 16 cm
2. 12 cm
3. 17.5 cm
4. 18 cm
Que. 205 During a practice session in a stadium an athlete mns along a circular track and her perfo1mance is
observed by her coach standing at point on the circle and also by her physiotherapist standing at the
centre of the circle. The coach finds that she covers an angle of 72° in 1 min. what will be the angle covered by her in
1 second according to the measurement made by her physiotherapist?
I. It depends on the position of the coach on the circular track
2. 1.2°
3. 4.8°
4. 2.4°
Que. 206 0, G, I and Hare respectively the circumcentre, centroid, incentre and 01ihocentre of an equilateral
triangle. Which of these points are identical?
I. 0 and I only
2. 0 and G only
3. 0, G, I and H
4. 0, G and H only
Que. 207 Two chords AB and CD of a circle intersect at a point O inside the circle. It is given that AO = 1 cm, AB
I. 3 : 1
2. 5: 3
3. 9: 7
= 13 cm, CD= 8 cm. what is the ratio between the larger and smaller section among CO and OD?
4. 11 : 5
Que. 208 In a stadium an athlete is mnning on a circular path with unifo1m speed during a practice session. The
angle covered by him during one second is found to be 10° by coach observing him from the centre of the
circular track. What would be the measure of angle (in degree) described by the athlete by an observer standing on
the circle?
I. it depends on the exact position of the observer on the circle
2. 20
3. 10
4. 5
(40)
Que. 209 In a triangle ABC, PQ is a strnight line parallel to AC, such that Area ABC : Area PBQ = 3 : 1 Then CB :
CQ is equal to:
I. ✓3(✓3 - 1) : 2
2. ✓3: 2
3. ✓3-2 : 2
4. ✓3(✓3 + 1): 2
Que. 210 The circumcentre, incentre, orthocenti·e and the centi·oid of a ti·iangle are one and the same point. The
triangle must be:
(a) isosceles (b) right-angled (c) right-angled isosceles (d) equilateral
I. (b)
2. (d)
3. (c)
4. (a)
Que. 211 The chord of the contact of tangents drawn from a point on the circle x2 + y2 = a2 to the circle x2 + y2 =
b2 touches the circle x2 + y2 = c2 such that bm = ancP, where m, n, p E: N and m, n, p, are prime to each
other, then the value of m + n + p - 3 is:
I. -1
2. 2
3. 0
4. 1
Que. 212 If one of the angles of a ti·iangle is 64°, then the angle between the bisectors of the other two interior
I. 100°
2. 122°
3. 96°
4. 112°
angles is:
Que. 213 In a 􀁔ABC, the bisectors of LB and LC meet at point O within the ti·iangle. If LA= 116° , then the
I. 116°
2. 148°
3. 85°
4. 74°
measure of LBOC is:
Que. 214 The ratio of the areas of two ti·iangles ABC and PQR is 3 : 5 and the ratio of their heights is 5 : 3. The
ratio of the bases of triangle ABC to that of ti·iangle PQR is:
(41)
I. 2: 1
2. 1 : 1
3. 25: 9
4. 9: 25
Que. 215 A circle is inscribed in a ti·iangle ABC. It touches sides AB, BC and AC at the points P, Q and R
respectively. IfBP = 5 cm, CQ = 7 cm and AR= 6 cm, then the perimeter (in cm) of the LiABC is:
I. 37.25
2. 35
3. 37.5
4. 36
Que. 216
I. 45°
2. 60°
3. 30°
4. 40°
In a circle with centi·e 0, ABCD is a cyclic quadrilateral with AB as a diameter of the circle. AD and BC
produced to meet at E such that AE =BE.If LCED = 7 0°, then what is the measure of LC0D?
Que. 217 If LiABC ~ .6.QPR, Area LiABC : Area .6.PQR = 9: 16. If AB = 12 cm, BC = 6 cm and AC = 9 cm, then
QR is equal to:
I. 12 cm
2. 16 cm
3. 8cm
4. 9cm
Que. 218 A rectangle ABCD is inscribed in a circle with centi·e 0. Its diagonal CA is produced to a point E, outside
the circle. ED is a tangent to the circle at D. If AC = 2BC, then what is the measure of LDEC?
I. 30°
2. 60°
3. 40°
4. 45°
Que. 219 A LiABC, D and E are the points on sides AB and AC, respectively, such that DE II BC. IfDE : BC is 3 :
I. 5 : 8
2. 3: 4
5, then (Area of LiADE): (Area of quadrilateral DECB) is:
3. 9: 16
4. 9: 25
(42)
Que. 220 Two concenti·ic circles are of radii 15 cm and 9 cm. What is the length of the chord of the largest circle
which is tangent to the smaller circle?
I. 18 cm
2. 25 cm
3. 24 cm
4. 20 cm
Que. 221 Two circles of radii 15 cm and 12 cm intersect each other, and the length of their common chord is 18
cm. What is the distance (in cm) between their centers?
I. 18+ ✓ 7
2. 12 + 3✓ 7
3. 12 + 2✓ 7
4. 15 + ✓ 7
Que. 222
I.
2. 4: 9
3. 2: 3
4. 2: 5
Que. 223
I. 28°
2. 26°
3. 24°
4. 25°
If in 􀁊ABC, D is a point on BC, such that BD : BC= 2 : 5, what is the ratio area(􀁊ABD) : area(􀁊ADC)?
1 : 2
In a circle, chords AD and BC meet at a point E outside the circle. If LBAE = 76° and LADC = 102°,
then LAEC is equal to:
Que. 224 In 􀁊ABC, LABC = 90° and BD .l AC. If AD = 4 cm add CD = 5 cm, then BD is equal to:
I. 4✓5 cm
2. 3✓2 cm
3. 3✓5 cm
4. 2✓5 cm
Que. 225 A quadrilateral ABCD is inscribed in a circle with centi·e 0. If LBOC = 92 ° and LADC = 112°, then
I. 22°
2. 28°
3. 26°
4. 24°
LABO is equal to:
(43)
Que. 226 The side BC of a right - angled ti·iangle ABC (LABC = 90°) is divided into four equal palis at P, Q and R
I. - 3/4
2. - 1/8
3. 3/4
4. 1/8
respectively. If A P2 + AQ2 + AR2 = 3b2 + 17 na2
, then n equal to:
Que. 227 A and Sare two points on a circle with cenh'e 0. AT is a tangent, such that LSAT = 45°. N is a point on
OA, such that SN= 10 cm. The length of the median OM of .6.SON is:
I. 53 cm
2. 5 cm
3. 102 cm
4. 52 cm
Que. 228 It is given that .6.ABC ~ .6.PRQ and that Area ABC: Area PRQ = 16: 169. If AB= x, AC= y, BC= z (all
in cm), then PQ is equal to:
I. 13x/4
2. 13z/4
3. 13x/8
4. 13y/4
Que. 229 There is a polygon of 11 sides. How many ti·iangles can be drawn by only using the ve1iices of the
I. 165
2. 175
3. 150
4. 180
Que. 230
I. 7
2. 8
3. 6
4. 5
polygon?
Chords AB and CD of a circle intersect externally at P. If AB= 6 cm, CD= 3 cm and PB= 4 cm, then the
length (in cm) of PC = ?
Que. 231 If in a .6.ABC, the bisectors of LB and LC meet at 0, inside the u-iangle. If LBOC = 156°, then the
I. 156°
2. 132°
3. 66°
measure of LA is:
(44)
4. 84°
Que. 232 OABC is a quadrilateral, where O is the centre of a circle and A, B, C are points in the circle, such that
I. 3 : 1
2. 3: 2
3. 2: 1
4. 4: 1
Que. 233
I. 10
2. 4
3. 8
4. 6
LABC = 120°. What is the ratio of LAOC to the LOAC?
The distance between the centers of two circles of radii 4 cm, and 2 cm is 10 cm. The length (in cm) of a
transverse common tangent is:
Que. 234 A circle is inscribed in a ti·iangle ABC. It touches side AB, BC and AC at the points P. Q and R
I. 49.5
2. 35
3. 39
4. 33
respectively. If BP= 8.5 cm, CQ = 6.5 and AR= 4.5 cm, then the perimeter (in cm) of the D.ABC is:
Que. 235 In a D.ABC, the bisectors of LB and LC meet at point O within the ti·iangle. If LBOC is given, then which
among the given options is hue?
I. LA = 2 (LBOC - 90°)
2. LA = 180° - LBOC
3. LA = 90° + LBOC
4. LA = 2(90° - LBOC)
Que. 236
I. 15
2. 14
3. 10
4. 12
Two circles of radii 7 cm and 9 cm intersect at the points A and B. If AB= 6 cm and the distance between
the centers of the circles is x cm, then the value of x (to the closest integer) is:
Que. 237 Two circles of radii 5 cm and 8 cm intersect at the points A and B. If AB = 8 cm and the distance between
the centi·es of two circles is x cm, then the value of x (to the closest integer) is:
J. 8
(45)
2. 10
3. 9
4. 11
Que. 238 In a LiABC, the bisectors of LB and LC meet at point O within the triangle . If LA is given , then which
among the given options is hue?
I. LBOC = 90° + (LA/2)
2. LBOC = 180° - (LA/2)
3. LBOC = 90° - (LA/2)
4. LBOC = 180° - (LA)
Que. 239 A circle is inscribed in a ti·iangle ABC. It touches sides AB, BC and AC at the points P, Q and R
respectively . If BP= 65. c m , CQ = 45. c m and AR= 5.5 cm, then the perimeter (in cm ) of the ti·iangle
LiABC is:
I. 16.5
2. 66
3. 33
4. 22
Que. 240 Let LiABC ~ LiQPR and ar (LiABC) : ar (LiPQR) = 9 : 4. If AB= 9 cm, BC= 6 cm and AC= 12 cm then
QR is equal to:
J. 8 cm
2. 12 cm
3. 9cm
4. 16 cm
Que. 241 In ti·iangle ABC, D and E are two points on the side AB and AC respectively so that DE II BC and
ADIBD = 3/4. The ratio of the area ofti·apezium DECB to the area of LiABC is:
I. 49: 33
2. 49: 40
3. 40: 49
4. 33: 49
5. none of these
Que. 242 Let ABC~ QPR and ar ABC: ar PQR = 1 : 16. If AB= 12 cm, BC= 6 cm and AC= 9 cm then PR is
equal to:
I. 12 cm
2. 9cm
3. 36 cm
4. 8cm
(46)
Que. 243 In D-ABC, D is a point on side AB such that BD = 2 cm and DA = 3 cm. E is a point on BC such that DE
J. 1 : 5
II AC, and AC = 4c m. Then (Area of D-BDE):( Area of trapezium ACED) is:
2. 4: 21
3. 4: 25
4. 2: 5
Que. 244 The area of a field in the shape of a regular hexagon is 240 0✓ 3 m2. What will be the cost of fencing it at
Rs. 18.50 per meter?
I. Rs. 518 0
2. Rs. 5550
3. Rs. 4440
4. Rs. 5920
Que. 245
I. 78°
2. 68°
3. 72°
4. ggo
In D.ABC, BD .l AC.E is a point on BC such that LBEA = x0
• If LEAC = 38° and LEBD = 40°, then the
value of x is:
Que. 246 PQRS is a cyclic quadrilateral. If LP is four times LR and LS is three LQ, then the sum of LQ and LR is:
I. 73°
2. 77°
3. 8 1°
4. 86°
Que. 247 It is given the area of a ti·iangle is A. The value of its perimeter, imadius, circmmadius and the average of
the lengths of the medians are P. r. R and d respectively. The ratio A : P is equal to
I. r: 1
2. (R + r)2 :d
3. r :2
4. (R- r)2 : r
Que. 248 ABCDEFGH is a regular octagon inscribed in a circle with centi·e at 0. The ratio of L OAB to LAOB is
equal to:
I. 4: 3
2. 3: 1
3. 3: 2
(47)
4. 8 : 3
Que. 249 Two circles of diameters 2 cm and 5.6 cm are such that the distance between their centers is 8.2 cm. What
J. 8 cm
is the length of a common tangent to the circles that does not interest the line joining the centers?
2. 6.4 cm
3. 7.2 cm
4. 8.4 cm
Que. 250 Equilateral triangles are drawn on the hypotenuse and one of the perpendicular sides ofright-angled
isosceles triangles. Their areas are Hand A respectively.A/His equal to:
I. 11✓2
2. 112✓2
3. 1/2
4. 1/4
Que. 251 Two chords, AB and CD of circle meet at a point 0, outside the circle. It is given that AB = 7 cm, CD = 4
cm, OB = 5 cm. What is the length of OD?
I. 5 cm
2. 6 cm
3. 7.5 cm
4. 10 cm
Que. 252 In ti·iangle ABC, the length of BC is less than twice the length of AB by 3 cm. The length of the AC
exceeds the length of AB by 1 cm. The perimeter of the ti·iangle is 34 cm. The length (in cm) of the
smaller side of the ti·iangle is:
I. 9
2. 10
3. 7
4. 8
Que. 253 In a 􀁇ABC, the bisectors of LB and LC meet at O within the ti·iangle. If LA = 110°, then the measure of
I. 145°
2. 84°
3. 110°
4. 55°
LBOC is:
Que. 254 In a circle with center 0, diameter AB and a chord CD intersect each other at E, AC and AD are joined. If
(48)
I. 74°
2. 72°
3. 82°
4. 78°
LBOC = 48° LAOD = 100°, then what is the measure of LCEB?
Que. 255 Let 􀁐ABC~ 􀁐QPR and [ {ar(􀁐ABC)/(ar􀁐QPR)} = (9/4)]. If AB= 12 cm, BC= 6 cm and AC= 9 cm,
then QR is equal to:
I. 15 cm
2. 9 cm
3. 6 cm
4. 12 cm
Que. 256
I. 45
2. 40.5
3. 50
4. 54
In a 􀁐ABC, D and E are two points on side AB and BC, respectively such that AD : DB = 2 : 3 and DE II
AC. If the area of 􀁐BDE is equal to 18 cm2, then what is the area(in cm2) of 􀁐ABC?
Que. 257 In 􀁐ABC, AD is the bisector of LBAC, meeting BC at D. If AC = 21, BC = 12 cm and the length ofBD
is 2 cm less than DC, then the length of side AB is:
I. 14 cm
2. 18 cm
3. 15 cm
4. 10 cm
Que. 258 In 􀁐ABC, AD .l BC at D and AE is the bisector of LA If LB= 72° and LC= 26°, then what is the
I. 25°
2. 23°
3. 49°
4. 37°
measure of LDAE?
Que. 259 Let 􀁐ABC~ 􀁐QPR and arABC = arPQR = 914. If AB= 12 cm, BC= 6 cm and AC= 9 cm, then QP is
I. 9 cm
2. 8 cm
equal to:
3. 16 cm
4. 12 cm
(49)
Que. 260 In a circle, AB and CD interest each other at E. If CD = 18 cm and AE = 18 cm, ED = 6 cm, then BE = ?
I. 3 cm
2. 4 cm
3. 8 cm
4. 6 cm
Que. 261
I.
In D-ABC, LA= 90° . IfBL and CM are the medians, then:
3(BL2 + CM2) = 4BC2
2. 4(BL2 + CM2) = 3BC2
3. 5(BL 2 + CM2) = 4BC2
4. 4(BL2 + CM2) = 5BC2
Que. 262 A circle is inscribed in a quadrilateral ABCD, touching sides AB, BC, CD and DA at P, Q, R and S,
respectively. If AS= 8 cm, BC= 11 cm, and CR= 5 cm, then the length AB is equal to:
I. 14 cm
2. 13 cm
3. 16 cm
4. 12 cm
Que. 263 If two equal circles whose centres are 0 and 0' intersect each other at the point A and B, 00' = 12 cm
and AB = 16 cm, then radius of the circle is:
I. 15 cm
2. 10cm
3. 14 cm
4. 12 cm
Que. 264
I.
2. 3
3. 4
4. l
Que. 265
I. 17
2. 15
3. 25
4. 21
A unique circle can always be drawn through x number of given non - collinear points, then x must be:
2
Side AB of a triangle ABC is 80 cm long, whose perimeter is 170 cm. If angle ABC = 60°, the sho1iest
side of triangle ABC measures ___ cm.
(50)
Que. 266 The unequal side of an isosceles ti·iangle is 2 cm. The medians drawn to the equal sides are pe1pendicular.
The area of the ti·iangle is:
I. 2 cm2
2. 3 cm2
3. 5 cm2
4. 1 cm2
Que. 267 ABCD is a cyclic quadrilateral such that AB is a diameter of the circle circlllllscribing it and LADC =
I. 60°
2. 150°
3. 54°
4. 40°
144°. Then LBAC is equal to: (-n = 2;)
Que. 268 PA and PB are two tangents to a circle with centi·e 0, from a point P outside the circle. A and Bare points
I. 25°
2. 35°
3. 20°
4. 76°
Que. 269
I. 35°
2. 70°
3. 25°
4. 20°
Que. 270
I. 60°
2. 40°
3. 52°
4. 50°
on the circle. If L0AB = 38°, then LAPB is equal to:
PA and PB are two tangents to a circle with centi·e 0, from a point P outside the circle. A and B are points
on the circle. If L0AB = 35°, then LAPB is equal to:
ABCD is a cyclic quadrilateral such that AB is a diameter of the circle circlllllscribing it and LADC =
142°. LBAC is equal to:
Que. 271 A square cardboard with side 3 m is folded through one of its diagonal to make a u-iangle. The height of
the pe1pendicular drawn to the hypotenuse of the ti·iangle is:
I. 3/✓2 Ill
(51)
2. 2✓3 Ill
3. 3✓2 Ill
4. 2/✓3 Ill
Que. 272 PA and PB are two tangents to a circle with centre 0, from a point P outside the circle. A and B are points
I. 25°
2. 20°
3. 35°
4. 50°
on the circle. If LAPB= 100° , then L0AB is equal to:
Que. 273 If the area of a regular hexagon is 108✓3 cm2
, its perimeter is:
I. 24 cm
2. 36✓2 cm
3. 28✓3 cm
4. 42✓3 cm
Que. 274 ABCD is a cyclic quadrilateral such that AB is a diameter of the circle circumscribing it and LADC =
I. 60°
2. 58°
3. 40°
4. 150°
Que. 275
I. 43°
2. 45°
3. 50°
4. 20°
148°. LBAC is equal to:
PA and PB are two tangents to a circle with center 0, from a point P outside the circle. A and B are points
on the circle. If LAPB = 86° , then L0AB is equal to:
Que. 276 ABCD is a cyclic quadrilateral such that AB is a diameter of the circle circumscribing it and LADC =
I. 20°
2. 30°
3. 60°
4. 35°
125° then LBAC is equal to:
Que. 277 In the triangle given below, D and E are mid points of AF and AG respectively, F and Gare mid points of
AB and AC respectively. IfDE = 2.4 cm, then BC is equal to:
(52)
A
B C
I. 9.6 cm
2. 7.2 cm
3. 4.8 cm
4. 3.6 cm
Que. 278 PA and PB are two tangents to a circle with centre 0, from a point P outside the circle. A and B are points
I. 35°
2. 50°
3. 25°
4. 20°
Que. 279
I. 50°
2. 60°
3. 150°
4. 40°
on the circle. If LAPB = 70° , then L0AB is equal to:
ABCD is a cyclic quadrilateral such that AB is a diameter of the circle circumscribing it and LADC =
130°. Then LBAC is equal to:
Que. 280 ABCD is a cyclic quadrilateral such that AB is a diametre of the circle circumscribing it and LADC =
160° . What is the measme of the LBAC?
I. 65°
2. 60°
3. 70°
4. 75°
Que. 281 In 􀁁ABC, LA= 70°. AB and AC are produced to points D and E respectively. If the bisectors of LCBD
I. 95°
2. 105°
3. 70°
4. 55°
and LBCE meet at the point 0, then LB0C is equal to:
Que. 282 PA and PB are two tangents from a point P outside the circle with centi·e O. If A and B are points on the
(53)
I. 35°
2. 70°
3. 55°
4. 45°
Que. 283
I.
circle such that LAPB = 110°, then LOAB is equal to:
One side of a rhombus is 6.5 cm and one of its's diagonal is 12 cm. What is the area of the rhombus?
60cm2
2. 15 cm2
3. 30 cm2
4. 78 cm2
Que. 284
I.
2. 90°
3. 70°
4. 110°
In D.ABC, LA = 40°. If the bisectors of the LB and LC, meet at a point 0, then LBOC is equal to:
130°
Que. 285 Suppose D.ABC ~ D.RPQ and ar(MBC) ar(􀀈PQR) = .l4 If PQ = 4 cm, QR= 6 cm and PR= 7 cm, then AC is equal
to:
I. 2 cm
2. 4 cm
3. 3 cm
4. 3.5 cm
Que. 286
I. 35°
2. 65°
3. 45°
4. 55°
From a point P outside the circle with centre 0, two tangents PA and PB are drawn to meet the circle at A
and B respectively. If LAPB = 70°, then LOAB is equal to:
Que. 287 ABCD is a cyclic quadrilateral such that AB is the diameter of the circle circumscribing it and LADC =
155°, then what is the measme of LBAC?
I. 35°
2. 55°
3. 65°
4. 45°
(54)
Que. 288 PA and PB are two tangents to a circle with centre 0, from a point P outside the circle. A and B are points
I. 25°
2. 50°
3. 20°
4. 40°
on the circle. If LOAB = 20°, then LAPB is equal to:
Que. 289 In the given figme, XYZ is an equilateral triangle, LXA Y = 40°, LXBZ = 30° then LAXB is equal to:
I. 110°
2. 60°
3. goo
4. 90°
Que. 290
I. 60°
2. 150°
3. 130°
4. 140°
Que. 291
I.
A
y
ABCD is a cyclic quadrilateral such that AB is a diameter of the circle circumscribing it and LBAC =
50°. Then LADC is equal to:
One side of rhombus is 13 cm and one of its diagonals is 24 cm. What is the area of the rhombus?
156 cm2
2. 120 cm 2
3. 130 cm2
4. 312 cm2
Que. 292
I. 45°
2. 40°
3. 55°
4. 50°
PA and PB are two tangents from a point P outside a circle with center O. If A and B are points on the
circle such that LAPB = go0
, then LOAB is equal to:
(55)
Que. 293 ABCD is a cyclic quadrilateral such that AB is the diameter of the circle circumscribing it and LADC =
145°. What is the measme of LBAC?
I. 40°
2. 50°
3. 35°
4. 55°
Que. 294 In ti ABC, LA= 30°. If the bisectors of the angle Band angle c meet at a point O in the interior of the
triangle, then L BOC is equal to:
I. 75°
2. 105°
3. 120°
4. 90°
Que. 295 Let tiABC ~ !iQPR and ar(MBC)
= 1
9
6, If AB= 12 cm, BC= 6 cm and AC= 9 cm, then PR is
ar (t.PQR)
I. 12 cm
2. 16 cm
3. 8cm
4. 9cm
Que. 296 ABCD is a cyclic quadrilateral such that AB is the diameter of the circle circumscribing it and LADC =
I. 51°
2. 39°
3. 61°
4. 49°
Que. 297
I. 25°
2. 40°
3. 20°
4. 50°
129°. Then, LBAC is equal to:
PA and PB are tangents to a circle with centre 0, from a point P outside the circle, and A and B are points
on the circle. If LAPB = 40°, then LOAB is equal to:
Que. 298 In a circle of radius 17 cm, a chord is at a distance of 15 cm from the centre of the circle. What is the
J. 8 cm
chord?
2. 15 cm
3. 16 cm
4. 12 cm
(56)
Que. 299
I. 72°
2. 66°
3. 68°
4. 440
In a circle with centi·e 0, an arc ABC subtends an angle of 136° at the cenu-e of the circle . The chord AB
is produced to a point P. Then L CBP is equal to:
Que. 300 .6.ABC ~ .6.EDF and ar(.6.ABC): ar(.6.DEF) = 1 : 4. If AB= 7 cm, BC= 8 cm and CA= 9 cm, then DF is
equal to:
I. 14 cm
2. 18 cm
3. 16 cm
4. 8 cm
Que. 301 In .6.ABC, Pis a point on BC such that BP: PC= 4: 5 and Q is the midpoint of BP, then ar(.6.ABQ):
J. 1 : 9
2. 2: 5
3. 1 : 3
4. 2: 9
ar( .6.ABC) is equal to:
Que. 302 .6.ABC ~ .6.NLM and ar(.6.ABC): ar(.6.LMN) = 4: 9. If AB= 6 cm, BC= 8 cm and AC= 12 cm, then ML
is equal to:
J. 18 cm
2. 6 cm
3. 9 cm
4. 12 cm
Que. 303
I. 70°
2. 55°
3. 60°
4. 65°
In a circle with centi·e 0, an arc ABC subtends an angle of 110° at the cenu-e of the circle . The chord AB
is produced to a point P. Then LCBP is equal to:
Que. 304 In .6.ABC, Pis a point on BC such that BP: PC= 4: 11. If Q is the midpoint of BP, then ar(.6.ABQ):
ar(ABC) is equal to:
I. 2: 15
2. 3: 13
(57)
3. 2: 13
4. 2: 11
Que. 305 In a circle of radius 17 cm, a chord is at a distance of 8 cm from the centre of the circle. What is the
length of the chord?
I. 20 cm
2. 25 cm
3. 15 cm
4. 30 cm
Que. 306 In a circle of radius 13 cm, a chord is at a distance of 5 cm from its centi·e. What is the length of chord?
I. 12 cm
2. 20 cm
3. 24 cm
4. 18 cm
Que. 307 LiABC ~ LiRQP and PQ = 10 cm, QR= 12 cm and RP= 18 cm. If ar(LiABC): ar(LiPQR) = 4/9, then AB
is equal to:
I. 12 cm
2. 20/3 cm
3. 8 cm
4. 9 cm
Que. 308 In LiABC, Pis a point on BC such that BP: PC= 3 : 4 and Qi s the midpoint ofB P . Then ar(LiABQ):
I. 3: 8
2. 2: 7
3. l : 4
ar( LiABC) is equal to:
4. 3: 14
Que. 309 In a circle with centi·e 0, an arc ABC subtends an angle of 132° at the center of the circle . Chord AB is
produced to point P. Then LCBP is equal to:
I. 76°
2. 68°
3. 66°
(58)
4. 48°
Que. 310 In a circle ofradius 13 cm, a chord is at a distance of 12 cm from the centre of the circle. What is the
I. 5 cm
2. 9 cm
length of the chord?
3. 10 cm
4. 7 cm