Que. 1 A train is moving at a speed of 56 km/hr covers a certain distance in 8 hours. If the same distance is to be
covered in 7 hours, then what will be the speed (in km/hr) of the train?
1. 64
2. 54
3. 48
4. 63
Que. 2 A man travelled a certain distance by train at the rate of 25 km/h and walked back at the rate of 4 km/h. If
the whole journey took 5 hours 48 minutes, then what was the distance travelled by train?
1. 25 km
2. 30 km
3. 20 km
4. 15 km
Que. 3 A train covers a distance from station A to station B at a uniform speed of 60 km/hr and returns to station A
at a uniform slower speed. If the average speed for the whole trip be 48 km/hr, what is the return speed of
the train?
1. 46.8 km/hr
2. 40 km/hr
3. 54 km/hr
4. 52 km/hr
Que. 4 A boy walking at the speed of 3 km/hr covers a certain distance in 3 hours 40 minutes. If he covers the same
distance by cycle in 11 hours, then what is the speed (in km/hr) of cycle?
1. 1
2. 2
3. 4
4. 3
Que. 5 A man travelled a distance of 80 km in 7 hrs, partly on foot at the rate of 8 km/hr and partly on bicycle at 16
km/hr. What is the distance travelled on the foot??
1. 32 km
2. 48 km
3. 36 km
4. 44 km
Que. 6 A train covers a distance in 50 minutes if it runs at a uniform speed of 48 km/hr. what will be the speed at
which the train must run to reduce the time of journey to 40 minutes?
1. 50 km/hr
2. 55 km/hr
3. 60 km/hr
4. 70 km/hr
Que. 7 Two trains move from stations M and N respectively. Both trains move towards each other at speed of 54
km/hr and 63 km/hr respectively. When they meet each other, the second train has travelled 100 km more
than the first. What is the distance (in km) between M and N?
1. 600
2. 700
3. 1300
4. 1500
Que. 8 A 200 metres long train crosses a bridge 400 metres long in 40 seconds. What is speed (in km/hr) of the
train?
1. 70
2. 72
3. 54
4. 65
Que. 9 A 600-meter-long train crosses a bridge 300 meters long in 18 seconds. What is speed (in km/hr) of the
train?
1. 200
2. 180
3. 220
4. 189
Que. 10 A person goes from point L to N and comes back. His average speed for the whole journey is 100 km/hr. If
his speed while coming back from N to L is 65 km/hr, then what will be the speed of the person (in km/hr)
while going from L to N?
1. 135
2. 146.31
3. 150.62
4. 216.67
Que. 11 Diameter of a car wheel is 21 cm. A car driver moving at the speed of 66 km/hr takes 36 seconds to reach a
destination. How many revolutions will the wheel make during the journey?
1. 1800
2. 1500
3. 1200
4. 1000
Que. 12 A train is moving at a speed of 72 km/h and covers a certain distance in 6 hours. If the same distance is to
be covered in 8 hours, then what will be the speed (in km/h) of the train?
1. 45
2. 54
3. 63
4. 64
Que. 13 X and Y walk at an average speed of 1.5 km/hr and 2 km/hr respectively. If X walks in West direction and
Y in North direction beginning from the same origin at the same time, what will be the minimum distance
between the two after 4 hours?
1. 10 km
2. 5 km
3. √13 km
4. 12 km
Que. 14 If 150 meters long train takes 10 seconds to cross a pole, then what is the speed (in km/hr) of the train?
1. 9
2. 18
3. 36
4. 54
Que. 15 A person goes from point L to point M and comes back. His average speed for the entire journey is 50
km/hr. If his speed while going from L to M is 35 km/hr,then what will be the speed of the person (in
km/hr) while coming back from M to L?
1. 62.5
2. 75
3. 87.5
4. 67.5
Que. 16 Two trains are running in opposite direction with the same speed. If the length of each train is 80 metres
and they cross each other in 16 seconds, then what is the speed (in km/hr) of each train?
1. 12
2. 18
3. 24
4. 30
Que. 17 If Ram walks at the speed of 3 km/hr, then he reaches his school 6 minutes late but if he walks at the speed
of 4 km/hr, then he reaches 4 minutes before the scheduled time. What is the distance (in km) of his school
from his house?
1. 1.8
2. 2
3. 3.5
4. 4
Que. 18 A car covers a distance of 16 km in 30 minutes. What is its average speed?
1. 16 km/hr
2. 32 km/hr
3. 24 km/hr
4. 8 km/hr
Que. 19 A and B walk at average speed of 2 km/hr and 3 km/hr respectively. If A walks in North direction and B in
East direction beginning from the same origin at the same time, what will be the distance between the two
after 2 hours?
1. 10 km
2. 2√13 km
3. √13/2 km
4. √26 km
Que. 20 P and Q are at a distance of 240 km from each other at 9: 00 a.m. After 1 hour, P starts moving towards Q
at a speed of 25 km/hr. At 11 a.m. Q starts moving towards P at the speed of 18 km/hr. At what time (in
p.m.) will they meet?
1. 6
2. 5
3. 3
4. 4
Que. 21 A train left 1 hour later than the scheduled time but in order to reach its destination 200 km away in time, it
had to increase its usual speed by 10 km/hr. What is the usual speed (in km/hr) of the train?
1. 38
2. 42
3. 45
4. 40
Que. 22 A man covers 3/5 of the total distance by train and the remaining 40 km by bus. What is his total journey
(in km)?
1. 50
2. 75
3. 100
4. 150
Que. 23 Raman goes to a place at a speed of 6 km/hr and returns back at 4 km/hr. What is his average speed (in
km/hr)?
1. 4.4
2. 4.2
3. 4.8
4. 4
Que. 24 A 300-metre-long train crosses a 700-metre-long platform. If the speed of train 72 km/hr, then what is the
time taken (in seconds) to cross the platform?
1. 50
2. 75
3. 72
4. 45
Que. 25 1/3 part of a certain journey is covered with the speed of 25 km/hr, 1/2 part of the journey is covered with
the speed of 45 km/hr and the remaining part covered with the speed of 37.5 km/hr. What is the average
speed (in km/hr) for the whole journey?
1. 37.08
2. 34.61
3. 43
4. 56
Que. 26 A train running at a speed of 60 km/hr, crosses a telephone pole. If the length of the train is 500 meters,
then what is the time taken (in seconds) by the train to cross the pole?
1. 35
2. 401
3. 30
4. 32
Que. 27 A truck moves at the speed of 90 km/hr after repairing and moves at the speed of 80 km/hr before
repairing. It covers x distance in 8 hours after repairing. How much time (in hours) will it take to cover 4x
distance before repairing?
1. 48
2. 40
3. 36
4. 28
Que. 28 Raman goes to a place at a speed of 6 km/hr and returns back at 12 km/hr. What is his average speed (in
km/hr)?
1. 5
2. 12
3. 8
4. 16
Que. 29 Aman can cover a certain distance in 30 hours, if he walks at the rate of 5 km/hr. If he covers the same
distance on a scooter at the rate of 10 km/hr, then what is the time (in hours) taken by him?
1. 12
2. 15
3. 20
4. 25
Que. 30 A train starts moving from a place X at 7:00 a.m. and arrives at another place Y at 1:00 p.m. on the same
day. If the speed of the train is 15 m/s, then what will be the distance (in km) covered by the train?
1. 324
2. 375
3. 390
4. 245
Que. 31 Two trains are moving in opposite directions with the same speed. If the length of each train is 120 metres
and they cross each other in 12seconds, then what is the speed (in km/hr) of each train?
1. 36
2. 45
3. 80
4. 60
Que. 32 A man travels 3 hours of the journey at a speed of 40 km/hr and remaining 2 hours of the journey at 50
km/hr. What is the average speed (in km/hr) of the entire journey?
1. 45
2. 46
3. 44
4. 47
Que. 33 Train A and B start at the same time. Train A travels at 55 km/hr from station X to station Y and train B
travels at 80 km/hr from station Y to station X. They cross each other after 1 hour and 36 minutes. What is
the distance (in km) between stations X and Y?
1. 196
2. 232
3. 240
4. 216
Que. 34 A bullet fired from a rifle travels at an average speed of 2520 km/hr. It hits the target after 0.2 seconds.
How far (in m) is the target from the rifle?
1. 70
2. 140
3. 100
4. 200
Que. 35 A jet ski goes upstream at a speed of 48 km/hr and comes back the same distance at 80 km/hr. Find the
average speed (in km/hr) for the total journey.
1. 64
2. 62
3. 66
4. 60
Que. 36 A car covers 630 km in 20 hours. Calculate its average speed in meters/second?
1. 8.25
2. 7.75
3. 8.75
4. 7.25
Que. 37 A train of length 180 metres crosses a tree in 15 seconds and crosses another train of the same length
travelling in opposite direction in 20 seconds. What is the speed (in km/hr) of the second train?
1. 21.6
2. 6
3. 33.4
4. 36.6
Que. 38 From point P, at 6:30 pm, a train starts moving towards Q with the speed of 40 km/hr. Another train starts
moving from point Q at 7:30 p.m. towards point P at the speed of 60 km/hr. Both of them meet at 11:30
p.m. at point R. What is the ratio of PR and QR?
1. 3 : 4
2. 5 : 6
3. 4 : 5
4. 5 : 4
Que. 39 A train crosses a platform in 40 seconds travelling with a speed of 54 km/hr. If the length of the train be
150 metres, then what will the length (in metres) of the platform?
1. 300
2. 450
3. 500
4. 550
Que. 40 A train running with a speed of 9 km/hr, crosses a telephone pole. If the length of train is 360 meters, then
what is the time taken (in seconds) by the train to cross the pole?
1. 140
2. 125
3. 144
4. 150
Que. 41 A person goes from point J to K with a speed of 80 km/hr and returns back with a speed 120 km/hr. What
is the average speed (in km/hr) of the person while going from J to K and coming back?
1. 90
2. 96
3. 100
4. 104
Que. 42 Jatin goes to a place at a speed of 5 km/hr and returns home at the speed of 10 km/hr. What is his average
speed (in km/hr)?
1. 6.5
2. 6.8
3. 6.67
4. 8
Que. 43 A train crosses a platform in 50 seconds travelling with a speed of 72 km/hr. If the length of the train be
250 metres, then what will be the length (in metres) of the platform?
1. 600
2. 480
3. 750
4. 950
Que. 44 A train starts moving from X at 5:00 p.m. and move towards Y with speed of 55 km/hr. Another train starts
moving from Y at 7:00 p.m. move towards X with speed of 40 km/hr. Both of them meet at 11:00 p.m. at
Z. What is the ratio of XZ and YZ?
1. 33 : 16
2. 7 : 5
3. 29 : 27
4. 11 : 9
Que. 45 A boy is driving car at the speed of 42 km/hr. He stops for 8 minutes at end of every 11 km. What will be
the time (in minutes) taken by him to cover a distance of 84 km?
1. 138
2. 142
3. 156
4. 176
Que. 46 Two buses are moving towards each other at a speed of 20 km/hr and 34 km/hr, respectively. What will be
the distance (in metres) between the two buses one second before they collide?
1. 21
2. 18
3. 12
4. 15
Que. 47 A train starts moving from a place P at 10:00 a.m. and arrives at another place Q at 5:30 p.m. on the same
day. If the speed of the train is 50 km/hr, then what will be the distance (in km) covered by the train?
1. 424
2. 390
3. 375
4. 225
Que. 48 A train is moving at the speed of 72 km/hr. How many seconds will it take to cover a distance of 1400 m?
1. 70
2. 80
3. 72
4. 84
Que. 49 A 220 metres long train takes 33 seconds to cross a 440 metres long bridge. How much time (in seconds)
will the train take to cross a 350 metres long bridge?
1. 28.5
2. 17.5
3. 23.5
4. 27.5
Que. 50 Two motorcycles are moving towards each other with the speeds of 38 km/hr and 88 km/hr respectively.
One second before the collision what will be the distance (in meters) between the two motorcycles if they
are 126 km apart from each other?
1. 42
2. 40
3. 34
4. 35
Que. 51 A train moves at a speed of 35 m/sec and crosses a tunnel of length 960 metres, in 40 seconds. What is the
length (in metres) of the train?
1. 360
2. 440
3. 530
4. 560
Que. 52 A boy starts from his house and walks at a speed of 5 km/hr and reaches his school 3 minutes late. Next
day he starts at the same time and increases his speed by 4 km/hr and reaches 3 minutes early. What is the
distance (in km) between the school and his house?
1. 1
2. 1.25
3. 1.125
4. 1.5
Que. 53 Two trains are running in opposite directions with the same speed. If the length of each train is 486 metres
and they cross each other in 27 seconds, then what is the speed (in km/hr) of each train?
1. 55
2. 56.4
3. 64.8
4. 73.2
Que. 54 If Shubhangi walks with a speed of 2 km/hr, then she reaches her school 5/2 minutes late but if she walks
with a speed of 2.5 km/hr, then she reach 5 minutes before the scheduled time. What is the distance (in km)
of her school from her house?
1. 1.025
2. 1.125
3. 1.25
4. 1.5
Que. 55 Two trains are moving in the same direction at the speed of 35 km/hr and 71 km/hr. Time taken by faster
train to cross a man sitting in the slower train is 48 seconds. What will be the length (in metres) of the
faster train?
1. 540
2. 420
3. 480
4. 660
Que. 56 A train is moving at the speed of 36 km/hr. How many seconds it will take to cover a distance of 600
meters?
1. 60
2. 120
3. 30
4. 40
Que. 57 Two men are standing on opposite ends of a bridge 2000 metres long. If they walk towards each other with
the speeds of 10 m/s and 15 m/s respectively, then in how much time (in seconds) will they meet each
other?
1. 100
2. 120
3. 90
4. 80
Que. 58 A train crosses a platform in 50 seconds travelling with a speed of 72 km/hr. If the length of the train is
250 metres, then what will be the length (in metres) of the platform?
1. 600
2. 480
3. 750
4. 950
Que. 59 Toy machines A and B walks at an average speed of 0.5 km/hr and 0.25 km/hr respectively. If toy A walks
in North direction and toy B in West direction beginning from the same origin at the same time, what will
be the minimum distance between the two toys after 4 hours ?
1. √5 km
2. √3 km
3. √2 km
4. √4 km
Que. 60 Ram and Shyam walk at average speed of 3 km/hr and 5 km/hr respectively. If Ram walks in East direction
and Shyam in North direction beginning from the same origin at the same time, what will be the minimum
distance between the two after 2 hours?
1. 16 km
2. 2√34 km
3. √34 km
4. √17 km
Que. 61 A train crosses a platform in 30 seconds travelling at a speed of 72 km/hr. If the length of the train be 120
metres, then what will be the length (in metres) of the platform?
1. 320
2. 450
3. 480
4. 360
Que. 62 A train running with a speed of 60 km/hr, crosses a telephone pole. If the length of train is 500 meters, then
what is the time taken (in seconds) by the train to cross the pole?
1. 35
2. 40
3. 30
4. 32
Que. 63 A person goes from point A to B with a speed of 55 km/hr and returns back with a speed 65 km/hr. What is
the average speed (in km/hr) of the person while going and coming back from A to B?
1. 59.58
2. 62.31
3. 60
4. 63
Que. 64 Jatin goes to a place at a speed of 5 km/hr and return home at speed of 10 km/hr. What is his average speed
(in km/hr)?
1. 6.5
2. 6.8
3. 6.67
4. 8
Que. 65 The downstream speed of a boat is 42 km/hr and the speed of current is 3 km/hr. What is the total time (in
hours) taken by the boat to cover 72 km upstream and 84 km downstream?
1. 3
2. 4
3. 5
4. 6
Que. 66 A train 200 meters long is running at a speed of 20 meters per second. In how much time (in seconds) will
it cross a bridge which is 400 meters long?
1. 20
2. 25
3. 30
4. 60
Que. 67 Govind covers 3/11 of the total distance by train and the remaining 72 km by bus. What is his total journey
(in km)?
1. 108
2. 99
3. 118
4. 126
Que. 68 A man covers a certain distance by a train running at a speed of 50 km/hr and he covers the same distance
back by walking at a speed of 5 km/hr. If his whole journey took 5 hours 30 minutes, then what was the
distance (in km) of one side of the journey?
1. 30
2. 25
3. 20
4. 18
Que. 69 A car moves at a speed of 72 km/hr after repairing and moves at the speed of 54 km/hr before repairing. It
covers X distance in 6 hours after repairing. How much time (in hours) will it take to cover 3X distance
before repairing?
1. 20
2. 24
3. 18
4. 21
Que. 70 If Anuj walks at the speed of 4 km/hr, then he reaches his school 6 minutes late but if he walks at the speed
of 5 km/hr, then he reaches 6 minutes before the scheduled time. What is the distance (in km) of his school
from his house?
1. 4
2. 3
3. 6
4. 3.5
Que. 71 When Gopal walks from A to B and returns from B to A on a cycle, it takes him 46 minutes. When
walking both ways, it takes him 75 minutes. If he rides the cycle both ways then what will be the total time
(in minutes) taken by him?
1. 19
2. 17
3. 23
4. 15
Que. 72 The distance between places U and V is 1008 km. An express train leaves place U at 9 : 00 a.m. and runs at
a speed of 126 km/hr. The train stops on the way for 20 minutes. At what time (in p.m.) the train will reach
at the place V?
1. 6 ∶ 50
2. 3 ∶ 50
3. 4 ∶ 20
4. 5 ∶ 20
Que. 73 To travel 720 km, a Express train takes 6 hours more than Duronto. If however, the speed of the Express
train is doubled, it takes 2 hours less than Duronto. The speed of Duronto (in km/hr) is?
1. 60
2. 72
3. 66
4. 78
Que. 74 A man starts walking from a place X and reaches the place Y in 12 hours. He travels 3/7th of the total
distance at the speed of 3 km/hr and the remaining distance at the speed of 4 km/hr. What is the distance
(in km) between X and Y?
1. 28
2. 36
3. 40
4. 42
Que. 75 Two trains are moving in the same direction at the speed of 23 km/hr and 77 km/hr. The time taken by
faster train to cross a man sitting in the slower train is 40 seconds. What will be the length (in metres) of
the faster train?
1. 720
2. 640
3. 600
4. 540
Que. 76 A train moves at the speed of 40 m/s and crosses a bridge of length 550 metres in 25 seconds. What is the
length (in metres) of the train?
1. 400
2. 450
3. 480
4. 500
Que. 77 A train is moving at the speed of 90 km/hr. How many seconds it will take to cover a distance of 2275
meter?
1. 96
2. 91
3. 86
4. 93
Que. 78 A man covers a certain distance by a train running at a speed of 40 km/hr and covers the same distance
back by walking at a speed of 8 km/hr. If the whole journey took 12 hours, then what is the distance of one
side of the journey (in km)?
1. 80
2. 60
3. 90
4. 100
Que. 79 Two trains are moving in the same direction at the speed of 42 km/hr and 84 km/hr and their lengths are
320 meters and 380 meters respectively. What is the time taken (in seconds) by faster train to cross the
slower train?
1. 60
2. 80
3. 90
4. 120
Que. 80 Kamal covers 4/5 of the total distance by train and the remaining 15 km by bus. What is his total journey
(in km)?
1. 50
2. 75
3. 85
4. 35
Que. 81 A 400 metre long train crosses a 200 metre long platform. If the speed of train 30 km/hr, then what is the
time taken (in seconds) to cross the platform?
1. 70
2. 75
3. 72
4. 80
Que. 82 A train running with a speed of 6 km/hr, crosses a telephone pole. If the length of train is 720 meters, then
what is the time taken (in seconds) by the train to cross the pole?
1. 430
2. 450
3. 432
4. 445
Que. 83 A car travels at a speed of 50 m/sec. for 7 hours. What is the distance (in km) travelled by the car?
1. 1250
2. 1260
3. 1300
4. 1200
Que. 84 A train of length 200 m is running at the speed of 60 km/hr. What is the time (in seconds) taken by the
train to pass a man standing at the station?
1. 12
2. 10
3. 11
4. 15
Que. 85 A train is travelling at the speed of 90 km/hr. How many seconds will it take to cover a distance of 2 km?
1. 70
2. 80
3. 60
4. 90
Que. 86 Two men are standing on opposite ends of a bridge 1500 meters long. If they walk towards each other with
speeds of 5 m/s and 7 m/s respectively, then in how much time (in seconds) will they meet each other?
1. 125
2. 175
3. 200
4. 225
Que. 87 An 800 meters long train crosses a 450 meter long bridge in 50 seconds. What is speed (in km/hr) of the
train?
1. 90
2. 100
3. 80
4. 85
Que. 88 A car travels at a speed of 75 m/s for 2 hours. What is the distance (in km) travelled by the car?
1. 500
2. 525
3. 540
4. 550
Que. 89 A person goes from point S to T and comes back. His average speed for the whole journey is 70 km/hr. If
his speed while coming back from T to S is 80 km/hr, then what will be the speed of the person (in km/hr)
while going from S to T?
1. 58.13
2. 62.22
3. 60
4. 65
Que. 90 A person goes from point A to B and comes back. His average speed for the whole journey is 30 km/hr. If
his speed while going from A to B is 24 km/hr, then what will be the speed of the person (in km/hr) while
coming back from B to A?
1. 35
2. 40
3. 45
4. 38
Que. 91 A cyclist covers a distance of 8 kms in 30 minutes. What is his average speed?
1. 16 km/hr
2. 8 km/hr
3. 24 km/hr
4. 4 km/hr
Que. 92 A truck covers a distance of 1200 km in 40 hours. What is the average speed of the truck?
1. 30 km/hr
2. 40 km/hr
3. 60 km/hr
4. 45 km/hr
Que. 93 A bullock cart covers a distance of 10 kms in 4 hours. What is the average speed of the bullock cart?
1. 8 km/hr
2. 2.5 km/hr
3. 2 km/hr
4. 10 km/hr
Que. 94 A bus runs at an average speed of 32 km/hr. If it completes 304 km long journey with a break of 30
minutes, what is the total time taken during the journey?
1. 12 hrs.
2. 11 hrs.
3. 10 hrs.
4. 9 hrs.
Que. 95 A 700-metre-long train crosses an 800-metre-long bridge in 27 seconds. What is speed (in km/hr) of the
train?
1. 180
2. 200
3. 250
4. 175
Que. 96 A car travels at a speed of 50 m/s. for 5 hours. What is the distance (in km.) travelled by the car?
1. 1000
2. 900
3. 990
4. 500
Que. 97 Two men are standing on opposite ends of a 1500-metre-long bridge. If they walk towards each other with
speeds of 25 m/s and 5 m/s respectively, then how much time (in seconds) will they take to meet each
other?
1. 40
2. 50
3. 60
4. 80
Que. 98 Excluding stoppages, the speed of a bus is 60 km/h and including stoppages, it is 45 km/h. For how many
minutes does the bus stop per hour?
1. 12
2. 9
3. 15
4. 10
Que. 99 Two cyclists A and B start cycling at 21 km/hr and 24 km/hr towards each other. They meet after 1 hour
and 12 minutes. How far (in km) were they from each other when they started?
1. 48
2. 42
3. 54
4. 36
Que. 100 A train has to cover a distance of 900 km in 25 hours. What should be its average speed in
meters/second?
1. 20
2. 10
3. 18
4. 36
Que. 101 A girl walking at the speed of 2 km/hr covers a certain distance in 7 hours 30 minutes. If she covers the
same distance by cycle in 5 hours, then what is the speed (in km/hr) of cycle?
1. 2.5
2. 4
3. 3
4. 3.5
Que. 102 Two stations L and M are 180 km apart from each other. A train leaves from L to M and simultaneously
another train leaves from M to L. Both trains meet after 9 hours. If the speed of the first train is 10 km/hr
more than the second train, then what is the speed (in km/hr) of the slower train?
1. 9
2. 5
3. 12
4. 15
Que. 103 A train starts from a place A at 8 : 00 a.m. and arrives at another place B at 1 : 30 p.m. on the same day. If
the speed of the train is 30 km/hr, then what will be the distance (in km) covered by the train?
1. 165
2. 175
3. 150
4. 135
Que. 104 A train is moving at the speed of 54 km/hr. how many seconds it will take to cover a distance of 450
metres?
1. 60
2. 30
3. 45
4. 36
Que. 105 Rohit crosses a 700 metres wide road in 35 seconds. What is his speed (in km/hr)?
1. 54
2. 76
3. 72
4. 84
Que. 106 Two trains are moving in the same direction at the speed of 24 km/hr and 50 km/hr. The time taken by
faster train to cross a man sitting in the slower train is 72 seconds. What will be the length (in metres) of
the faster train?
1. 560
2. 490
3. 520
4. 640
Que. 107 A bus moves at a speed of 84 km/hr after repairing and moves at a speed of 56 km/hr before repairing. It
covers 2x distance in 8 hours after repairing. How much time (in hours) will ittake to cover x distance
before repairing?
1. 8
2. 5
3. 6
4. 9
Que. 108 A boy walking at the speed of 4 km/hr covers a certain distance in 6 hours 15 minutes. If he covers the
same distance by cycle in 5 hours, then what is the speed (in km/hr) of the cycle?
1. 4.5
2. 5
3. 6
4. 6.5
Que. 109 The speed of a train is 72 km/hr and its length is 200 meters. What will be the time (in minutes) taken by
the train to cross a pole?
1. 1/6 min
2. 3/5 min
3. 5 min
4. 10 min
Que. 110 A 800 metres long train is running at the speed of 90 km/hr. If it crosses a bridge in 50 seconds, then what
is the length (in metres) of the bridge?
1. 250
2. 300
3. 350
4. 450
Que. 111 Two trains are moving towards each other with the speed of 25 km/hr and 83 km/hr respectively. What
will be the distance (in metres) between the trains one second before collide?
1. 32
2. 35
3. 30
4. 40
Que. 112 The distance between places X and Y is 720 km. An express train leaves place X at 5:00 p.m. and runs at
a speed of 45 km/hr. The train stops on the way for 45 minutes. At what time (in a.m.) will the train
reach at place Y?
1. 1 : 45
2. 9 : 45
3. 7 : 15
4. 12 : 15
Que. 113 Vipin crosses a 450 metres wide road in 9 seconds. What is his speed (in km/hr)?
1. 195
2. 150
3. 210
4. 180
Que. 114 A car covers a distance of 20 km in 15 minutes. If its speed is decreased by 10 km/hr, what will be the
time (in minutes) taken by it to cover the same distance?
1. 150/11
2. 120/7
3. 130/11
4. 150/13
Que. 115 A man makes four trips of equal distances. His speed on first trip was 60 km/hr and in each subsequent
trip his speed was half of the previous trip. What is the average speed (in km/hr) of the man in these four
trips?
1. 16
2. 30
3. 28.125
4. 27.5
Que. 116 If a boat goes a certain distance at 30 km/h and comes back the same distance at 20 km/hr, what is the
average speed (in km/hr) for the total journey ?
1. 25
2. 24.5
3. 24
4. 25.5
Que. 117 Diameter of wheel of a cycle is 21 cm. The cyclist takes 45 minutes to reach a destination at a speed of
16.5 km/hr. How many revolutions will the wheel make during the journey?
1. 12325
2. 18750
3. 21000
4. 24350
Que. 118 If a person walks at 12 km/hr instead of 10 km/hr, he would have walked 1 km more in the same time.
What is the actual distance (in kms) travelled by him at 10 km/hr in the same time?
1. 8
2. 10
3. 5
4. 12
Que. 119 A person goes from point N to P and comes back. His average speed for the whole journey is 60 km/hr. If
his speed while going from N to P is 40 km/hr, then what will be the speed of the person (in km/hr) while
coming back from P to N?
1. 80
2. 100
3. 120
4. 140
Que. 120 One third of a certain journey is covered at the speed of 40 km/hr, one fourth at the speed of 25 km/hr and
the rest at the speed of 50 km/hr. what will be the average speed(in km/hr) for the whole journey?
1. 37.5
2. 33.5
3. 33.33
4. 38.33
Que. 121 A person goes to his office by scooter at the speed of 50 km/hr and reaches 10 minutes earlier. If he goes
at the speed 40 km/hr, then he reaches 20 minutes late. What will be the speed (in km/hr) of the scooter to
reach on time?
1. 47 4
13
2. 46 2
13
3. 48 2
13
4. 47 2
13
Que. 122 One third of a certain journey is covered at the speed of 80 km/hr, one fourth of the journey at the speed
of 50 km/hr and the rest at the speed of 100 km/hr. what will be the average speed (in km/hr) for the
whole journey?
1. 75
2. 67
3. 66.66
4. 76.66
Que. 123 Amit goes to his office by car at the speed of 80 km/hr and reaches 15 minutes earlier. If he goes at the
speed 60 km/hr, he reaches 15 minutes late. What will be the speed (in km/hr) of the car to reach on time?
1. 478/7
2. 476/7
3. 480/7
4. 484/7
Que. 124 50 trees are standing in a line such that distance between any two consecutive trees is same. A car takes
18 seconds to travel from 13th tree to 34th tree. How much time (in seconds) will it take to reach from 1st
tree to 50th tree?
1. 42
2. 42.85
3. 45
4. 49
Que. 125 Two cyclists P and Q cycle at 20 km/hr and 16 km/hr towards each other respectively. What was the
distance (in kms) between them when they started if they met after 40 minutes?
1. 36
2. 30
3. 25
4. 24
Que. 126 Two cars A and B travel from one city to another, at speeds of 35 km/hr and 45 km/hr respectively. If car
B takes 2 hours lesser time than car A for the journey, then the distance (in kms) between the two cities
is?
1. 345
2. 375
3. 415
4. 315
Que. 127 A man travelled a distance of 99 km in 9 hours. He travelled partly on foot @ 9 km/hr and partly on
bicycle @ 18 km/hr. What is distance (in kms) travelled on foot?
1. 36
2. 54
3. 63
4. 45
Que. 128 If a person walks at 15 km/hr instead of 9 km/hr, he would have walked 3 km more in the same time.
What is the actual distance (in kms) travelled by him?
1. 5.5
2. 6.5
3. 4.5
4. 7.5
Que. 129 A train of length 100 m crosses another train of length 150 m, running on a parallel track in the opposite
direction in 9 seconds. If the speed of train having length 150 m is 40 km/hr, then what is the speed (in
km/hr) of the other train?
1. 30
2. 48
3. 50
4. 60
Que. 130 Two trains are moving in the opposite direction at speed of 30 km/hr and 45 km/hr respectively, whose
lengths are 450 m and 550 m respectively. What is the time taken (in seconds) by slower train to cross the
faster train?
1. 48
2. 54
3. 62
4. 72
Que. 131 Two cyclists P and Q cycle at 20 km/hr and 25 km/hr towards each other. What was the distance (in kms)
between them when they started if they met after 56 minutes?
1. 36
2. 39
3. 42
4. 45
Que. 132 A spaceship travels at 810 km/hr. How many meters does it travel in 1/5th of a second?
1. 60
2. 45
3. 75
4. 90
Que. 133 A spaceship travels at 1,260 km/h. How many metres does it travel in 1/10 th of a second?
1. 126
2. 35
3. 36
4. 125
Que. 134 After excluding stoppages, the speed of a bus is 60 kmph and after including stoppages, it is 45 kmph. For
how many minutes does the bus stop per hour?
1. 10
2. 9
3. 12
4. 15
Que. 135 A boat goes a certain distance at 40 km/hr and comes back the same distance at 24 km/hr. What is the
average speed (in km/hr) for the total journey?
1. 32
2. 28
3. 34
4. 30
Que. 136 A bus starts running with the initial speed of 33 km/hr and its speed increases every hour by certain
amount. If it takes 7 hours to cover a distance of 315 km, then what will be hourly increment (in km/hr) in
the speed of the bus?
1. 1
2. 2
3. 3
4. 4
Que. 137 A motorcyclist left minutes later than the scheduled time but in order to reach its destination 21 km
away in time, he had to increase his speed by 12 kh/hr form the usual speed. What is usual speed (in
km/hr) of the motorcyclist?
6 69
1. 28
2. 35
3. 42
4. 64
Que. 138 A train can travel 25% faster than a car. Both start from point A at the same time and reach point B 165
km away at the same time. On the way the train takes 40 minutes for stopping at the stations. What is the
difference in the speeds (in km/hr) of train and car?
1. 6.375
2. 7.635
3. 9.75
4. 12.375
Que. 139 A bus left 60 minutes later than the scheduled time but in order to reach the destination 48 km away in
time, it had to increase its speed by 4 km/h from the usual speed. What is the usual speed (in km/hr) of the
bus?
1. 9
2. 12
3. 15
4. 8
Que. 140 Diameter of the cycle wheel is 14 cm. A cyclist takes 30 minutes to reach a destination at a speed of 11
km/h. How many revolutions will the wheel make during the journey?
1. 12500
2. 15000
3. 17750
4. 20000
Que. 141 A car left 3 minutes early than the scheduled time and in order to reach the destination 126 km away in
time, it has to slow its speed by 6 km/h from the usual. What is the usual speed (in km/hr) of the car?
1. 56
2. 63
3. 94.5
4. 126
Que. 142 A train of length 600 metre crosses a platform of length 1000 metre in 80 seconds. What is the speed (in
m/s) of the train?
1. 20
2. 72
3. 16
4. 36
Que. 143 A walks at a uniform speed of 8 km/hr and B starts on his cycle after 8 hours at speed of 24 km/hr. How
far (in km) from the starting point will B catch A?
1. 72
2. 96
3. 120
4. 144
Que. 144 A man rides his vehicle at the rate of 36 km/hr but stops for 12 minutes, to change parts at the end of
every 14th km. What will be the time taken to cover a distance of 90 km?
1. 6 hour 12 minutes
2. 2 hours 30 minutes
3. 3 hours 42 minutes
4. 5 hours 32 minutes
Que. 145 Excluding stoppages, the speed of a bus is 72 kmph and including stoppages, it is 60 kmph. For how
many minutes does the bus stop per hour?
1. 12
2. 8
3. 15
4. 10
Que. 146 Two cars are travelling towards each other with speeds of 45 km/hr and 63 km/hr respectively. What is
the distance (in kilometres) between the two cars ten second before they collide?
1. 0.5
2. 0.2
3. 0.3
4. 0.45
Que. 147 A bus starts running with some initial speed and its speed increases every hour by 9 km/hr. If it takes 11
hours to cover a distance of 572 km, then what was the initial speed (in km/hr) of the bus?
1. 3.5
2. 7
3. 10.5
4. 14
Que. 148 Two people A and B are at a distance of 110 km from each other at 10:30 AM. After 30 mins, A starts
moving towards B at a speed of 20 km/hr while at 12 PM B starts moving away from A at a speed of 15
km/hr. At what time (in AM) will they meet on the next day?
1. 6 : 00
2. 8 : 00
3. 4 : 00
4. 3 : 00
Que. 149 Two trains are moving in the same direction at speed of 60 km/hr and 70 km/hr. The time taken by faster
train to cross a man sitting in the slower train is 2 minutes 42 seconds. What will be the length (in metres)
of the faster train?
1. 202
2. 330
3. 450
4. 540
Que. 150 A man travels some distance at a speed of 15 km/hr and he returns at a speed of 6 km/hr. If the total time
taken by the man is 14 hours, then what is the distance (in km)?
1. 48
2. 60
3. 45
4. 56
Que. 151 To cover a distance of 144 km in 3.2 hours what should be the average speed of the car in meters/second?
1. 12.5
2. 10
3. 7.5
4. 15
Que. 152 Raman goes office at a speed of 40 kmph and returns home at a speed of 60 kmph. What is his average
speed (in km/hr)?
1. 45
2. 48
3. 50
4. 52
Que. 153 A train passes two bridges of length 600 metres and 300 metres in 120 seconds and 80 seconds
respectively. What is the length (in metres) of the train?
1. 200
2. 250
3. 300
4. 450
Que. 154 A man travels 3 hours of the journey at a speed of 100 km/hr and remaining 2 hours of the journey at 120
km/hr. What is the average speed (in km/hr) of the entire journey?
1. 105 km/hr
2. 110 km/hr
3. 108 km/hr
4. 107 km/hr
5. 112 km/hr
Que. 155 If 200 meters long train takes 40 seconds to cross a pole, then what is the speed (in km/h) of the train?
1. 9 km/h
2. 18 km/h
3. 36 km/h
4. 45 km/h
Que. 156 A 450 meter long train crosses a bridge 650 meters long in 36 seconds. What is speed (in km/hr) of the
train?
1. 110
2. 125
3. 150
4. 95
Que. 157 A car travels at a speed of 25 m/s for 8 hours. What is the distance (in km) travelled by the car?
1. 360
2. 720
3. 450
4. 900
Que. 158 A person goes from point A to B and comes back. His average speed for the whole journey is 65 km/hr. If
his speed while coming back from B to A is 40 km/hr, then what will be the speed of the person (in
km/hr) while going from A to B?
1. 190.66
2. 173.33
3. 194.33
4. 162.33
Que. 159 After repairing a scooter runs at a speed of 54 km/h and before repairing runs at speed of 48 km/h. It
covers a certain distance in 6 hours after repairing. How much time will it take to cover the same distance
before repairing?
1. 6 hours 15 minutes
2. 6 hours 45 minutes
3. 7 hours
4. 7 hours 30 minutes
Que. 160 To cover a distance of 90 km in 2.5 hours what should be the average speed of the car in meters/second?
1. 10
2. 20
3. 30
4. 40
Que. 161 A man travelled a distance of 50 km in 8 hours. He travelled partly on foot at 5 km/hr and partly on
bicycle at 7 km/hr. What is the distance (in kms) travelled on foot?
1. 20
2. 25
3. 15
4. 30
Que. 162 A train running with a speed of 45 km/hr, crosses a telephone pole. If the length of train is 810 meters,
then what is the time taken (in seconds) by the train to cross the pole?
1. 66 s
2. 64.8 s
3. 68 s
4. 67.2 s
Que. 163 If a taxi going at 40 km/hr takes 25 minutes to travel a certain distance, by how much should it increase
its speed (in km/hr) to travel the same distance in 20 minutes?
1. 50 km/hr
2. 5 km/hr
3. 25 km/hr
4. 10 km/hr
Que. 164 A goes to office at a speed of 10 km/hr and returns home at 40 km/hr. What is his average speed (in
km/hr)?
1. 16
2. 24
3. 25
4. 32
Que. 165 A train crosses a platform in 45 seconds travelling with a speed of 36 km/h. If the length of the train be
200 metres, then what will be the length (in metres) of the platform?
1. 250
2. 200
3. 300
4. 350
Que. 166 To travel 432 km, an Express train takes 1 hour more than Duronto. If however, the speed of the Express
train is increased by 50%, it takes 2 hours less than Duronto. What is the speed (in km/hr) of Duronto
train?
1. 60
2. 54
3. 48
4. 72
Que. 167 A man travelled a distance of 60 km in 7 hours. He travelled partly on foot @ 6 km/hr and partly on
bicycle @ 12 km/hr. What is the distance (in kms) travelled on foot?
1. 15
2. 9
3. 48
4. 24
Que. 168 A boat is sailing towards a lighthouse of height 20√3 m at a certain speed. The angle of elevation of the
top of the lighthouse changes from 30° to 60° in 10 seconds. What is the time taken (in seconds) by the
boat to reach the lighthouse from its initial position?
1. 10
2. 15
3. 20
4. 60
Que. 169 A runner starts running from a point at 6:00 am with a speed of 8 km/hr. Another racer starts from the
same point at 8:30 am in the same direction with a speed of 10 km/hr. At what time of the day (in p.m.)
will the second racer will overtake the other runner?
1. 8:00
2. 4:00
3. 6:30
4. 5:30
Que. 170 A train is moving at a speed of 84 km/hr and covers a certain distance in 12 hours. If the same distance is
to be covered in 14 hours, then what will be the speed (in km/hr) of the train?
1. 72
2. 76
3. 66
4. 60
Que. 171 37 trees are planted in a straight line such that distance between any two consecutive trees is same. A car
takes 20 seconds to reach the 13th tree. How much more time (in seconds) will it take to reach the last
tree?
1. 36
2. 40
3. 57.6
4. 60
Que. 172 A bus travels 2/5 of a total journey at its usual speed. The remaining distance was covered by bus at 6/7
of its usual speed. Due to slow speed it reaches its destination 50 minutes late. If the total distance is 200
kms, then what is the usual speed (in km/hr) of bus?
1. 20.57
2. 24
3. 28
4. 26.52
Que. 173 A train travels 20% faster than a car. Both start from point A at the same time and reach point B, 180 km
away at the same time. On the way the train takes 30 minutes for stopping at the stations. What is the
speed (in km/hr) of the train?
1. 56
2. 66
3. 72
4. 80
Que. 174 If I walk at 7/6 of my usual speed, then I reach my office 15 minutes early. What is the usual time taken
(in minutes) by me to reach the office?
1. 60
2. 75
3. 90
4. 105
Que. 175 Two trains are moving in the same directions at speed of 43 km/h and 51 km/h respectively. The time
taken by the faster train to cross a man sitting in the slower train is 72 seconds. What is the length (in
metres) of the faster train?
1. 160
2. 138.4
3. 170
4. 140
Que. 176 A starts from a point at a speed of 30 m/s. After 3 seconds, B starts chasing A from the same point with a
speed of 50 m/s. What will be the total distance (in metres) travelled by A and B before A is caught by B?
1. 360 m
2. 450 m
3. 600 m
4. 720 m
Que. 177 Aman and Kapil starts from Delhi and Gwalior respectively towards each other at same time. They meet
at Mathura and then take 196 minutes and 225 minutes respectively to reach Gwalior and Delhi. If speed
of Aman is 30 km/hr, then what is the speed (in km/hr) of Kapil?
1. 28
2. 30
3. 225/7
4. 392/15
Que. 178 Two people A and B are at a distance of 260 km from each other at 9 : 00 a.m. A immediately starts
moving towards B at a speed of 25 km/h and at 11 : 00 a.m. B starts moving towards A at a speed of 10
km/hr. At what time (in p.m.) will they meet each other?
1. 5 : 00
2. 6 : 00
3. 6 : 30
4. 7 : 00
Que. 179 A train travels 40% faster than a car. Both start from point A at the same time and reach point B, 140 km
away at the same time. On the way the train takes 25 minutes for stopping at the stations. What is the
speed (in km/hr) of the train?
1. 67
2. 134.4
3. 145.9
4. 160
Que. 180 Two cars travel from city A to city B at a speed of 30 km/hr and 48 km/hr respectively. If one car takes 3
hours lesser time than the other car for the journey, then the distance between City A and City B is
1. 280 km
2. 240 km
3. 250 km
4. 260 km
Que. 181 To cover a distance of 333 km in 2 hours by a car, what should be the average speed of the car (in
meter/second)?
1. 166.5
2. 46.25
3. 83.25
4. 92.5
Que. 182 A man travels 400 km in, partly by rail and partly by steamer. He spends 9 hours more time on steamer. If
the velocity of the steamer is 30 km/hr and the velocity of rail is 70 km/hr, how much distance does he
cover by steamer?
1. 309 km
2. 371 km
3. 464 km
4. 556 km
Que. 183 A thief is stopped by a policeman from a distance of 450 metres. When the policeman starts the chase, the
thief also starts running. Assuming the speed of the thief as 7 km/h and that of policeman as 12 km/h,
how far the thief would have run, before he is overtaken?
1. 504 metres
2. 756 metres
3. 378 metres
4. 630 metres
Que. 184 To travel 708 km, an Express train takes 6 hours more than Rajdhani train. If however, the speed of the
Express train is doubled, it takes 3 hours less than Rajdhani train. What is the speed of Rajdhani train?
1. 59 km/hr
2. 78.7 km/hr
3. 39.3 km/hr
4. 98.3 km/hr
Que. 185 Two cars travel from city A to city B at a speed of 42 and 60 km/hr respectively. If one car takes 2 hours
lesser time than the other car for the journey, then the distance between City A and City B is?
1. 336 km
2. 280 km
3. 420 km
4. 224 km
Que. 186 Two cars travel from city A to city B at a speed of 30 km/hr and 36 km/hr respectively. If one car takes 3
hours lesser time than the other car for the journey, then the distance between City A and City B is?
1. 648 km
2. 810 km
3. 432 km
4. 540 km
Que. 187 A thief is stopped by a policeman from a distance of 500 metres. When the policeman starts the chase, the
thief also starts running. Assuming the speed of the thief as 10 km/h and that of police man as 18 km/h,
how far the thief would have run, before he is over - taken?
1. 625 metre
2. 500 metre
3. 750 metre
4. 375 metre
Que. 188 A car travels a certain distance at 24 km/h and comes back at 36 km/h. Find the average speed for total
journey.
1. 28.8 km/hr
2. 30 km/hr
3. 27.6 km/hr
4. 31.2 km/hr
Que. 189 A man travels 434 km, partly by rail and partly by steamer, He spends 8 hours more time on steamer, If
the velocity of the steamer is 25 km/hr and the velocity of rail is 65 km/hr, how much distance does he
cover by steamer?
1. 318 km
2. 398 km
3. 265 km
4. 477 km