Que. 1 A person goes from point N to P and comes back. His average speed for the whole journey is 60 km/hr. If
his speed while going from N to P is 40 km/hr, then what will be the speed of the person (in km/hr) while
coming back from P to N?
1. 80
2. 100
3. 120
4. 140
Que. 2 Mohan covers a distance of 2.5 km by scooter at the rate of 30 km/h. The time taken by Mohan to cover he
given distance in minute is:
1. 8
2. 10
3. 5
4. 6
Que. 3 An athlete crosses a distance of 900 m in 10 minutes. What is his speed in km per hour?
1. 5.4 km/h
2. 4.8 km/h
3. 6.9 km/h
4. 3.6 km/h
Que. 4 The ratio between the speeds of two trains is 3 : 4. The second train runs 800 km in 5 hrs, and speed of first
train is:
1. 120 km/hrs
2. 140 km/hrs
3. 180 km/hrs
4. 160 km/hrs
Que. 5 Two trains are coming from opposite side at 40 km/hrs and 50 km/hrs from the different places 360 km
apart. After how many hours two trains will meet to each other?
1. 4 hrs
2. 6 hrs
3. 5 hrs
4. 3 hrs
Que. 6 A started running towards north direction at 6:00 a.m. B also started running towards north direction at
10:00 a.m. At what time will they meet if the speeds of A and are in the ratio 3 : 7 and they started from the
same point?
1. 1 p.m.
2. 2 p.m.
3. 1:30 p.m.
4. 12:30 p.m.
Que. 7 A beats B by 125 m in a kilometre race. Find B’s speed if A’s speed is 16 m/sec.
1. 18 m/sec
2. 14 m/sec
3. 7 m/sec
4. 21 m/sec
Que. 8 A takes 6 hours more than B to cover a distance of 60 km. But if A doubles his speed, he takes 3 hours less
than B to cover the same distance. The speed (in km/hr) of A is:
1. 3 13
2. 4 23
3. 4
4. 5
Que. 9 A 280 m long train is running at 108 km/hr. In how much time will it cross a bridge of length 170 m?
1. 10 sec
2. 15 sec
3. 16 sc
4. 12 sec
Que. 10 Two trains start at the same time, P from A to B and Q from B to A.If they arrive at B and A,respectively,
hours and 10 hours after they passed each other, and the speed of P is 90 km/hr, then the speed of Q in
km/hr is?
2 12
1. 80
2. 75
3. 45
4. 60
Que. 11 Walking at 75% of his usual speed, Raghu is 80 minutes late to his office. What is his usual time in hours
to cover the same distance?
1. 3 12
2. 5
3. 4
4. 4 12
Que. 12 A person covered a distance of 250 km at a certain speed. If his speed is 20% less, he would have covered
the same distance in hours less time. His speed (in km/hr), initially was: 1 14
1. 45
2. 50
52 3. 12
47 4. 12
Que. 13 If Vijay is travelling at the speed of 17.5 m/s, then how much distance will Vijay cover in 26 hours?
1. 1474 km
2. 1562 km
3. 1572 km
4. 1638 km
Que. 14 Suraj covers a distance of 18 km in 12 minutes. If his speed decreases by 30 km/hr, then how much time
will Suraj take to cover the same distance?
1. 12 minutes
2. 16 minutes
3. 20 minutes
4. 18 minutes
Que. 15 Raju travels at half of his usual speed and reaches his office 24 minutes late than his usual time. If Raju
travels at his usual speed, then what will be the time taken by him to reach his office?
1. 64 minutes
2. 60 minutes
3. 48 minutes
4. 56 minutes
Que. 16 A bike covers a certain distance at a speed of 56 km/hr in 16 hours. How much time it will take to cover
the same distance at the speed of 64 km/hr?
1. 14 hr
2. 18 hr
3. 16 hr
4. 12 hr
Que. 17 A person covers a distance of 390 km in 3.25 hours. His speed, in m/sec, is:
1. 33 13
2. 24
3. 30 23
4. 25
Que. 18 The ratio of lengths of trains A and B is 5 : 3 and the ratio of their speeds is 2 : 3. Moving in the opposite
direction, it took minutes for Train A to cross B. The time (in minutes) taken by A to cross a stationary
pole is:
2 12
1. 2
2. 3
3. 125
32
4. 25
16
Que. 19 Mohit starts moving from place A and reaches place B in 12 hours. He covers 1 / 5th part of the total
distance at the speed of 6 km / hr and covers the remaining distance at the speed of 8 km / hr. What is the
distance between A and B?
1. 90 km
2. 95 km
3. 60 km
4. 75 km
Que. 20 A car covers a certain distance at a speed of 48 km/hr in 14 hours. How much time will it take to cover the
same distance at the speed of 84 km/hr?
1. 6 hr
2. 8 hr
3. 9 hr
4. 12 hr
Que. 21 If a person is driving a car at a speed of 30 m / s, then in how much time person will cover a distance of
1620 km?
1. 54 hr
2. 15 hr
3. 13 hr
4. 12 hr
Que. 22 Anil goes to his office at the speed of 35 km / hr and returns to his home at the speed of 30 km / hr. If he
takes total 39 hours, then what is the distance between his office and home?
1. 420 km
2. 525 km
3. 630 km
4. 210 km
Que. 23 Puneet goes to his office at the speed of 60 km/hour and returns to his home at the speed of 90 km/hr.
What will be the average speed of Puneet for the whole journey?
1. 20 km/hr
2. 25 km/hr
3. 72 km/hr
4. 30 km/hr
Que. 24 Piyush is running at the speed of 8 km/hour and he stops for 5 minutes to take rest at the end of every third
km. What will be the time taken by Piyush to cover a distance of 56 km?
1. 7 hour
2. 8 hour 20 minutes
3. 8 hour
4. 8 hour 30 minutes
Que. 25 Two cars A and B travel from one city to another, at speeds of 40km/hour and 50 km/hour respectively. If
car B takes 2.5 hours lesser time than car A for the journey, then the distance (in km) between the two
cities is?
1. 600
2. 500
3. 400
4. 300
Que. 26 Mohit goes to his office at the speed of 10 m/s and returns to his home at the speed of x km/hr. If the
average speed of Mohit for the whole journey is 12 m/s, then what is the value of x?
1. 25 km/hr
2. 15 km/hr
3. 36 km/hr
4. 54 km/hr
Que. 27 If Rohit can cover a distance of 1188 km in 22 hours, then what is the speed of Rohit?
1. 54 m/s
2. 25 m/s
3. 15 m/s
4. 48 m/s
Que. 28 To cover a distance of 90 km in 1 hour 15 minutes what should be the average speed of the car in meters /
second?
1. 10
2. 15
3. 20
4. 25
Que. 29 A taxi going at 60 km / hr takes 25 minutes to travel a certain distance. By how much should it increase its
speed (in km / hr) to travel the same distance in 15 minutes?
1. 60
2. 40
3. 80
4. 20
Que. 30 A man travels 75 km at speed 25 km/h and next 60 km at 20 km/h and thereafter travel 90 km at 15 km/h.
His average speed is;
1. 15 km/h
2. 18.75 km/h
3. 20.25 km/h
4. 25.5 km/h
Que. 31 A bus covers a distance of 10 km in 12 minutes. If its speed is decreased by 25 km/h then the time (in
minutes) take by the bus to cover the same distance is:
1. 15
2. 13
3. 36
4. 24
Que. 32 A and B move towards each other at the same time at the speeds of 10 km/h and 20 km/h, respectively and
the distance between them is 49 km. How much is the distance between them, in m, 5 minutes before they
meet?
1. 2500
2. 1600
3. 1800
4. 2000
Que. 33 A train X travelling at 72 km/h crosses another train Y travelling at 63 km/h (in opposite direction) in 18
seconds. If the length of train Y is two-third the length of X, the length of train X is:
1. 420 m
2. 300 m
3. 405 m
4. 270 m
Que. 34 A person travels a certain distance at a speed of 18 km/h and returns to the starting point at 12 km/h. If he
takes 2 hours 55 minutes for the whole journey, the distance one way is:
1. 18 km
2. 21 km
3. 24 km
4. 25 km
Que. 35 The distance between two stations, A and B, is 575 km, A train from station ‘A’ at 3.00 p.m and moves
towards station ‘B’ at an average speed of 50 km/h. Another train starts from station ‘B’ at 3.30 p.m and
moves towards station ‘A’ at an average speed of 60 km/h, how far from station ‘A’ will the trains meet?
1. 325 km
2. 300 km
3. 275 km
4. 225 km
Que. 36 A wheel covers a distance of 1,100 cm in one round. The diameter of the wheel is:
1. 125 cm
2. 100 cm
3. 350 cm
4. 150 cm
Que. 37 A train X travelling at 60 km/h overtakes another train Y, 225 m long, and completely passes it in 72
seconds. If the trains had been going in opposite directions, they would have passed each other in 18
seconds. The length (in m) of X and the speed (in km/h) of Y are, respectively:
1. 255 and 36
2. 255 and 40
3. 245 and 54
4. 245 and 45
Que. 38 Amit travelled a distance of 50 km in 9 hours. He travelled partly on foot at 5 km/h and partly by bicycle at
10 km/h. The distance travelled on the bicycle is:
1. 11 km
2. 13 km
3. 10 km
4. 12 km
Que. 39 X and Y are two stations which are 280 km apart. A train starts at a certain time form X and travels
towards Y at 60 km/h. After 2 hours, another train starts from Y and travels towards X at 20 km/h After
how many hours does the train leaving from X meets the train which left from Y?
1. 4 hours
2. 3 hours
3. 6 hours
4. 2 hours
Que. 40 The two trains leave Varanasi for Lucknow at 11:000 am and at 11:30 am. Respectively and travel at a
speed of 110 km/h and 140 km/h respectively. How many kilometres from Varanasi will both trains meet?
km 1. 255 13
km 2. 246 13
km 3. 238 23
km 4. 256 23
Que. 41 A train travels 50% faster than a car. Both start at the same point and meet after travelling 360 km in
12hours. In between, the train stopped for a couple of hours at a station due to engine failure. What is the
speed of the train?
1. 72 km/h
2. 90 km/h
3. 60 km/h
4. 80 km/h
Que. 42 Two cars A and B leave Delhi 8:30 a.m. and at 9 a.m. for Shimla, respectively. They travel at the speeds of
40km/h and 50 km/h respectively. How many kilometres away from Delhi will the two cars be together?
1. 200 km
2. 45 km
3. 5 km
4. 100 km
Que. 43 Two cyclists X and Y start at the same time from place A and go towards place B at a speed of 6 km/h and
8 km/h, respectively. Despite stopping for 15 minutes during the journey, Y reaches 10 minutes earlier
than X. The distance between the places A and B is:
1. 6 km
2. 16.5 km
3. 10 km
4. 8 km
Que. 44 A train 'B' speeding with 100 kmph crosses another train C, running in the same direction, in 2 mins. If the
length of the train B and C be 150m and 250m respectively, what is the speed of the train C (in kmph)?
1. 75
2. 88
3. 95
4. 110
Que. 45 A man travels 450 km to his home partly by train and partly by car. He takes 8 hrs 40 mins if he travels
240 km by train and rest by car. He takes 20 mins more if he travels 180 km by train and the rest by car.
The speed of the car in km/hr is
1. 45
2. 50
3. 60
4. 48
Que. 46 A car can finish a certain journey in 10 hours at a speed of 42 kmph. In order to cover the same distance in
7 hours, the speed of the car (km/h) must be increased by:
1. 12
2. 15
3. 18
4. 24
Que. 47 On a river, Q is the mid-point between two points P and R on the same bank of the river. A boat can go
from P to Q and back in 12 hours, and from P to R in 16 hours 40 min. How long would it take to go from
R to P?
1. 3 hr 13
2. 5 hr
3. 6 hr 23
4. 7 hr 13
Que. 48 A train crosses a platform 180 m long in 60 sec at a speed of 72 km/h. the time taken by the train to cross
an electric pole is:
1. 5.1 sec
2. 51 sec
3. 5.1 min
4. 0.51 min
Que. 49 Three runners A,B and C run a race, with runner A finishing 12 meters ahead of runner B and 18 meters
ahead of runner C, while runner B finishes 8 meters ahead of runner C. Each runner travels the entire
distance at a constant speed. The length of the race is
1. 36 Metres
2. 48 Metres
3. 60 Metres
4. 72 Metres
Que. 50 Due to inclement weather, an aeroplane reduced its speed by 300 Km/hr and reached the destination of
1200 km late by 2 hrs. Then the schedule duration of the flight was.
1. 1 hour
2. 1.5 hour
3. 2 hour
4. 2.5 hour
Que. 51 A man can cover a certain distance in 3 hours 36 minutes if he walks at a rate of 5 Km/hr. If he covers the
same distance on cycle at the rate of 24 Km/hr, then the time taken by him in minutes is
1. 40
2. 45
3. 50
4. 55
Que. 52 A bus travels 150 Km in 3 hours and then travel next 2 hours at 60 Km/hr. Then the average speed of the
bus will be
1. 55 Km/hr
2. 54 Km/hr
3. 50 Km/hr
4. 60 Km/hr
Que. 53 A car travels from A to B with 40 Km/h and returns from B to A with 60 Km/h. Its average speed during
the whole journey is
1. 48 km/h
2. 50 km/h
3. 45 km/h
4. 60 km/h
Que. 54 A student takes 1.25 hours to travel from home to school at a speed of 4km/h. By what percentage should
he increase his speed to reduce the time by 25% to cover the same distance from school to home?
1. 50%
2. 25%
3. 45%
4. 33 % 13
Que. 55 A and B are 15 kms apart and when travelling towards each other meet after half an hour whereas they
meet two and a half hours later if they travel in the same direction. The faster of the two travels at the
speed of
1. 15 km/hr
2. 18 km/hr
3. 10 km/hr
4. 8 km/hr
Que. 56 A man travels some distance at a speed of 12 km/hr and returns at a speed of 9 km/hr. If the total time
taken by him is 2 hrs 20 min, the distance is
1. 35 Km
2. 21 Km
3. 9 Km
4. 12 Km
Que. 57 Rubi goes to a multiplex at the speed of 3 km/hr to see a movie and reaches 5 minutes late. If she travels at
the speed of 4 Km/hr she reaches 5 minutes early. Then the distance of the multiplex from her starting
point is
1. 2 km
2. 5 km
3. 2 m
4. 5 m
Que. 58 Two donkeys are standing 400 meters apart. First donkey can run at a speed of 3 m/sec and the second can
run at 2 m/sec. If two donkeys run towards each other after how much time (in sec) will they bump into
each other?
1. 60
2. 80
3. 400
4. 40
Que. 59 The distance between two stations, A and B, is 428 km. a train starts from station ‘A’ at 6:00 a.m and
moves towards station ‘B’ at an average speed of 48 km/h. Another train starts from station ‘B’ at 6:20 a.m
and moves towards statin ‘A’ at an average speed of 55 km/h. At what time will the trains meet?
1. 10:00 a.m.
2. 10.:40 a.m.
3. 10:20 a.m.
4. 9:40 a.m.
Que. 60 A train takes hours less for a journey of 300 km, if its speed is increased by 20 km/h from its usual
speed. How much time will it take to cover a distance of 192 km at its usual speed?
2 12
1. 2.4 hours
2. 4.8 hours
3. 3 hours
4. 6 hours
Que. 61 Places A and B are 144 km apart. Two cars start simultaneously, one from A and the other from B. If they
move in the same direction, they meet after 12 hours, but if they move towards each other they meet after
9/8 hours. The speed (in km/h) of the car moving at a faster speed is:
1. 70
2. 64
3. 60
4. 72
Que. 62 A square playground measures 1127.6164 sq.m. If a man walks a minute, the time taken by him to
walk one round around it is approximately:
2 9 m
20
1. 50.82 min
2. 54.82 min
3. 54.62 min
4. 50.62 min
Que. 63 Two racers run at a speed of 100 m/min and 120 m/min, respectively. If the second racer takes 10 minutes
less than the first to complete the run, then how long is the race?
1. 6 km
2. 4 km
3. 2 km
4. 1 km
Que. 64 A and B start moving towards each other from places X and Y respectively, at the same time. The speed of
A is 20% more than that of B. After meeting on the way. A and B take hours and x hours now to reach
Y and X respectively. What is the value of x?
2 12
1. 3 25
2. 3 35
3. 3 12
4. 3 23
Que. 65 A train crosses a pole in 12 sec, and a bridge of length 170 m in 36 sec. Then the speed of the train is:
1. 30.75 km/h
2. 25.5 km/h
3. 32.45 km/h
4. 10.8 km/h
Que. 66 Two trains are moving in opposite directions with speeds of 35 m/s and 45 m/s respectively. From the time
they are 12 km apart, how much time would they take to cross each other?
1. 2 minutes 30 seconds
2. 2 minutes
3. 3 minutes
4. 3 minutes 30 seconds
Que. 67 A train’s average speed is 72 km/h but is reduced to 60 km/h due to stoppages. For how much time does
the train stop in an hour?
1. 10 minutes
2. 12 minutes
3. 15 minutes
4. 8 minutes
Que. 68 How long (in seconds) will a train of a length 320 m, running at a speed of 67 km/h, take to cross a man
moving in the opposite direction at a speed of 5 km/hr?
1. 18.5
2. 16
3. 15
4. 17.5
Que. 69 A person covered 50% of a certain distance at 2 km/h, 25% of the distance at 4 km/h and the remaining
distance at 8 km/h. His average speed (in km/h) for the entire journey was:
1. 32/13
2. 16/3
3. 32/11
4. 14/3
Que. 70 Twice the speed of a is equal to thrice the speed of B. to travel a certain distance, A takes 42 minutes less
than B to travel the same distance. What is the time (in minutes) taken by B to travel the same distance?
1. 126
2. 135
3. 120
4. 96
Que. 71 Two trains cross each other in 12 seconds when they travel in opposite directions and they take 60 seconds
when they travel in the same direction. The possible speeds of the trains, (in m/sec), can be:
1. 15, 45
2. 18, 40
3. 15, 30
4. 30, 20
Que. 72 Alok starts walking from P with a speed of 6 km/h towards Q. Raman starts time from P towards Q with a
speed of 9 km/h. Raman reaches Q, turns back and starts walking towards P. He meets Alok at R. If PQ is
15 km, then what is PR?
1. 20 km
2. 12 km
3. 15 km
4. 18 km
Que. 73 A train leaves P at 9 am with a speed of 30 km/h. another train leaves Q at 11 am with the speed of 45
km/h. The trains are travelling towards each other on parallel tracks. Distance between P and Q is 300 km.
When they meet, what is the ratio of the distances covered by them?
1. 8 : 5
2. 13 : 12
3. 17 : 14
4. 11 : 9
Que. 74 The ratio of speeds of two aeroplanes is 7 : 15. If the first flight covers a distance of 1050 km in 3 hours,
then what is the speed of the 2nd flight
1. 720 km/h
2. 900 km/h
3. 675 km/h
4. 750 km/h
Que. 75 A man starts off a journey. He travelled for 16 hours in total. First half of the distance was covered at 40
km/h and the second half at 60 km/h. What was the distance covered?
1. 768 km
2. 576 km
3. 384 km
4. 960 km
Que. 76 If a student walks with speed 30% more than the usual speed, he reaches 15 min earlier to his destination.
How much time (in minutes) does he take to reach his destination normally?
1. 45
2. 65
3. 50
4. 39
Que. 77 A train crosses two platforms of length 1000 m and 600 m in 80 seconds and 60 seconds respectively.
What is the length of the train?
1. 720 m
2. 600 m
3. 540 m
4. 400 m
Que. 78 A man travels from P to Q at the speed of 60 km/h and travels from Q to P at the speed of 90 km/h. What
is the average speed of the man for the whole journey?
1. 75 km/h
2. 78 km/h
3. 70 km/h
4. 72 km/h
Que. 79 A and B, start from X and Y towards Y and X respectively. After passing each other, they take 2.7 hours
and 1.2 hours to reach Y and X respectively. If B is moving at 48 km/hr, then the speed of A is.
1. 32
2. 36
3. 40
4. 30
Que. 80 A train whose average speed is 54 km/h, covers a distance in 200 min. At what speed (in km/h) should it
run to reduce the journey time to 90 min?
1. 120
2. 180
3. 60
4. 220
Que. 81 A car travels for 6 hours at different speeds. For the first two hours at 60 m/s, for the next 2 hours at 50 m/s
and for the remaining time at x m/s. If the average speed for the entire journey is 52 m/s, what is the value
of x?
1. 46
2. 44 12
3. 45 12
4. 48
Que. 82 The speed of a train is 3 times that of a car and 1.5 times of a steamer. A person travelled x km by steamer,
3.75x km by train and x/2 km by car. If the speed of the car is 40 km/h and total time taken by him is
hours, then the total distance travelled by him in three modes is: 4 12
1. 450 km
2. 520 km
3. 480 km
4. 420 km
Que. 83 Speed of a car is 20 m/s. How much distance (in km) will the car travel in 2.5 hours?
1. 144
2. 72
3. 180
4. 108
Que. 84 A man leaves from P at 6 AM and reaches Q at 2 PM on the same day. Another man leaves Q at 8 AM and
reaches P at 3 PM on the same day. At what time do they meet?
1. 11 : 46 AM
2. 11 : 24 AM
3. 10 : 48 AM
4. 11 : 00 AM
Que. 85 A travels 15 km with a speed of 30 km/h. He travels another 25 km with a speed of 10 km/h. What is his
average speed for the entire journey?
1. 40/3 km/h
2. 80/3 km/h
3. 20 km/h
4. 12 km/h
Que. 86 A man travels a distance of 4 km every day. One day he increases his speed by 0.8 km/h than usual speed
and reaches his destination 15 minutes earlier. What is the normal speed of the man?
1. 3.6 km/h
2. 4.0 km/h
3. 3.2 km/h
4. 3.0 km/h
Que. 87 A train goes from P to Q with an average speed of u km/h and returns from Q to P with an average speed
of v km/h. What is its average speed for the entire journey in km/h?
1. 2uv
u+v
2. u2+v2
2
−−−−
√
3. u+v
2
4. √uv
Que. 88 A train takes 1 minute to cross a stationary pole. How much time (in seconds) will it take to cross a bridge
whose length is twice that of the train?
1. 180
2. 120
3. 150
4. 90
Que. 89 The average speed of a car is 600 metres/minute. How much slower (in metres/second) does the car run
than a sprinter who covers 100 metres in 9.6 seconds?
1. 1/2
2. 5/24
3. 7/12
4. 5/12
Que. 90 Speed of a man is 45 km/h. In how much time (in seconds) will he cover a distance of 225 metres?
1. 16
2. 18
3. 24
4. 22
Que. 91 A 600 metre long train can cross a 1200 metre long platform in 36 seconds. In how much time (in seconds)
can it cross a bridge 2200 metres long?
1. 44
2. 52
3. 56
4. 48
Que. 92 A train crosses a 600 metres long platform in 50 seconds. It crosses another 900 metres long platform in 60
seconds. What are the length and the speed of the train?
1. 900 metres, 108 km/h
2. 900 metres, 96 km/h
3. 600 metres, 108 km/h
4. 700 metres, 96 km/h
Que. 93 A and B start moving from a place X and Y and Y to X, respectively, at the same time on the same day.
After crossing each other, they complete their remaining journey in hours and X hours, respectively. If
the ratio of the speeds (in km/h) of A and B is 9 : 7, then what is the value of x?
5 49
1. 8 12
2. 9
3. 7
4. 7 12
Que. 94 A train, 700 m long crosses a pole in 35 seconds. How much time does it take to cross a platform of length
740 m?
1. 1 min 12 sec
2. 1 min 20 sec
3. 1 min 24 sec
4. 1 min 30 sec
Que. 95 The speed of a car is 36 km/h. How much time (in minutes) will a bus traveling at one-fifth of the speed of
the car take to cover a distance of 900 m?
1. 8 12
2. 10 12
3. 7 12
4. 5 12
Que. 96 A train crosses a stationary pole in 3 minutes. It crosses a 600 meter long platform in 5 minutes. What are
the length and the speed of the train?
1. 900 m, 18 km/h
2. 900 m, 15 km/h
3. 3600 m, 18 km/h
4. 1200 m, 15 km/h
Que. 97 A person goes from A to B with a speed of 30 km/h. He comes back from B to A with a speed of 20 km/h.
What is his average speed for the entire journey?
1. 27.5 km/h
2. 26.5 km/h
3. 25 km/h
4. 24 km/h
Que. 98 A car can cover a distance of 42 km in 7 hours. By how much the speed has to be increased to cover the
same distance in 6 hours?
1. 7.5 km/h
2. 5 km/h
3. 1 km/h
4. 8 km/h
Que. 99 The ratio of speeds of two aeroplanes is 11 : 18. If the first aeroplane covers a distance of 1650 km in 3
hours, then what is the speed (in m/s) of the second aeroplane?
1. 225
2. 200
3. 270
4. 250
Que. 100 A man on a tour travels first 360 km by train at 72 km/h, the next 160 km on a motor cycle at 12.80 km/h,
and the last 200 km by a bicycle at 16 km/h. Ignoring the buffer times between the different modes of
travel, what is the average speed (in m/s) of his tour?
1. 4.33
2. 5.67
3. 6.67
4. 7.33
Que. 101 A car can cover a distance of 18 km in 24 minutes. The speed of a bus is twice that of the car. In how
many minutes can the bus cover a distance of 135 km?
1. 90 minutes
2. 48 minutes
3. 50 minutes
4. 75 minutes
Que. 102 A train crosses a 900 metres long platform in 300 seconds. If the length of train is 600 meters, then in
how much time does it cross a stationary pole?
1. 2 minutes
2. 3 minutes
3. 5 minutes
4. 4 minutes
Que. 103 A travels a certain distance with three different speeds; first 3 km with a speed of 9 km/h, second 6 km
with a speed of 15 km/h, and third 9 km with a speed of 18 km/h. What is the average speed of A for the
whole journey?
1. 460 km/h
37
2. 540 km/h
37
3. 660 km/h
37
4. 480 km/h
37
Que. 104 A car can travel a distance of 300 meters in 6 minutes. What is its average speed in km/h?
1. 50
2. 6
3. 12
4. 3
Que. 105 A train X running at 72 km/h crosses another train Y running at 54 km/h in opposite direction in 15
seconds. If the length of Y is two-fifth that of X, then what is the length (in meter) of X?
1. 375
2. 150
3. 300
4. 225
Que. 106 A student covers a distance by cycle at 6 km/h. He returns to the starting point in a bus at a speed of 42
km/h. The average speed (in km/h) for the entire journey is:
1. 12.75
2. 24
3. 10.25
4. 10.5
Que. 107 A man is walking at a speed of 12 km per hour. After every kilometre, he takes rest for 4 minutes. How
much time (in minutes) will he take to cover a distance of 8 kilometres?
1. 68
2. 72
3. 64
4. 60
Que. 108 A train travelling at the speed of 108 km/h crosses a pole in 32 seconds. Find the length (in m) of the
train.
1. 1240
2. 960
3. 1024
4. 1200
Que. 109 A fighter plane travels at 1440 km/h. How many meters does it travel in one second?
1. 385
2. 394
3. 400
4. 374
Que. 110 A train crosses a stationary object in 25 sec. What is the length of the train if the speed of the train is 25
m/s?
1. 500 m
2. 625 m
3. 300 m
4. 620 m
Que. 111 To travel 612 km, Train A takes 9 hours more than Train B. If the speed of the Train A is doubled, it
takes 3 hours less than Train B. The speed (in km/h) of Train B is:
1. 1.2 km/h
2. 51 km/h
3. 30.6 km/h
4. 40.8 km/h
Que. 112 A sport car going at an average speed of 108 km/h takes 15 minutes to complete a lap on a racing track.
How much speed (in km/h) should be increased to complete the lap in 9 minutes?
1. 100
2. 180
3. 108
4. 72
Que. 113 A motor car moves at a speed of 72 km/h and 54 km/h after and before repairing respectively. It covers X
distance in 6 hours after repairing. How much time (in hours) will it take to cover 5X distance before
repairing?
1. 30
2. 40
3. 45
4. 36
Que. 114 A bus covers first 200 km of a journey in 4 hours and the next 600 km in 6 hours. What is the average
speed of the bus for the whole journey?
1. 60 km/h
2. 80 km/h
3. 100 km/h
4. 90 km/h
Que. 115 A train moves at the speed of 80 km/h and crosses a platform in 0.75 minutes. If the length of the train is
equal to the length of the platform, then what is the length of the platform?
1. 400 m
2. 500 m
3. 450 m
4. 480 m
Que. 116 A took 10 minutes more than B in covering a certain distance. If their speeds are in the ratio 3 : 4, then
what is the time taken by B to cover the same distance?
1. 50 minutes
2. 20 minutes
3. 40 minutes
4. 30 minutes
Que. 117 A man goes from C to D at 40 km/h and he returns from D to C at x km/h. If the average speed of the
man for the whole journey is 60 km/h, then what is the value of x?
1. 100
2. 120
3. 80
4. 110
Que. 118 A train starts from A at 6 AM and reaches B at 11 AM on the same day. Another train starts from B at 8
AM and reaches A at 3 PM on the same day. At what time the two trains will have crossed each other?
1. 7:45 AM
2. 10:30 AM
3. 8:45 AM
4. 9:45 AM
Que. 119 A train with 72 km/h speed crosses a stationary pole in 35 seconds. How much time (in minutes) does it
take to cross a 1.1 km long bridge?
1. 3
2. 1.5
3. 2.5
4. 2
Que. 120 A bus covers a distance of 1.8 km in 3 minutes. How much faster (in m/s) is it than a young athlete who
runs 200 m in 25 s?
1. 2
2. 1
3. 2.5
4. 1.5
Que. 121 A woman travelling at 130% of her usual speed reached her office 12 minute early. Her usual time to
cover the journey is:
1. 0.87 hr
2. 0.48 hr
3. 2 hrs
4. 1 hr
Que. 122 A train takes 1 hour 10 min to travel between two stations P and Q. If it travels at 5/7 of its usual speed,
what time will it take to travel between P and Q?
1. 1 hr, 40 min
2. 1 hr, 50 min
3. 1 hr, 38 min
4. 50 min
Que. 123 A person travelled from station A to station B at 40 km/h and from B to A at 30 km/h. The entire journey
took 6.3 hours. What is the distance (in km) between A and B?
1. 117
2. 108
3. 99
4. 91
Que. 124 If Abhi travels a certain distance at 6 km/h, he reaches his destination 12 minutes early, but if he travels at
4 km/h, he reaches his destination 10 minutes late. The speed (in km/h) at which he should travel to reach
his destination on time is ______.
1. 4 37
2. 4 57
3. 5 44
4. 5 18
Que. 125 A train of length 342 m is running at 54 km/h. In how much time (in seconds) will it cross a bridge of
length 438 m?
1. 48
2. 50
3. 54
4. 52
Que. 126 The speed of a train is times the speed of a car. The car covers 486 km in 9 hours. How much distance
will the train cover in 6 hours?
2 16
1. 612 km
2. 702 km
3. 732 km
4. 712 km
Que. 127 Ranjeet drives his car at an average speed of 50 km/hr and reaches his destination in 8 hours. Rahman
covers the same distance in 5 hours. If Ranjeet increases his speed by 10 km/hr and Rahman increases his
speed by 20 km/hr, then what will be the difference in time taken by them to reach their destination?
1. 2 hours 30 minutes
2. 3 hours 40 minutes
3. 3 hours 20 minutes
4. 2 hours 40 minutes
Que. 128 The speed of train A is 16 km/h less than the speed of train B. To cover a distance of 384 km, B takes 4
hours less time than A. What is the speed (in km/h) of train B?
1. 50
2. 45
3. 48
4. 32
Que. 129 A person takes 40 minutes more than his usual time when he covers a distance of 20 km at 5 km/h. If he
covers the same distance at 8 km/h, he takes x minutes less than the usual time. What is the value of x?
1. 50
2. 48
3. 54
4. 45
Que. 130 A and B started traveling towards each other at the same time, from places X to Y and Y to X,
respectively. After crossing each other, A and B took 2.45 hours and 4.05 hours to reach Y and X,
respectively. If the speed of B was 8.4 km/h, then what was the speed (in km/h) of A?
1. 10.8
2. 9.9
3. 11.7
4. 12.6
Que. 131 A train of length 212 m is running at 45 km/h. In what time (in seconds) will it cross a platform of length
188 m?
1. 36
2. 42
3. 32
4. 40
Que. 132 A person travels a distance of 240 km, partly by train and the rest by bus. He takes hours if he travels
150 km by train and the rest by bus. If he travels 140 km by bus and the rest by train, he takes hours.
What is the speed of the train?
3 12
3 23
1. 70 km/h
2. 75 km/h
3. 72 km/h
4. 80 km/h
Que. 133 Two trains running in opposite directions on parallel tracks, at speeds of 42 km/h and 57 km/h take 18
seconds to cross each other. If the length of one train is 270 m, then the length of the other train is:
1. 250 m
2. 225 m
3. 230 m
4. 242 m
Que. 134 The average run rate of a cricket team during the first 20 overs is 4.5. What should be the asking rate per
over for the next 30 overs, if it has to chase a target of 282 runs in total?
1. 6.0
2. 6.4
3. 6.3
4. 6.8
Que. 135 The speed of two railway engines is in the ratio 5 : 4. If they move on parallel tracks in the same direction
and if the slower engine is ahead of the faster engine by 8 km when the latter starts, then how far will the
faster engine have to travel before it overtakes the slower one?
1. 36
2. 32
3. 48
4. 40
Que. 136 A person has to travel a distance of 30 km. he finds that he has covered 5/6 of the distance in 3 hours and
20 minutes. What is his speed in km/h?
1. 6.3
2. 7.5
3. 5.4
4. 6
Que. 137 Walking at 60% of his usual speed, a man reaches his destination 1 hour 40 minutes late. His usual time
(in hours) to reach the destination is:
1. 3 14
2. 3 18
3. 2 14
4. 2 12
Que. 138 To cover a distance of 416 km, a train A takes hours more than train B. If the speed of A is doubled, it
would take hours less than B. What is the speed (in km/h) of train A?
2 23
1 13
1. 54
2. 56
3. 52
4. 65
Que. 139 A person covers 40% of the distance from A to B at 8 km/h, 40% of the remaining distance at 9 km/h and
the rest at 12 km/h. His average speed (in km/h) for the journey is:
1. 9 58 2. 9 23
3. 9 3
8
4. 9 13
Que. 140 Train A which was travelling at 50 km/h crosses train B travelling in opposite direction in 15 seconds. If
the length of train B is three times the length of A and the speed of train B was 58 km/h, then the length
of train A(in m) is∶
1. 150
2. 112.5
3. 210
4. 124.5
Que. 141 A man starts from his house and travelling at 30 km/h, he reaches his office late by 10 minutes, and
travelling at 24 km/h, he reaches his office late by 18 minutes. The distance (in km) from his house to his
office is∶
1. 12
2. 16
3. 20
4. 18
Que. 142 Places A and B are 396 km apart. Train X leaves from A for B and train Y leaves from B for A at the
same time on the same day on parallel tracks. Both trains meet after hours. The speed of Y is 10 km/h
more than that of X. What is the speed (in km/h) of Y?
5 12
1. 54
2. 31
3. 41
4. 56
Que. 143 Travelling at 60 km/h, a person reaches his destination at a certain time. He covers 60% of his journey in
2/5th of the time. At what speed (in km/h) should he travel to cover the remaining journey so that he
reaches the destination right on time?
1. 42
2. 48
3. 40
4. 36
Que. 144 A train travelling at the speed of x km/h crossed a 200 m long platform in 30 seconds and overtook a man
walking in the same direction at the speed of 6 km/h in 20 seconds. What is the value of x?
1. 50
2. 56
3. 54
4. 60
Que. 145 A and B started their journeys from X to Y and Y to X, respectively. After crossing each other, A and B
completed the remaining parts of their journeys in h and 8 h respectively. If the speed of B is 28 km/h,
then the speed (in km/h) of A is:
6 18
1. 42
2. 40
3. 32
4. 36
Que. 146 The ratio between the speeds of two trains is 2 : 5. If the first train runs 250 km in 5 h, then the difference
between the speeds (in km/h) of both the trains is:
1. 150
2. 75
3. 180
4. 65
Que. 147 The ratio between the speeds of two trains is 5 ∶ 7. If the first train covers 300 km in 3 hours, then the
speed (in km/h) of the second train is:
1. 150
2. 140
3. 100
4. 120
Que. 148 A boy standing by the side of a railway track finds that an Up train crosses him in 8 seconds and a Down
train of twice the length of that of the Up train crosses him in 20 seconds. How long (in seconds) will the
two trains take to cross each other?
1. 20 sec
2. 15 sec
sec 3. 12 13
sec 4. 13 13
Que. 149 A train covers a certain distance in 45 minutes. If its speed is reduced by 5 km/h, it takes 3 minutes more
to cover the same distance. The distance (in km) is:
1. 64
2. 54
3. 80
4. 60
Que. 150 The ratio between the speeds of two trains is 2 : 5. If the first train runs 350 km in 5 h, then the difference
between the speeds (in km/h) of both the trains is:
1. 350 km/h
2. 165 km/h
3. 180 km/h
4. 105 km/h
Que. 151 The ratio between the speeds of two trains is 2 : 5. If the first train runs 250 km in 5 h, then the sum of the
speeds (in km/ h) of both the trains is:
1. 150
2. 165
3. 175
4. 180
Que. 152 The platform of a station 400 m long starts exactly where the last span of a bridge 1.2 km long ends. How
long will a train 200 m long and travelling at the speed of 72 km/h take to cover the distance between the
starting point of the span of the bride and the far end of the platform?
1. 1.6 min
2. 1.8 min
3. 1.5 min
4. 1.2 min
Que. 153 The ratio between the speeds of two trains is 5 ∶ 7. If the first train covers 300 km in 3 hours, then the
speed (in km/h) of the second train is:
1. 100
2. 120
3. 140
4. 150
Que. 154 Two trains of same length are running on parallel tracks in the same direction at 54 km/h and 42 km/h
respectively. The faster train passes the other train in 60 seconds. What is the length (in metres) of each
train?
1. 100
2. 81
3. 90
4. 210
Que. 155 A person covers 40% of a distance with a speed of 60 km/h and the remaining with a speed of 40 km/h.
what is his average speed for the whole journey in km/h?
1. 500/11
2. 500/13
3. 600/13
4. 600/11
Que. 156 The ratio between the speeds of two trains is 2 ∶ 5. If the first train runs 350 km in 5 hours, then the sum
of the speed (in km/h) of both the trains is:
1. 350
2. 180
3. 245
4. 265
Que. 157 Given that the length of the paths of ball thrown with different speeds by two boys are the same, and that
the average speed for the first and second throws are respectively 90 km/h and 162 km/h. then what is the
time taken by the first throw to cover the length of the same for the second thrown in one second?
1. 2/3 sec
2. 1 sec
3. 9/5 sec
4. 3/2 sec
Que. 158 A train 360 km at a uniform speed. If the speed had been 10 km/h more, it would have taken 3 hours less
for the same journey. What is the speed of the train (in km/h)?
1. 40
2. 25
3. 30
4. 50
Que. 159 A train covers 60 km at a uniform speed. If the speed had been 8 km/h more, it would have taken 10
hours less for the same journey. What is the speed of the train (in km/h)?
1. 4
2. 2.5
3. 5
4. 3
Que. 160 A man travels a certain distance at 12 km/h and returns to the starting point at 9 km/h. The total time
taken by him for the entire journey is hours. The total distance (in km) covered by him is: 2 13
1. 12
2. 24
3. 25
4. 28
Que. 161 A 360 m long train running at a uniform speed, crosses a platform in 55 seconds and a man standing on
the platform in 24 seconds. What is the length (in meter) of the platform?
1. 410
2. 445
3. 480
4. 465
Que. 162 Given that the lengths of the paths of a ball thrown with different speeds by two boys are the same. If they
take 0.6 seconds and 1 second respectively to cover the said length. What is the average speed of travel
for the first throw if the same for the second is 96 km/hr?
1. 160 km/h
2. 150 km/h
3. 100 km/h
4. 200 km/h
Que. 163 A train goes from P to Q with a speed u km/h, then from Q to R (QR = 2PQ) with a speed 3u km/h, and
returns from R to P With a speed u/2 km/h. What is the average speed (in km/h) of the train for the entire
journey starting from P and back to P?
1. 18u/23
2. 3u/2
3. 4u/3
4. 16u/23
Que. 164 The ratio between the speeds of two trains is 2 ∶ 5. If the first train covers 350 km in 5 hours, then the
speed (in km/h) of the second train is:
1. 165
2. 150
3. 175
4. 180
Que. 165 Two trains of equal length travelling in opposite directions at 72 km/h and 108 km/h cross each other in
10 second. In how much time (in seconds) does the first train cross a platform of length 350 m?
1. 32
2. 36
3. 24
4. 30
Que. 166 Train x running at 84 km/h crosses another train y running at 52 km/h in opposite direction in 12 seconds.
If the length of train y is two-third that of x then find the length of train x.
1. 250 m
2. 408 m
3. 272 m
4. 242 m
Que. 167 boy increases his speed to times of his original speed. By this he reaches his school 30 minutes before
the usual time. How much time does he takes usually?
95
1. 67.75 minutes
2. 67.50 minutes
3. 67.25 minutes
4. 67.10 minutes
Que. 168 The speed of a car increases by 2 km/h after every one hour. If the distance travelled in the first one hour
was 35 km, what was the total distance travelled in 12 hours?
1. 560 km
2. 650 km
3. 558 km
4. 552 km
Que. 169 A train 100 m long running at uniform speed crosses a station which is 500 m long in 25 seconds. How
long will it take for the train to pass a station that is 380 m long?
1. 21 seconds
2. 20 seconds
3. 19 seconds
4. 22 seconds
Que. 170 A part of the journey is covered in 31.5 minutes at 80 km/h and the remaining part in 16 minutes at 75
km/h. The total distance of the journey is∶
1. 45 km
2. 38 km
3. 62 km
4. 54 km
Que. 171 A boy walks 15 m in 7 seconds and then walks back in 5 seconds. His average speed (in m/s) is∶
1. 6
2. 2.5
3. 3.25
4. 4
Que. 172 If an airplane covers a distance of 980 km in 35 minutes then in what time it will cover a distance of 1470
km.
1. 1/2 hours
2. 1 hours 18 3. 7/8 hours
1
4. 1 hours 6
Que. 173 A train travels at a speed of 76 km/h. If it crosses a pole in 36 seconds, the length of the train is∶
1. 720 m
2. 675 m
3. 760 m
4. 630 m
Que. 174 A 230 m long train has to cross a platform of length 750 m. If the train is running at a speed of 72 km/h,
the time taken is:
1. 49 seconds
2. 58 seconds
3. 64 seconds
4. 72 seconds
Que. 175 A bucket is drawn from a well by means of a rope which is wound around a wheel of radius 48 cm. If the
bucket ascends in 1 minute 12 seconds at a speed of 1.2 m/sec, find the length of the rope.
1. 8.64 cm
2. 86.4 cm
3. 864 cm
4. 8640 cm
Que. 176 A man covers the first 210 km of a journey at 60 km/h and the next 198 km at 66 km/h. The average
speed for the whole journey is:
1. 64 km/h
2. 63 km/h
3. 62.8 km/h
4. 68.5 km/h
Que. 177 A drives at the rate of 45 km/h and reaches its destination 4 minutes late. If speed is 60 km/h, A reaches 5
minutes early. The distance travelled by a is:
1. 24 km
2. 21 km
3. 27 km
4. 30 km
Que. 178 The distance between two cities is covered in hours at a speed of 52 km/h. If the speed is increased to
65 km/h, how much time would be saved?
3 14
1. 39 minutes
2. 45 minutes
3. 40 minutes
4. 42 minutes
Que. 179 A boy walks from his house to the park which is 500 m away in 5 minutes and walks backs in 7 minutes.
His average speed (in km/h) is∶
1. 1
2. 12
3. 5
4. 2.5
Que. 180 A girl walks to school from her house at 5 km/h speed for 24 minutes and cycles back the same distance
at 8 km/h. The time taken to cycle back is∶
1. 8 minutes
2. 10 minutes
3. 21 minutes
4. 15 minutes
Que. 181 If a train runs with the speed of 52 km/h, it reaches its destination late by 15 minutes. However. If its
speed is 65 km/h, it is late by 5 minutes only. The right time for the train to cover its journey is∶
1. 45 minutes
2. 40 minutes
3. 35 minutes
4. 30 minutes
Que. 182 If a train runs with the speed of 36 km/h, it reaches its destination 15 minutes late. However, if its speed is
45 km/h, it is late by only 4 minutes. The correct time to cover its journey in minutes is∶
1. 22
2. 27
3. 25
4. 40
Que. 183 A and B are at a distance of 1.7 km apart and they start running towards each other at a speed of 8 m/s
and 9 m/s respectively. After how much time will take meet each other?
1. 1 minutes 40 seconds
2. 1 minutes 4 seconds
3. 14 minutes
4. 14 seconds.
Que. 184 A goes to a mall from his house on a cycle at 8 km/h and comes back to his house on a cycle at 6 km/h. If
he takes 1 hour 10 minutes in all, what is the distance between his house and the mall?
1. 8 km
2. 4 km
3. 5 km
4. 6 km
Que. 185 If a train runs with the speed of 48 km/h, it reaches its destination late by 12 minutes. However. If its
speed in 64 km/h it is late by 3 minutes only. The right time for the train to cover its journey (in minutes)
is∶
1. 20
2. 22
3. 24
4. 18
Que. 186 A starts walking at 4 kmph and after 4 hours, B starts cycling from the same point as that of A, in the
same direction at 10 kmph. After how much distance from the starting point will B catch up with A
(Correct to two decimal places)?
1. 25.67 km
2. 24.67 km
3. 23.67 km
4. 26.67 km
Que. 187 Walking 5/7 of his usual speed, a person reaches his office 10 minutes later than the usual time. His usual
time in minutes is∶
1. 35
2. 25
3. 30
4. 28
Que. 188 Walking at 7/9 of his usual speed, a person reaches his office 10 minutes later than the usual time. His
usual time in minutes is:
1. 42
2. 30
3. 35
4. 27
Que. 189 Walking at 3/4 of his usual speed, a person reaches his office 18 minutes late than the usual time. His
usual time in minutes is∶
1. 72
2. 60
3. 45
4. 54
Que. 190 Walking at 3/5 of his usual speed, a person reaches his office 20 minute late than the usual time. His usual
time in minute is:
1. 25
2. 40
3. 30
4. 20
Que. 191 If a train runs at 60 km/h, it reaches its destination 15 minutes late. But, if it runs at 80 km/h, it is late by 7
minutes only. The right time for the train to cover its journey is∶
1. 18 minutes
2. 17 minutes
3. 20 minutes
4. 21 minutes
Que. 192 A train without stoppage travels with an average speed of 80 km/h and with stoppage, it travels with an
average speed of 64 km/h. For how many minutes does the train stop on an average per hour?
1. 7
2. 12
3. 9
4. 8
Que. 193 A train without stoppage travels with an average speed of 72 km/h and with stoppage, it travels with an
average speed of 60 km/h. For how many minutes does the train stop on an average per hour?
1. 6
2. 12
3. 10
4. 8
Que. 194 A train without stoppage travels with an average speed of 80 km/h and with stoppage, it travels with an
average speed of 72 km/h. For how many minutes does the train stop on an average per hour?
1. 7
2. 6
3. 9
4. 8
Que. 195 A train without stoppage travels with an average speed of 70 km/h, and with stoppage, it travels with the
average speed of 56 km/h. How many minutes, does the train stop on an average per hour?
1. 12
2. 16
3. 14
4. 17
Que. 196 A train without stoppage travels with an average speed of 65 km/h and with stoppage, it travels with an
average speed of 52 km/h. For how many minutes does the train stop on an average per hour?
1. 12
2. 14
3. 15
4. 13
Que. 197 The speed of train A is 25 km/h more than the speed of train B. A takes 4 hours less time to travel a
distance of 300 km than what train B takes to travel 250 km. What is the speed (in km/h) of A?
1. 50
2. 65
3. 60
4. 55
Que. 198 A train without stoppage travels with an average speed of 50 km/h, and with stoppage, it travels with an
average speed of 40 km/h. For how many minutes does the train stop on an average per hour?
1. 13
2. 14
3. 12
4. 15
Que. 199 A journey of 96 km takes one hour less by a fast train (A) than by a slow train (B). If the average speed of
B is 16 km/h less than that of A, then the average speed (in km/h) of A is:
1. 64
2. 60
3. 48
4. 54
Que. 200 A train travelling at 44 km/h crosses a man walking with a speed of 8 km/h, in the same direction, in 15
seconds. If the train crosses a woman coming from the opposite direction in 10 seconds, then what is the
speed (in km/h) of the woman?
1. 8.5
2. 9
3. 10.5
4. 10
Que. 201 A truck covers a distance of 384 km at a certain speed. If the speed is decreased by 16 km/h, it will take 2
hours more to covers the same distance. 75% of its original speed (in km/h) is:
1. 42
2. 45
3. 48
4. 54
Que. 202 A person goes to his office at 1/4th of the speed at which he returns from his office. If the average speed
during the whole trip is 15 km/h, then what is the speed of the person while he was going to his office?
1. 15/2 km/h
2. 17/3 km/h
3. 75/8 km/h
4. 9 km/h
Que. 203 A and B are travelling towards each other from the points P and Q respectively. After crossing each other,
A and B take hours and 8 hours, respectively, to reach their destinations Q and P, respectively. If the
speed of B is 16.8 km/h, then the speed (in km/hr) of A is:
6 18
1. 20.4
2. 20.8
3. 19.2
4. 19.8
Que. 204 The distance between two station A and B is 800 km. A train X starts from A and moves towards B at 40
km/h and another trains Y starts from B and moves towards A at 60 km/h. how far from A will they cross
each other?
1. 300 km
2. 320 km
3. 380 km
4. 360 km
Que. 205 A train moves past a pole and a tunnel completely in 3s and 15 s, respectively. The length of the tunnel is
480 m. What is the speed of the train?
1. 4 m/s
2. 40 m/s
3. 30 m/s
4. 60 m/s
Que. 206 Two trains 230 m and 270 m long, are running on parallel tracks in the opposite directions at a speed of
40 km/h and 50 km/h, respectively. What is the time taken by the trains to cross each other completely?
1. 25 s
2. 15 s
3. 20 s
4. 30 s
Que. 207 A 2-m-long scooter moves past a plank completely in 5 s. The length of the plank is 3 m. What is the
speed of the scooter?
1. 2 m/s 25
2. 2 m/s
3. 1 1 m/s
12
4. 1 m/s
Que. 208 Two trains, 200 m and 140 m long, are running on parallel tracks in the opposite directions at a speed of
60 km/h and 30 km/h, respectively. What will be the time taken by the trains to cross each other
completely?
1. 15 s
2. 13 15 s
25
3. 13 5 s
25
4. 14 s
Que. 209 Express the speed of 18 m/s in km/h.
1. 5
2. 32.4
3. 64.8
4. 129.16
Que. 210 An old lady crosses an 800 m long street in 10 min. What is her speed in km/h?
1. 4.8
2. 3.6
3. 5.4
4. 0.6
Que. 211 A 1.5 meter mini tempo moves past a pole in 3 seconds. What is the speed of the tempo?
1. 1 m/s
2. 12 m/s
3. 0.5 m/s
4. 2 m/s
Que. 212 Two trains of length 150 m and 300 m long are going parallel in opposite direction at a speed of 90
m/min and 60 m/min respectively. What is the time taken for the trains to cross each other completely?
1. 1 minute
2. 5 minutes
3. 2 minutes
4. 3 minutes
Que. 213 A takes 30 minutes more than B to cover a distance of 15 km at a certain speed. But if A doubles his
speed, he takes one hour less than B to cover the same distance. What is the speed (in km/h) of B?
1. 5
2. 6 12
3. 6
4. 5 12
Que. 214 A train runs at 54 kmph. If it takes 15 seconds to cross a pole, then what is the length of the train in
meters?
1. 250 m
2. 125 m
3. 370 m
4. 225 m
Que. 215 Two trains of length 140 m and 100 m long are going on a parallel track in same direction at a speed of
90 km/h and 18 km/h respectively. What is the time taken for the trains to cross each other completely?
1. 12 seconds
2. 13 seconds
3. 15 seconds
4. 14 seconds
Que. 216 A person crosses a 700 metres wide road in 120 seconds. What is his speed (in km/hr)?
1. 24
2. 21
3. 36
4. 27
Que. 217 A 600 metres long train is running at the speed of 81 km/hr. If it crosses a platform in 40 seconds, then
what is the length of the platform (in metres)?
1. 220
2. 300
3. 360
4. 410
Que. 218 Ankit runs 324 metres every day for his fitness. According to his daily routine in how many days he
covers 8.1 km.
1. 21
2. 23
3. 25
4. 27
Que. 219 Two trains are moving in opposite directions with the same speed. If the length of each train is 144 metres
and they cross each other in 9 seconds, then what is the speed (in km/hr) of each train?
1. 53
2. 57.6
3. 60.4
4. 64.8
Que. 220 The distance between two cities X and Y is 270 km. First train starts from X at 7:00 a.m. and travels
towards Y at 40 km/hr. Second train starts from Y at 8:30 a.m. and travels towards X at 30 km/hr. At
what time (in a.m.) will both the trains meet?
1. 10:00
2. 11:00
3. 11:30
4. 12:30
Que. 221 Excluding stoppages, the speed of a bus is 80 kmph and including stoppages, it is 60 kmph. For how
many minutes does the bus stop per hour?
1. 12
2. 15
3. 18
4. 20
Que. 222 Two bikers A and B start at same time and ride at 75 km/hr and 60 km/hr respectively towards each other.
They meet after 20 minutes. How far (in km) were they from each other when they started?
1. 60
2. 45
3. 30
4. 15
Que. 223 A plane flies a distance of 1800 km in 5 hours. What is its average speed in meters/second?
1. 200
2. 10
3. 20
4. 100
Que. 224 Flight A usually takes 1 hour more than Flight B to travel a distance of 7200 km. Due to engine trouble,
speed of flight B falls by a factor of 1/6, so it takes 36 minutes more than Flight A to complete the same
journey. What is the speed of Flight A (in km/hr)?
1. 800
2. 900
3. 750
4. 720
Que. 225 Two runners A and B start running at 12 km/hr and 16 km/hr towards each other. They meet after 1 hour
and 30 minutes. How far (in km) were they from each other when they started?
1. 42
2. 36
3. 40
4. 45
Que. 226 A bus travels 720 km in 20 hours. Calculate its average speed in meters/second.
1. 12
2. 15
3. 18
4. 10
Que. 227 A man is running at the speed of 20 km/hr. What is time (in seconds) taken by man to cover one round of
a circular garden of radius 350 metres?
1. 412
2. 336
3. 396
4. 376
Que. 228 A man goes to a place at a speed of 80 km/hr and comes back with a different speed. If the average speed
is 32 km/hr, then what is the return speed (in km/hr)?
1. 25
2. 22
3. 20
4. 24
Que. 229 Two men are standing on opposite ends of a 1000 metres long bridge. If they walks towards each other
with speeds of 20 m/s and 5 m/s respectively, then how much time (in seconds) will they take to meet
each other?
1. 50
2. 30
3. 40
4. 60
Que. 230 Mohan and Sohan walk at average speed of 1 km/hr and 2.4 km/hr respectively. If Mohan walks in South
direction and Sohan in East direction beginning from the same origin at the same time, what will be the
distance between the two after 5 hours?
1. 13 km
2. 30 km
3. √10 km
4. 17 km
Que. 231 A truck covers a distance of 1925 km in 35 hours. What is the average speed of the truck?
1. 45 km/hr
2. 40 km/hr
3. 55 km/hr
4. 50 km/hr
Que. 232 A train is moving with uniform speed crosses two tunnels of lengths 270 metres and 450 metres in 12
seconds and 15 seconds respectively. What is the speed (in km/hr) of the train?
1. 144
2. 169
3. 196
4. 216
Que. 233 Two trains start moving from stations S and R. Both trains move towards each other at speeds of 35
km/hr and 42 km/hr respectively. When they meet each other, the second train has travelled 90 km more
than the first. What is the distance (in km) between S and R?
1. 450
2. 990
3. 540
4. 1040
Que. 234 Two cyclists A and B run their cycles at average speed of 16 km/hr and 12 km/hr respectively. If A runs
in North direction and B in East direction beginning from the same origin at the same time, what will be
the minimum distance between the two after half an hour?
1. 14 km
2. 2√14 km
3. √10 km
4. 10 km
Que. 235 Two toy cars X and Y run at average speed of 0.5 km/hr and 1.5 km/hr respectively. If car X moves in
South direction and toy Y in East direction beginning from the same origin at the same time, what will be
the distance between the two after 4 hours?
1. 7 km
2. 2√10 km
3. √39 km
4. √19 km
Que. 236 A train crosses a platform in 40 seconds travelling with a speed of 72 km/h. If the length of the train be
300 metres, then what will be the length (in metres) of the platform?
1. 450
2. 500
3. 360
4. 600
Que. 237 A man goes to a place at a speed of 50 km/hr and comes back with a different speed. If the average speed
is 75 km/hr, then what is the return speed (in km/hr)?
1. 125
2. 180
3. 160
4. 150
Que. 238 A man riding his bicycle covers 150 meters in 25 seconds. What is his speed in km/hr?
1. 25
2. 21.6
3. 23
4. 20
Que. 239 A car covers a distance of 480 km at a uniform speed. If the speed of the car is 20 km/hours more, then it
takes 2 hours less to cover the same distance. What was the original speed of the car?
1. 45 km/hr
2. 50 km/hr
3. 60 km/hr
4. 70 km/hr
Que. 240 A man starts moving from a place A and reaches the place B in 26 hours. He coves 1/3rd of the distance at
the speed of 4 km/hr and covers the remaining distance at the speed of 5km/hr. What is the distance (in
km) between A and B?
1. 45
2. 80
3. 120
4. 90
Que. 241 A car travels some distance at a speed of 8 km/hr and returns at a speed of 12 km/hr. If the total time
taken by the car is 15 hours, then what is the distance (in km)?
1. 48
2. 60
3. 56
4. 72
Que. 242 A boy crosses a 300 meters wide road in 30 seconds. What is his speed (in km/hr)?
1. 18
2. 54
3. 36
4. 27
Que. 243 A 100 metre long train crosses a 800 metre long bridge. If the speed of the train is 30 km/hr, then what is
the time taken (in seconds) to cross the bridge?
1. 105
2. 108
3. 118
4. 120
Que. 244 A train running with a speed of 18 km/hr, crosses an electric pole. If the length of train is 540 metre, then
what is the time taken (in seconds) by the train to cross the pole?
1. 110
2. 100
3. 108
4. 105
Que. 245 A train of length, 245 metres, takes 20 seconds to cross a 355 metres long bridge. How much time (in
seconds) will the train take to cross a 390 metres long platform?
1. 6.5
2. 9
3. 21.16
4. 15
Que. 246 B starts 4 minutes after A from the same point, for a place at a distance of 7 miles from the starting point.
A on reaching the destination turns back and walks a mile where he meets B. If A's speed is a mile in 8
minutes then B's speed is a mile in ____ minutes.
1. 9
2. 12
3. 10
4. 8
Que. 247 Two cars A and B travel from one city to another, at speeds of 72 km/hr and 90 km/hr respectively. If car
B takes 1 hour lesser than car A for the journey, then what is the distance (in km) between the two cities?
1. 270
2. 360
3. 240
4. 400
Que. 248 Train A takes 45 minutes more than train B to travel a distance of 450 km. Due to engine trouble speed of
train B falls by a quarter, so it takes 30 minutes more than Train A to complete the same journey. What is
the speed of Train A (in km/hr)?
1. 90
2. 120
3. 100
4. 110
Que. 249 A racing car going at an average speed of 108 km/hr takes 15 minutes to complete a lap on a racing track.
By how much should it increase its speed (in km/hr) to complete the lap in 12 minutes?
1. 24
2. 21
3. 27
4. 30
Que. 250 A train passes two bridges of length 400 metres and 200 metres in 80 seconds and 60 seconds
respectively. What is the length (in metres) of the train?
1. 200
2. 400
3. 350
4. 720
Que. 251 Two men are standing on opposite ends of a 1600 meter long bridge. If they walk towards each other with
speeds of 12 m/s and 4 m/s respectively, then in how much time (in seconds) will they meet each other?
1. 120
2. 100
3. 180
4. 150
Que. 252 A man goes to a place at a speed of 70 km/hr and comes back with a different speed. If the average speed
is 17.5 km/hr, then what is the return speed (in km/hr)?
1. 12
2. 52.5
3. 10
4. 20
Que. 253 A train crosses a platform in 30 seconds travelling with a speed of 72 km/hr. If the length of the train be
120 metres, then what will be the length (in metres) of the platform?
1. 320
2. 450
3. 480
4. 360
Que. 254 A train 150 metres long is running at a speed of 15 metres per second. In how much time (in seconds) it
will cross a bridge of 300 metre long?
1. 10
2. 15
3. 30
4. 45
Que. 255 A cyclist covers a distance of 22 km in 4 hours. What is the average speed of the cyclists?
1. 4 km/hr
2. 4.5 km/hr
3. 5.5 km/hr
4. 10 km/hr
Que. 256 A man travels 1 hours of the journey at a speed of 10 km/hr and remaining 4 hours of the journey at 70
km/hr. What is the average speed (in km/hr) of the entire journey?
1. 55
2. 58
3. 56
4. 57
Que. 257 Mahesh can cover a certain distance in 24 hours if he walks at the rate of 16 km/hr. If he covers the same
distance by a car at the rate of 32 km/hr, then what is the time (in hours) taken by him?
1. 12
2. 9
3. 15
4. 18
Que. 258 A bus runs at an speed of 45 km/hr. If it completes 405 km long-journey with a break of 1 hour, what is
the total time taken during the journey?
1. 9 hrs
2. 10 hrs
3. 11 hrs
4. 12 hrs
Que. 259 B starts 4.5 minutes after A from the same point, for a place at a distance of 3.5 miles from the starting
point. A on reaching the destination turns back and walks a mile where he meets B. If A’s speed is a mile
in 6 minutes, then B’s speed is a mile in _______ minutes.
1. 8
2. 10
3. 12
4. 9
Que. 260 Two cars A and B travel from one city to another city, at speeds of 60 km/hr and 108 km/hr respectively.
If car B takes 2 hours lesser time than car A for the journey, then what is the distance (in km) between the
two cities?
1. 240
2. 270
3. 300
4. 330
Que. 261 Train A takes 1 hour more than train B to travel a distance of 720 km. Due to engine trouble speed of
train B falls by one third, so it takes 3 hours more than Train A to complete the same journey. What is the
speed of Train A (in km/hr)?
1. 80
2. 90
3. 60
4. 70
Que. 262 A car travelling at an average speed of 72 km/hr takes 9 minutes to travel a certain distance. By how
much should it increase its speed (in km/hr) to travel the same distance in 8 minutes?
1. 8
2. 9
3. 7
4. 6
Que. 263 A train is 400 metres long and running at a speed of 60 km/hr. How much time (in seconds) will it take to
cross a platform 1000 metres long?
1. 84
2. 72
3. 96
4. 108
Que. 264 If 200 meters long train takes 40 seconds to cross a pole, then what is the speed (in km/h) of the train?
1. 9 km/h
2. 18 km/h
3. 36 km/h
4. 45 km/h
Que. 265 A train travels some distance at a speed of 15 km/hr and returns at a speed of 9 km/hr. If the total time
taken by the train is 8 hours, then what is the distance (in km)?
1. 45
2. 36
3. 42
4. 60